[{"id":"7830d7db-dda1-4fb4-8333-50395efc7490","type":"Full Time","url":"https://jobs.github.com/positions/7830d7db-dda1-4fb4-8333-50395efc7490","created_at":"Wed Apr 17 14:01:23 UTC 2019","company":"JOIN Solutions AG","company_url":"https://join.com","location":"Berlin","title":"Senior Software Engineer (Node.js)","description":"\u003cp\u003eWe love Recruiting, and building amazing Recruiting Software.\u003c/p\u003e\n\u003cp\u003eJOIN is a brand new Recruiting platform to save time and money.\u003c/p\u003e\n\u003cp\u003eWe are working at a fervent pace to truly change hiring and recruiting. Our vision is to match exciting companies with the best candidates, in the most efficient way possible. Unifying applicant tracking system (ATS), Multiposting and Performance Recruiting, we are striving to bring digital recruitment to a new level.\u003c/p\u003e\n\u003cp\u003eThis position is available both to remote team members (must be in a timezone ±3 hours from Berlin) and to those interested in working from our office in the heart of Berlin.\u003c/p\u003e\n\u003cp\u003eOUR DEVELOPMENT VALUES\u003c/p\u003e\n\u003cp\u003eWe are passionate about technology, and about quality.\nWe use only modern technologies: TypeScript, Node.js, gcloud, Kubernetes, Docker, gRPC, Postgres, Redis, AWS, AWS Lambda, Micro-services.\nWe believe in automation. We automate anything and everything that can improve our productivity and focus.\nWe work in a CI/CD pipeline.\nWe are not “just” coders — we are always thinking about our product and how to improve the experience of our Clients.\nWe value transparency, close collaboration, and a certain amount of chaos in our work because it makes us faster and more creative.\u003c/p\u003e\n\u003cp\u003eWHAT YOU'LL DO\u003c/p\u003e\n\u003cp\u003eParticipate in architectural decision-making.\nBuild scalable backend systems for our applications, with the opportunity to work on other parts of the stack as well.\nConduct peer code reviews.\nRight from the start, you will be expected to suggest and implement your own ideas and projects.\u003c/p\u003e\n\u003cp\u003eYOU WILL BE A GREAT FIT FOR THIS ROLE IF YOU\u003c/p\u003e\n\u003cp\u003eEnjoy helping those around to you grow and be successful as developers.\nCan be autonomous and self-driven.\nGet inspired on a daily basis, think of new ideas, and like to share them with others.\nLove to experiment and to use data to drive decision making.\nCan communicate and collaborate with cross-functional teams to deliver compelling products and services.\nHave the ability to take on complex problems, learn quickly, and persist towards a good solution.\u003c/p\u003e\n\u003cp\u003eTECHNICAL REQUIREMENTS\u003c/p\u003e\n\u003cp\u003e5+ years of development experience\nStrong development experience in Node.js\nA strong technical background, with experience using modern web technologies\nExperience with TDD and continuous integration processes (CI/CD)\nExperience with relational and non-relational (e.g., PostgreSQL, Redis etc.) data stores\nExperience writing and utilizing RESTful API services\nFamiliarity with Docker and Kubernetes\nExperience with gcloud or AWS would be a plus\u003c/p\u003e\n\u003cp\u003eWHAT WE OFFER\u003c/p\u003e\n\u003cp\u003eWorking with a committed, successful and international team.\nA friendly and vibrant working culture of people who are keen to help each other.\nThe opportunity to contribute to an amazing product and help take it to the international level.\nWorking independently and gaining a lot of insight into the field of web software (SaaS) development.\nA salary adequate to your experiences and skills.\nRoom to grow within the company.\nA “forgiveness, not permission” attitude.\u003c/p\u003e\n\u003cp\u003eInterested?\u003c/p\u003e\n\u003cp\u003eIf you would like to be part of our success story, please submit your application and be sure to include a cover letter stating your earliest starting date and salary expectations, and whether you are interested in working remotely or from our Berlin office.\u003c/p\u003e\n\u003cp\u003eWe look forward to hearing from you!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply via the following link:\n\u003ca href=\"https://hire.withgoogle.com/public/jobs/joincom/view/P_AAAAABkAACuDPGDoXCx8mU?trackingTag=gitHub\"\u003ehttps://hire.withgoogle.com/public/jobs/joincom/view/P_AAAAABkAACuDPGDoXCx8mU?trackingTag=gitHub\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVpsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--340ca06da101fd140ef4a6688e5f378a017609c0/JOIN-Logo-Blue.png"},{"id":"f29f6632-2589-453d-8db5-8687841977f7","type":"Full Time","url":"https://jobs.github.com/positions/f29f6632-2589-453d-8db5-8687841977f7","created_at":"Wed Apr 17 13:58:12 UTC 2019","company":"JOIN Solutions AG","company_url":"https://join.com","location":"Berlin","title":"Infrastructure Engineer (DevOps)","description":"\u003cp\u003eWe love Recruiting, and building amazing Recruiting Software.\u003c/p\u003e\n\u003cp\u003eJOIN is a brand new Recruiting platform to save time and money.\u003c/p\u003e\n\u003cp\u003eWe are working at a fervent pace to truly change hiring and recruiting. Our vision is to match exciting companies with the best candidates, in the most efficient way possible. Unifying applicant tracking system (ATS), Multiposting and Performance Recruiting, we are striving to bring digital recruitment to a new level.\u003c/p\u003e\n\u003cp\u003eThis position is available both to remote team members (must be in a timezone ±3 hours from Berlin) and to those interested in working from our office in the heart of Berlin.\u003c/p\u003e\n\u003cp\u003eOUR DEVELOPMENT VALUES\u003c/p\u003e\n\u003cp\u003eWe are passionate about technology, and about quality.\nWe use only modern technologies: TypeScript, Node.js, gcloud, Kubernetes, Docker, gRPC, Postgres, Redis, AWS, AWS Lambda, Micro-services.\nWe believe in automation. We automate anything and everything that can improve our productivity and focus.\nWe work in a CI/CD pipeline.\nWe are not “just” coders — we are always thinking about our product and how to improve the experience of our Clients.\nWe value transparency, close collaboration, and a certain amount of chaos in our work because it makes us faster and more creative.\u003c/p\u003e\n\u003cp\u003eWHAT YOU'LL DO\u003c/p\u003e\n\u003cp\u003eOwn and operate all aspects of our online serving infrastructure across all environments.\nSupport engineers in building next-generation recruitment platform.\nAutomate anything and everything, including yourself\nRebuild our continuous delivery systems to enable simpler, faster, and more robust build and release processes (e.g. canary deployments).\nImprove the monitoring system for the whole infrastructure\nSetup security environments, leveraging an “infrastructure as code” approach.\u003c/p\u003e\n\u003cp\u003eYOU WILL BE A GREAT FIT FOR THIS ROLE IF YOU\u003c/p\u003e\n\u003cp\u003eEnjoy helping those around to you grow and be successful as developers.\nCan be autonomous and self-driven.\nGet inspired on a daily basis, think of new ideas, and like to share them with others.\nLove to experiment and to use data to drive decision making.\nCan communicate and collaborate with cross-functional teams to deliver compelling products and services.\nHave the ability to take on complex problems, learn quickly, and persist towards a good solution.\u003c/p\u003e\n\u003cp\u003eTECHNICAL REQUIREMENTS\u003c/p\u003e\n\u003cp\u003eExperience and empathy in building products/systems/tools for engineers\nHands-on experience building and scaling products/systems/tools that support microservice-oriented architectures (Docker, Kubernetes, helm)\nExperience with gcloud and AWS\nExtensive familiarity with the Linux internals\nAble to write clean and maintainable code (our main language is TypeScript)\u003c/p\u003e\n\u003cp\u003eWHAT WE OFFER\u003c/p\u003e\n\u003cp\u003eWorking with a committed, successful and international team.\nA friendly and vibrant working culture of people who are keen to help each other.\nThe opportunity to contribute to an amazing product and help take it to the international level.\nWorking independently and gaining a lot of insight into the field of web software (SaaS) development.\nA salary adequate to your experiences and skills.\nRoom to grow within the company.\nA “forgiveness, not permission” attitude.\u003c/p\u003e\n\u003cp\u003eInterested?\u003c/p\u003e\n\u003cp\u003eIf you would like to be part of our success story, please submit your application and be sure to include a cover letter stating your earliest starting date and salary expectations, and whether you are interested in working remotely or from our Berlin office.\u003c/p\u003e\n\u003cp\u003eWe look forward to hearing from you!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply via the following link:\n\u003ca href=\"https://hire.withgoogle.com/public/jobs/joincom/view/P_AAAAABkAACuHGwNh_FWywF?trackingTag=gitHub\"\u003ehttps://hire.withgoogle.com/public/jobs/joincom/view/P_AAAAABkAACuHGwNh_FWywF?trackingTag=gitHub\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaU5sIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--89eb9033e5ddb6e369f11acae389847aa8d1ff46/JOIN-Logo-Blue.png"},{"id":"34a8b372-18bb-4d0a-9ac6-85568bce2b04","type":"Full Time","url":"https://jobs.github.com/positions/34a8b372-18bb-4d0a-9ac6-85568bce2b04","created_at":"Wed Apr 17 10:31:57 UTC 2019","company":"moovel Group GmbH","company_url":"https://www.moovel.com/de/DE","location":"Berlin","title":"Engineering Manager (f/m/d) Technology Company seeks Leader","description":"\u003ch2\u003eHi,\u003c/h2\u003e\n\u003cp\u003ewe are Lothar, Tammo, Jan, Magnus and Oliver from the tech department. Together with our cross-functional teams we are responsible for creating the software solutions that our product team envisions and which our customers love. We are currently looking for a tech lead that will lead and grow our engineering teams in Berlin.\u003c/p\u003e\n\u003ch2\u003eFIRST A QUICK LOOK AT US\u003c/h2\u003e\n\u003cp\u003eDaimler AG and BMW Group are bundling their mobility services in the areas of Carsharing, Ride- Hailing, Parking, Charging and Multimodal Platforms, and create a new global player comprising of five joint ventures. moovel Group is joining forces with ReachNow - and becomes REACH NOW\u003c/p\u003e\n\u003cp\u003eOur vision is a planet without traffic jams. Our mission is to transform cities by providing the most convenient and sustainable mobility solutions. We create outstanding products with technical excellence, an agile mindset, an open feedback and failure culture and fun at work. moovel (REACH NOW) is part of two global corporations, but at the heart of it we still are a start- up. We act as a partner for cities, transport networks and mobility service providers with the goal of making cities smarter and creating an operating system for urban mobility that provides access to appropriate mobility options in urban areas and paves the way for the future with autonomous vehicles. Currently, 300 employees work in small creative teams in Germany and the US at four locations - Hamburg, Berlin, Stuttgart and Portland.\u003c/p\u003e\n\u003ch2\u003eSOME OF THE THINGS YOU WILL DO\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eGive guidance to the engineers in our Berlin squads in developing a modern, cloud based mobility platform\u003c/li\u003e\n\u003cli\u003eGrow our tech-organization in Berlin and foster an agile engineering culture\u003c/li\u003e\n\u003cli\u003eEngage and challenge our engineers with servant leadership and your ability to give purpose\u003c/li\u003e\n\u003cli\u003eBalance guidance and freedom and coach engineers\u003c/li\u003e\n\u003cli\u003eRepresent our culture and product at events / or meetups together with engineers\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eABOUT YOU\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eAt moovel we work in cross-functional and agile engineering teams and you are experienced with a work environment like that plus you have long-term experience (5+ years) in building, growing and sustaining teams\u003c/li\u003e\n\u003cli\u003eTechnical excellence is something you are striving for\u003c/li\u003e\n\u003cli\u003eYou have a solid background in backend-focused development with technologies such as microservices, cloud-based infrastructure, API-driven development\u003c/li\u003e\n\u003cli\u003eIt is helpful to be familiar with our Technology Stack (Node.js, JVM, AWS), most importantly, however, you should bring seniority in engineering, so our teams can trust in your ability to help them in their decision making process\u003c/li\u003e\n\u003cli\u003eYou are passionate about moovel’s mission and want to create products that our customers love\u003c/li\u003e\n\u003cli\u003eYou use the art of leadership to motivate and inspire your team in order to ensure the delivery of moovel’s mission\u003c/li\u003e\n\u003cli\u003eWe live an open feedback culture so you need to be experienced with giving honest feedback in order to guide our moovelanos and foster their personal development\u003c/li\u003e\n\u003cli\u003eYou are well connected and established a certain footprint within the technology space, which helps you to stay on top of the latest developments and attract talents to the company. Active participation in conferences, organisation of meetups or blogging activity would be helpful\u003c/li\u003e\n\u003cli\u003eMust be a caring human being\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eBENEFITS\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eChoose your own hardware\u003c/li\u003e\n\u003cli\u003eWorking with newest technologies \u0026amp; microservices\u003c/li\u003e\n\u003cli\u003eCompany pension plan\u003c/li\u003e\n\u003cli\u003eFree breakfast, good coffee \u0026amp; fresh fruits\u003c/li\u003e\n\u003cli\u003eMonthly mobility budget\u003c/li\u003e\n\u003cli\u003eBe part of an interdisciplinary team of experts\u003c/li\u003e\n\u003cli\u003eWorking on products with a high impact on society\u003c/li\u003e\n\u003cli\u003eInternational teams\u003c/li\u003e\n\u003cli\u003eChild care allowance\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIn summary, we are looking for an experienced leader with a strong technical background for our Berlin location, that helps people grow and contributes to making our organization better. If this posting catches you and you are more than ready for this challenge, we definitely want to meet you.\u003c/p\u003e\n\u003cp\u003eBeing a part of the exciting journey that lies ahead of us will be very rewarding. So just send us your application by clicking on application form.\u003c/p\u003e\n\u003cp\u003eLothar, Jan, Tammo, Magnus and Oliver\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://moovelgroup.redirect.your-jobresponse.com/engineering_manager_f_m_d_technology_company_seeks_leader_berlin/246849/V819/anwenden\"\u003eClick here for the application form\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIf you have any questions or are in need for further information feel free to contact\nJanosch Fingerhut +49 30 549073811\u003c/strong\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://moovelgroup.redirect.your-jobresponse.com/engineering_manager_f_m_d_technology_company_seeks_leader_berlin/246849/V819/anwenden\"\u003eClick here for the application form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHRsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9dd267a1a167a351d281f61958728980905ff23f/moovelreachnow.png"},{"id":"8ac0fffe-aefc-42d8-93a2-40f77b035233","type":"Full Time","url":"https://jobs.github.com/positions/8ac0fffe-aefc-42d8-93a2-40f77b035233","created_at":"Wed Apr 17 09:23:15 UTC 2019","company":"CHUV","company_url":"https://www.chuv.ch","location":"Lausanne","title":"Data Analyste IT Recherche SPHN","description":"\u003cp\u003eRésumé du poste:\u003c/p\u003e\n\u003cp\u003eLa Direction des système d'information du CHUV recherche un-e Data analyste IT Recherche, pour un CDI lié à un fonds, ceci afin de renforcer son équipe Data Science \u0026amp; Recherche.\u003c/p\u003e\n\u003cp\u003eContexte:\u003c/p\u003e\n\u003cp\u003eLe Centre hospitalier universitaire vaudois (CHUV) est l'un des 5 hôpitaux universitaires suisses. Grâce à sa collaboration avec la Faculté de biologie et médecine de l'Université de Lausanne et l'EPFL, le CHUV joue un rôle de pointe dans les domaines des soins médicaux, de la recherche médicale et de la formation.\u003c/p\u003e\n\u003cp\u003eL’équipe Data Science \u0026amp; Recherche, rattachée à la Direction des systèmes d’information, met à disposition des investigateurs des données cliniques dépersonnalisées et codées afin qu’ils puissent mener leurs projets de recherche en respectant le cadre légal et éthique en vigueur.\u003c/p\u003e\n\u003cp\u003eLe CHUV et l’équipe Data Science \u0026amp; Recherche participent à l’initiative nationale SPHN (Swiss Personalized Health Network) pour promouvoir le développement de la médecine personnalisée et de la santé personnalisée en Suisse.\u003c/p\u003e\n\u003cp\u003eMissions:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDans le domaine de la recherche clinique, vous collectez les données du Datawarehouse de\nrecherche clinique du CHUV afin de les rendre interopérables avec les autres hôpitaux\nuniversitaires selon les besoins des projets SPHN\u003c/li\u003e\n\u003cli\u003eVous effectuez les extractions et l'intégration de données, transcodage, encodage, livraison des\ndonnées finales\u003c/li\u003e\n\u003cli\u003eVous mettez en œuvre les techniques de data quality management appropriées et documentez les\nméta-données associées.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eProfil:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eVous êtes informaticien-ne de formation et bénéficiez d’une expérience confirmée dans la gestion\nde données médicales ou dans le contexte de la recherche médicale\u003c/li\u003e\n\u003cli\u003eVous êtes un expert dans la manipulation des données et vous avez une expérience confirmée\navec SQL\u003c/li\u003e\n\u003cli\u003eVous disposez de connaissances avec R et/ou Python, un plus\u003c/li\u003e\n\u003cli\u003eVous êtes motivé-e par les technologies innovantes liées au big data\nDe nature collaborative, vous avez plaisir à développer des relations avec les chercheurs, m\nmédecins et experts informaticiens nécessaires pour trouver les solutions dans un contexte en\npleine mutation\u003c/li\u003e\n\u003cli\u003eOrienté-e solutions, vous aimez participer à des projets et collaborez avec les métiers.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eNous offrons:\u003c/p\u003e\n\u003cp\u003eDevenir une collaboratrice ou un collaborateur du Centre hospitalier universitaire vaudois, c'est l'assurance de bénéficier :\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDe prestations sociales de premier ordre\u003c/li\u003e\n\u003cli\u003eD'un droit à trois jours de formation minimum par année\u003c/li\u003e\n\u003cli\u003eDe 25 jours de vacances par année\u003c/li\u003e\n\u003cli\u003eDe restaurants d'entreprise de qualité hôtelière, dans chacun des bâtiments de l'institution.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eContact et envoi de candidature:\u003c/p\u003e\n\u003cp\u003eContact pour informations sur la fonction : Mme Nathalie Jacquemont, au 079 556 63 73.\u003c/p\u003e\n\u003cp\u003eDans la mesure où toutes nos candidatures sont traitées de manière électronique, nous vous remercions de postuler exclusivement par internet, en cliquant sur le bouton POSTULER en bas de l’annonce. Si pour des raisons techniques, vous ne pouvez pas postuler en ligne, nous vous invitons à vous rendre physiquement auprès de notre équipe e-recrutement, qui vous accompagnera dans votre démarche (contact : 021.314.85.70). Nous vous répondons du lundi au vendredi de 8h00 à 11h30 et de 13h30 à 16h30.\u003c/p\u003e\n\u003cp\u003eLe CHUV applique les exigences de qualité les plus élevées dans le cadre de ses processus de recrutement. En outre, soucieux de promouvoir la diversité de nos collaboratrices et collaborateurs, nous sommes attentifs aux différents parcours de vie et mettons tout en œuvre pour garantir l’égalité de traitement et éviter toute discrimination. Nous nous réjouissons de recevoir votre candidature.\u003c/p\u003e\n\u003cp\u003eNous remercions par avance les agences de placement de prendre bonne note que les candidatures insérées par leurs soins directement sur notre plateforme de recrutement ne sont pas acceptées et ne peuvent donner lieu à une facturation. Merci de votre compréhension.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eNous vous remercions de postuler exclusivement par internet, en cliquant sur le bouton POSTULER en bas de l’annonce:\n\u003ca href=\"https://recrutement.chuv.ch/vacancy/data-analyste-it-recherche-sphn-237448.html\"\u003ehttps://recrutement.chuv.ch/vacancy/data-analyste-it-recherche-sphn-237448.html\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGhsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1903b5f6b4438b82cd055e38e5b7abb24ee08758/Universit%C3%A4tsspital_Lausanne_CHUV_logo.svg.png"},{"id":"ec451dc1-0623-4677-83d8-4fe3f77b3d06","type":"Full Time","url":"https://jobs.github.com/positions/ec451dc1-0623-4677-83d8-4fe3f77b3d06","created_at":"Wed Apr 17 06:31:11 UTC 2019","company":"CircleCI","company_url":null,"location":"Remote - Ireland, Germany, UK","title":"Engineering Team Leads ","description":"\u003cp\u003eCircleCI is looking for Engineering Team Leads to support our engineering teams in continuously delivering user value. If you bring an engineering background and are excited about helping engineers deliver user value every day, and want to grow further towards engineering management, this role could be for you.\u003c/p\u003e\n\u003cp\u003eThe Team Lead role is an essential part of our distributed engineering organization, and Team Leads play a key role in helping teams be healthy and understand and shape their daily work on delivering value to our users. As a Team Lead at CircleCI, you’ll become part of one of our engineering teams. You’ll spend around 80% of your time supporting your team, and around 20% of your time on hands-on technical work. The Team Lead role is the first step on CircleCI's engineering management career track.\u003c/p\u003e\n\u003cp\u003eWho you'll work with:\u003c/p\u003e\n\u003cp\u003eYou'll join a distributed, cross-functional team of 6-8 people that includes both product and site reliability engineers. You'll collaborate with other Team Leads and work closely with:\u003c/p\u003e\n\u003cp\u003eTech Leads: senior engineers responsible for driving technical decisions within their own teams and across the engineering organization.\u003c/p\u003e\n\u003cp\u003eProduct Managers: collaborate with Product and your engineer teammates to solve our customers’ biggest challenges, jointly define milestones, and guide the team's weekly planning.\u003c/p\u003e\n\u003cp\u003eEngineering Managers: you'll report directly to an engineering manager who supports 1-2 teams on a more strategic level, coordinates staffing, and supports career development of you and your teammates.\u003c/p\u003e\n\u003cp\u003eAs a Team Lead at CircleCI, you’ll have impact in the following areas:\u003c/p\u003e\n\u003cp\u003eUser value delivery: Ensure incremental value delivery and high-quality standards for your team.\u003c/p\u003e\n\u003cp\u003ePartner with product managers to plan your team's strategic work.\u003c/p\u003e\n\u003cp\u003eFacilitation: Guide your team’s agile ceremonies on an ongoing basis. Plan and prepare those together with the Product Manager and Tech Lead for your team.\u003c/p\u003e\n\u003cp\u003ePlanning: Collaborate with the engineering and product leadership teams on longer-term, strategic  planning. Develop measurable OKRs and ensure the team utilises them to guide their work.\u003c/p\u003e\n\u003cp\u003eKnowledge sharing: Ensure that your teammates continue to learn and grow together as a team.\u003c/p\u003e\n\u003cp\u003eProcess and Product: Maintain high levels of transparency, efficiency, and collaboration in your team, as well as with your peers and your team’s Product Manager.\u003c/p\u003e\n\u003cp\u003eSupporting growth of your team and your teammates: Work with your teammates and engineering leadership to make use of opportunities to grow.\u003c/p\u003e\n\u003cp\u003eFeedback \u0026amp; communication: Provide feedback to your teammates, as well as engineering leadership, on a regular basis. Communicate you team's progress towards its goals.\u003c/p\u003e\n\u003cp\u003eTechnical work: In this role, you’ll spend 10-20% of your time coding, with frequent pair programming\nAbout you:\u003c/p\u003e\n\u003cp\u003eThis role is most suited for folks with an engineering background who have started doing project and process management work already.—Do you love collaboration and teamwork? Are you eager to learn new things and help others learn, too? Are you a strong communicator in both synchronous and asynchronous mediums? If so, here’s the additional experience we’re looking for:\u003c/p\u003e\n\u003cp\u003e1+ year of experience in agile/lean project management with engineering teams (or similar roles). You understand modern software engineering practices and how to apply them to ensure continuous incremental delivery of user value. You know how to utilise metrics and agile ceremonies to continuously improve the way your team operates.\u003c/p\u003e\n\u003cp\u003eRemote work: You bring at least 6 months of experience working with distributed teams.\u003c/p\u003e\n\u003cp\u003eTechnical skills: At least 2 years of experience crafting code in Clojure, Go, or another functional programming language.\u003c/p\u003e\n\u003cp\u003eLearning: You bias towards action, both in your own work, as well as in your enablement of others, and bring a drive to continuously help your team improve.\u003c/p\u003e\n\u003cp\u003eCommunication and teamwork: You’re an effective communicator and collaborator. You thrive on building strong relationships with your teammates and stakeholders for your team.\u003c/p\u003e\n\u003cp\u003eWe know there’s no such thing as an “ideal” candidate - we’re all a work in progress and are growing new skills and capabilities all the time. CircleCI welcomes those who are enthusiastic about learning and evolving, so however you identify and whatever your background, if this looks like a role where you could do work that excites you, we hope you’ll apply.\u003c/p\u003e\n\u003cp\u003eAbout CircleCI\u003c/p\u003e\n\u003cp\u003eWe are a globally distributed team working towards the common goal of being the standard bearer for continuous integration and deployment software. We are looking for people who are interested in helping us shape software engineering best practices for the industry as a whole.\u003c/p\u003e\n\u003cp\u003eCircleCI is the best platform for software teams looking to rapidly build quality projects, at scale. Our intelligent continuous integration and delivery tools are simple yet powerful. Our aim is to provide the wisdom of a connected development ecosystem to every team member making technology decisions.\u003c/p\u003e\n\u003cp\u003eWe run 12M+ builds a month on our platform for companies like Spotify, Kickstarter, Sony, and Coinbase. Over 25,000 organizations and 300,000 developers actively build, test, and deploy on CircleCI. We’ve raised $59.5M in venture capital from Industry Ventures, Top Tier Capital, Scale Venture Partners, DFJ, Harrison Metal Capital, and Baseline Ventures.\u003c/p\u003e\n\u003cp\u003eCircleCI is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://boards.greenhouse.io/circleci/jobs/4255248002\"\u003ehttps://boards.greenhouse.io/circleci/jobs/4255248002\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaFZsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--68e47a2800fe0fdf536052fa97a6ef342836112a/circle-logo-badge-black%20(1).png"},{"id":"afc6277b-8f60-4601-9dc7-7cb8901876b1","type":"Full Time","url":"https://jobs.github.com/positions/afc6277b-8f60-4601-9dc7-7cb8901876b1","created_at":"Wed Apr 17 05:55:32 UTC 2019","company":"CircleCI","company_url":null,"location":"Remote - Ireland, Germany, UK","title":"Senior Application Security Engineer","description":"\u003cp\u003eCircleCI is looking for an experienced Application Security Engineer capable of advancing security across our entire platform–from our single-page web app to the containers in our build system. You will work closely with Software Engineering and SRE teams, bringing security in early in the life-cycle and working with engineers to build security from design through production.\u003c/p\u003e\n\u003cp\u003eWhat will make you successful:\u003c/p\u003e\n\u003cp\u003eSoftware development experience, interest and ability.\u003c/p\u003e\n\u003cp\u003eProficiency in one or more of: Clojure, Go, Java, C#, C, C++, Ruby.\u003c/p\u003e\n\u003cp\u003eDeep understanding of the fundamentals of security at multiple layers of abstraction, from operating systems to applications.\u003c/p\u003e\n\u003cp\u003eCollaborative approach to mentoring software engineers on the development of secure code.\u003c/p\u003e\n\u003cp\u003ePassion for modern software development and operation, including agile, CI/CD, and infrastructure-as-code.\u003c/p\u003e\n\u003cp\u003eExperience with the specific security implications of operating in a cloud environment.\u003c/p\u003e\n\u003cp\u003eSystematic problem solving approach, coupled with a strong sense of ownership and drive.\u003c/p\u003e\n\u003cp\u003eEnjoy flexibility in role and a desire to experiment with different approaches.\u003c/p\u003e\n\u003cp\u003eExcited by the ability to make significant impact in a growing company.\u003c/p\u003e\n\u003cp\u003eA strong desire for continuous improvement.\u003c/p\u003e\n\u003cp\u003e5+ years of experience in software, 2+ in security.\u003c/p\u003e\n\u003cp\u003eWhat you will do:\u003c/p\u003e\n\u003cp\u003eSupport and advise software engineering teams in the design of secure software.\u003c/p\u003e\n\u003cp\u003eDesign and deliver shared libraries and services to support security requirements within our platform.\u003c/p\u003e\n\u003cp\u003eWork with 3rd-party partners to manage our ongoing penetration testing program.\u003c/p\u003e\n\u003cp\u003eRecommend and deploy tooling to manage security in the delivery pipeline as well as production systems.\u003c/p\u003e\n\u003cp\u003eEngage with large customers as needed to advise them on security practices when deploying our solutions.\u003c/p\u003e\n\u003cp\u003eDiagnose and resolve security issues in conjunction with software engineering teams.\u003c/p\u003e\n\u003cp\u003eParticipate in defining security-related end user features in the CircleCI product.\u003c/p\u003e\n\u003cp\u003eWorking remotely at CircleCI\u003c/p\u003e\n\u003cp\u003eWe’re a distributed company with teammates across the world. We can support you working remotely anywhere in Ireland, the UK or Germany.\u003c/p\u003e\n\u003cp\u003eAbout CircleCI\u003c/p\u003e\n\u003cp\u003eWe are a globally distributed team working towards the common goal of being the standard bearer for continuous integration and deployment software. We are looking for people who are interested in helping us shape software engineering best practices for the industry as a whole.\u003c/p\u003e\n\u003cp\u003eCircleCI is the best platform for software teams looking to rapidly build quality projects, at scale. Our intelligent continuous integration and delivery tools are simple yet powerful. Our aim is to provide the wisdom of a connected development ecosystem to every team member making technology decisions.\u003c/p\u003e\n\u003cp\u003eWe run 12M+ builds a month on our platform for companies like Spotify, Kickstarter, Sony, and Coinbase. Over 25,000 organizations and 300,000 developers actively build, test, and deploy on CircleCI. We’ve raised $59.5M in venture capital from Industry Ventures, Top Tier Capital, Scale Venture Partners, DFJ, Harrison Metal Capital, and Baseline Ventures.\u003c/p\u003e\n\u003cp\u003eCircleCI is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://boards.greenhouse.io/circleci/jobs/4251668002\"\u003ehttps://boards.greenhouse.io/circleci/jobs/4251668002\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZzlsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--595f01607ce1a2bfa65738930cb5e6d6180bbff4/circle-logo-badge-black%20(1).png"},{"id":"d8209b13-8fb7-43a9-8173-26d86fd72bf2","type":"Full Time","url":"https://jobs.github.com/positions/d8209b13-8fb7-43a9-8173-26d86fd72bf2","created_at":"Wed Apr 17 04:28:22 UTC 2019","company":"Atlatec GmbH","company_url":null,"location":"Karlsruhe","title":"Software Developer C++ for 3D maps (m,f,d)","description":"\u003ch1\u003eJob description\u003c/h1\u003e\n\u003cp\u003eWe are developing technology to build high-definition 3D maps. We use this technology to scan roads and our automotive customers use these 3D maps for autonomous driving. Unlike many others we use nothing but cameras, GPS and artificial intelligence to create such maps. This allows to create these maps at scale. Two examples are shown below.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/8fd22a3681acafec28deb92eceaa1cc6f3b45efe/687474703a2f2f7777772e61746c617465632e64652f646f776e6c6f6164732f6265726c696e312e6a7067\"\u003e\n\u003cimg src=\"https://camo.githubusercontent.com/0944bd13a542770a8c883901052a349d55a493ee/687474703a2f2f7777772e61746c617465632e64652f646f776e6c6f6164732f6265726c696e322e6a7067\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eWe currently build customer-specific maps in Europe, USA and Japan and we need your help.\u003c/em\u003e\u003c/p\u003e\n\u003ch1\u003eWhat you will do\u003c/h1\u003e\n\u003cul\u003e\n\u003cli\u003eextending existing software modules and components\u003c/li\u003e\n\u003cli\u003edevelop Linux-based software to create and release HD maps for self-driving vehicles\u003c/li\u003e\n\u003cli\u003edesign and develop efficient, scalable algorithms and pipelines to quickly process large-scale geo data\u003c/li\u003e\n\u003cli\u003eActing as a technical contact person for the customer\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch1\u003eWhat you’ll bring to the team\u003c/h1\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor degree in Computer Science or related field, Master degree is a plus\u003c/li\u003e\n\u003cli\u003e1+ years working experience in C++ software development\u003c/li\u003e\n\u003cli\u003eExperience with Linux\u003c/li\u003e\n\u003cli\u003eExperience with Python is a plus\u003c/li\u003e\n\u003cli\u003eExperience with Computer Vision is a plus\u003c/li\u003e\n\u003cli\u003eGood organization and communication skills and team player\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch1\u003eWhat we offer\u003c/h1\u003e\n\u003cul\u003e\n\u003cli\u003eWork on current topics such as autonomous driving\u003c/li\u003e\n\u003cli\u003estart-up vibe\u003c/li\u003e\n\u003cli\u003ementorship from senior engineers\u003c/li\u003e\n\u003cli\u003eplenty of learning opportunity\u003c/li\u003e\n\u003cli\u003efriendly and diverse team\u003c/li\u003e\n\u003cli\u003efree snacks\u003c/li\u003e\n\u003cli\u003eopen feedback culture\u003c/li\u003e\n\u003cli\u003etable football\u003c/li\u003e\n\u003cli\u003efurther development of skills as a C++ expert\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch1\u003eHiring process\u003c/h1\u003e\n\u003col\u003e\n\u003cli\u003euse this link to apply (no emails please) \u003ca href=\"https://atlatecgmbh.recruitee.com/o/software-developer-c-for-3d-maps-mfd\"\u003eApply Here\u003c/a\u003e\n\u003c/li\u003e\n\u003cli\u003eplease fill out the application \u003cem\u003eonline\u003c/em\u003e and upload your CV including university certificate and school diploma.  Please include reference letters (\"Arbeitszeugnis\") if you have any.\u003c/li\u003e\n\u003cli\u003ewe will kindly ask you to complete a small assignment\u003c/li\u003e\n\u003cli\u003ewe will invite you for a job interview\u003c/li\u003e\n\u003cli\u003eyou'll get the offer and contract :-)\u003c/li\u003e\n\u003c/ol\u003e\n","how_to_apply":"\u003cp\u003euse this link to apply (no emails please) [Apply Here]\u003ca href=\"https://atlatecgmbh.recruitee.com/o/software-developer-c-for-3d-maps-mfd\"\u003ehttps://atlatecgmbh.recruitee.com/o/software-developer-c-for-3d-maps-mfd\u003c/a\u003e)\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZzFsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a4cd20ffcab1d6039d87f4b00c693d0d112c6036/atlatec.png"},{"id":"b1a29663-9195-43cb-8f58-6835c3754b9e","type":"Full Time","url":"https://jobs.github.com/positions/b1a29663-9195-43cb-8f58-6835c3754b9e","created_at":"Tue Apr 16 23:28:44 UTC 2019","company":"CircleCI","company_url":null,"location":"Remote - North America ","title":"Clojure Developers ","description":"\u003cp\u003eCircleCI seeks experienced Clojure engineers who are excited to help shape the future of our product. We’re growing fast and continuously hiring folks to join our mission: enabling thousands of developers to do better work every single day.\u003c/p\u003e\n\u003cp\u003eYou'll join a distributed, cross-functional team of product and site-reliability engineers building features and services with an eye towards incremental delivery and business value. You'll write sustainable, resilient Clojure code as part of an engineering organization that values collaboration, trust, and learning.\u003c/p\u003e\n\u003cp\u003eYou will have direct impact in the following ways:\u003c/p\u003e\n\u003cp\u003eContinuously delivering new features to our customers.\u003c/p\u003e\n\u003cp\u003eFostering a culture of observability and monitoring; helping your team use operational data to improve the stability and performance of our systems.\u003c/p\u003e\n\u003cp\u003eCollaborating across teams to evolve our architecture.\u003c/p\u003e\n\u003cp\u003eWriting sustainable, high-quality, high-performance Clojure code.\u003c/p\u003e\n\u003cp\u003eOwning micro-services throughout their entire lifecycle.\u003c/p\u003e\n\u003cp\u003ePartnering with product owners to set the direction of our platform.\u003c/p\u003e\n\u003cp\u003eDo you love collaboration and teamwork? Are you eager to learn new things and help others learn, too? Are you a strong communicator in both synchronous and asynchronous mediums? If so, here’s the additional experience we’re looking for:\u003c/p\u003e\n\u003cp\u003e4+ years of backend development experience.\u003c/p\u003e\n\u003cp\u003eExperience with functional programming in Clojure or another programming language.\u003c/p\u003e\n\u003cp\u003eA focus on delivering high-quality code through strong testing practices.\u003c/p\u003e\n\u003cp\u003eWe know there’s no such thing as an “ideal” candidate - we’re all a work in progress and are growing new skills and capabilities all the time. CircleCI welcomes those who are enthusiastic about learning and evolving, so however you identify and whatever your background, if this looks like a role where you could do work that excites you, we hope you’ll apply.\u003c/p\u003e\n\u003cp\u003eAbout CircleCI\u003c/p\u003e\n\u003cp\u003eWe are a globally distributed team working towards the common goal of being the standard bearer for continuous integration and deployment software. We are looking for people who are interested in helping us shape software engineering best practices for the industry as a whole.\u003c/p\u003e\n\u003cp\u003eCircleCI is the best platform for software teams looking to rapidly build quality projects, at scale. Our intelligent continuous integration and delivery tools are simple yet powerful. Our aim is to provide the wisdom of a connected development ecosystem to every team member making technology decisions.\u003c/p\u003e\n\u003cp\u003eWe run 12M+ builds a month on our platform for companies like Spotify, Kickstarter, Sony, and Coinbase. Over 25,000 organizations and 300,000 developers actively build, test, and deploy on CircleCI. We’ve raised $59.5M in venture capital from Industry Ventures, Top Tier Capital, Scale Venture Partners, DFJ, Harrison Metal Capital, and Baseline Ventures.\u003c/p\u003e\n\u003cp\u003eCircleCI is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://boards.greenhouse.io/circleci/jobs/4254561002\"\u003ehttps://boards.greenhouse.io/circleci/jobs/4254561002\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ3RsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c9d9c234f810cd1e25443b12e1b548ce7df063d4/circle-logo-badge-black%20(1).png"},{"id":"ac173106-4356-41eb-9569-e966f4e5bc77","type":"Full Time","url":"https://jobs.github.com/positions/ac173106-4356-41eb-9569-e966f4e5bc77","created_at":"Tue Apr 16 21:18:50 UTC 2019","company":"CircleCI","company_url":"http://CircleCI","location":"Remote - North America ","title":"Backend Developers, Distributed Systems","description":"\u003cp\u003eCircleCI seeks experienced software engineers with distributed systems experience who are excited to help us shape the future of our platform. We’re growing fast and continuously hiring folks to join our mission: enabling thousands of developers to do better work every single day.\u003c/p\u003e\n\u003cp\u003eYou'll join a distributed, cross-functional team building the software that powers the CircleCI platform. You'll gain a deep understanding of our system and solve challenging problems at scale while delivering new capabilities to our customers. You'll write sustainable, resilient code as part of an engineering organization that values collaboration, trust, and learning.\u003c/p\u003e\n\u003cp\u003eYou will have direct impact in the following ways:\u003c/p\u003e\n\u003cp\u003eImproving our systems-level tooling and programming to make our system more robust and reliable.\u003c/p\u003e\n\u003cp\u003eFostering a culture of observability and monitoring; helping your team use operational data to improve the stability and performance of our systems.\u003c/p\u003e\n\u003cp\u003eSolving complex operational challenges in tandem with other teams from engineering, SRE, and support.\u003c/p\u003e\n\u003cp\u003eCollaborating with your team to evolve our architecture.\u003c/p\u003e\n\u003cp\u003eWriting sustainable, high-quality, high-performance code using Go.\u003c/p\u003e\n\u003cp\u003ePartnering with product owners to set the direction of our platform.\u003c/p\u003e\n\u003cp\u003eDo you love collaboration and teamwork? Are you eager to learn new things and help others learn, too? Are you a strong communicator in both synchronous and asynchronous mediums? If so, here’s the additional experience we’re looking for:\u003c/p\u003e\n\u003cp\u003eExperience building and debugging distributed systems.\u003c/p\u003e\n\u003cp\u003eProficiency in one or more of Go, C++, C, or Python.\u003c/p\u003e\n\u003cp\u003eAn understanding of how to build observability into systems to ensure issues can easily be identified and fixed.\u003c/p\u003e\n\u003cp\u003eA focus on delivering high-quality code through strong testing practices.\u003c/p\u003e\n\u003cp\u003eWe know there’s no such thing as an “ideal” candidate - we’re all a work in progress and are growing new skills and capabilities all the time. CircleCI welcomes those who are enthusiastic about learning and evolving, so however you identify and whatever your background, if this looks like a role where you could do work that excites you, we hope you’ll apply.\u003c/p\u003e\n\u003cp\u003eWorking remotely at CircleCI\nWe’re a distributed company with teammates across the world. We can support you working remotely anywhere in North America.\u003c/p\u003e\n\u003cp\u003eAbout CircleCI\u003c/p\u003e\n\u003cp\u003eWe are a globally distributed team working towards the common goal of being the standard bearer for continuous integration and deployment software. We are looking for people who are interested in helping us shape software engineering best practices for the industry as a whole.\u003c/p\u003e\n\u003cp\u003eCircleCI is the best platform for software teams looking to rapidly build quality projects, at scale. Our intelligent continuous integration and delivery tools are simple yet powerful. Our aim is to provide the wisdom of a connected development ecosystem to every team member making technology decisions.\u003c/p\u003e\n\u003cp\u003eWe run 12M+ builds a month on our platform for companies like Spotify, Kickstarter, Sony, and Coinbase. Over 25,000 organizations and 300,000 developers actively build, test, and deploy on CircleCI. We’ve raised $59.5M in venture capital from Industry Ventures, Top Tier Capital, Scale Venture Partners, DFJ, Harrison Metal Capital, and Baseline Ventures.\u003c/p\u003e\n\u003cp\u003eCircleCI is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://boards.greenhouse.io/circleci/jobs/4254505002\"\u003ehttps://boards.greenhouse.io/circleci/jobs/4254505002\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ2xsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--adaef002d04a064935828f9efa28e26c054a06b9/circle-logo-badge-black%20(1).png"},{"id":"f2ffbf15-0b47-4991-b68d-49593bc2bd14","type":"Full Time","url":"https://jobs.github.com/positions/f2ffbf15-0b47-4991-b68d-49593bc2bd14","created_at":"Tue Apr 16 20:39:33 UTC 2019","company":"Fred Hutchinson Cancer Research Center","company_url":"https://careers-fhcrc.icims.com/jobs/13286/software-development-engineer-i/job?hub=7","location":"Seattle, WA","title":" Software Development Engineer I","description":"\u003cp\u003eCures Start Here. At Fred Hutchinson Cancer Research Center, home to three Nobel laureates, interdisciplinary teams of world-renowned scientists seek new and innovative ways to prevent, diagnose and treat cancer, HIV/AIDS and other life-threatening diseases. Fred Hutch’s pioneering work in bone marrow transplantation led to the development of immunotherapy, which harnesses the power of the immune system to treat cancer. An independent, nonprofit research institute based in Seattle, Fred Hutch houses the nation’s first cancer prevention research program, as well as the clinical coordinating center of the Women’s Health Initiative and the international headquarters of the HIV Vaccine Trials Network. Careers Start Here.\u003c/p\u003e\n\u003cp\u003eBiostatistics, Bioinformatics and Epidemiology (BBE) at Fred Hutch is seeking a full-stack developer in the Gottardo Lab at the Fred Hutch  to work on a cloud-enabled biomarker discovery and data exploration platform for immunological assay data applied to cancer immunotherapy and vaccine clinical trials. For more information about the lab, please see our web site at rglab.org.\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cp\u003eIn collaboration with groups at the Fred Hutch we are building a biomarker discovery and screening tool to enable high throughput processing of large amounts of cytometry and immunological assay data collected through trials run by the Cancer Immunotherapy Trials Network, HIV Vaccine Trials Network, and others at the Fred Hutch.\u003c/p\u003e\n\u003cp\u003eThe envisioned platform will be used to standardize, integrate and rapidly analyze data sets across studies. The platform will serve to streamline analysis and as a backbone on which to build novel computational algorithms, disseminate data for data sharing, visualization \u0026amp; exploration, with downstream analyses focusing on identification of potential correlates of outcome \u0026amp; biomarkers that could be leveraged to inform follow-up studies, stratify patients for therapy, or inform new vaccine designs.\u003c/p\u003e\n\u003cp\u003eQualifications\u003c/p\u003e\n\u003cp\u003eThe ideal candidate for the full-stack developer position would have expertise in web development, polyglot persistence, cloud infrastructure, and software engineering best practices. Experience working with systems integration is a plus.\u003c/p\u003e\n\u003cp\u003eCandidates should be fluent in Python and HTML5 and JavaScript, with experience in R or C++ preferred. Experience in languages such as Ruby, or Perl, or PHP are a plus. Candidates should also have excellent written and verbal communication skills. Interfacing with project collaborators in-person and online is a key aspect of the position.\u003c/p\u003e\n\u003cp\u003eTo apply for the position please include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eyour current resume\u003c/li\u003e\n\u003cli\u003ecode samples or links to published/distributed code you've written, and\u003c/li\u003e\n\u003cli\u003econtact information for two references\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur Commitment to Diversity\nWe are committed to cultivating a workplace in which diverse perspectives and experiences are welcomed and respected. We are proud to be an Equal Opportunity and VEVRAA Employer. We do not discriminate on the basis of race, color, religion, creed, ancestry, national origin, sex, age, disability, marital or veteran status, sexual orientation, gender identity, political ideology, or membership in any other legally protected class. We are an Affirmative Action employer. We encourage individuals with diverse backgrounds to apply and desire priority referrals of protected veterans. If due to a disability you need assistance/and or a reasonable accommodation during the application or recruiting process, please send a request to our Employee Services Center at \u003ca href=\"mailto:escmail@fredhutch.org\"\u003eescmail@fredhutch.org\u003c/a\u003e or by calling 206-667-4700.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply on our careers page: \u003ca href=\"https://careers-fhcrc.icims.com/jobs/13286/software-development-engineer-i/job?hub=7\"\u003ehttps://careers-fhcrc.icims.com/jobs/13286/software-development-engineer-i/job?hub=7\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ2RsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--104c1dc5f3380e58f9a498c4d2976a5f26452125/FH.png"},{"id":"0d5a8dc8-5308-49cf-acf6-9de649c92bc7","type":"Full Time","url":"https://jobs.github.com/positions/0d5a8dc8-5308-49cf-acf6-9de649c92bc7","created_at":"Tue Apr 16 20:26:54 UTC 2019","company":"CircleCI","company_url":"http://www.circleci.com","location":"Remote - North America ","title":"Site Reliability Engineers","description":"\u003cp\u003eCircleCI seeks Site Reliability Engineers who are excited about building a product that empowers thousands of developers to do better work every single day.\u003c/p\u003e\n\u003cp\u003eYou'll work closely with our distributed, cross-functional engineering teams to deliver and manage the scalable, high-performance infrastructure of our Cloud and On-Premises offerings. You'll also build automation tools and help our software engineers design services that are optimized for scale.\u003c/p\u003e\n\u003cp\u003eYou will have direct impact in the following ways:\u003c/p\u003e\n\u003cp\u003eImproving the availability, scalability, latency, and efficiency of CircleCI’s services.\u003c/p\u003e\n\u003cp\u003eEngage in service capacity planning and demand forecasting, anticipating performance bottlenecks.\u003c/p\u003e\n\u003cp\u003ePartnering with other teams to diagnose and resolve production issues.\u003c/p\u003e\n\u003cp\u003eArchitect and implement shared infrastructure used by all services within the CircleCI platform, for both SaaS and on-prem configurations\u003c/p\u003e\n\u003cp\u003eSupporting and advising other teams to help them craft scalable services.\u003c/p\u003e\n\u003cp\u003eBuild and maintain tools for deployment, monitoring, and debugging\u003c/p\u003e\n\u003cp\u003ePlanning and executing disaster recovery drills.\u003c/p\u003e\n\u003cp\u003eParticipating in rotating on-call duties, including incident management, and helping us improve our processes\u003c/p\u003e\n\u003cp\u003eDo you love collaboration and teamwork? Are you eager to learn new things and help others learn, too? Are you a strong communicator in both synchronous and asynchronous mediums? If so, here’s the additional experience we’re looking for:\u003c/p\u003e\n\u003cp\u003eI6+ years of experience with distributed microservices environments.\u003c/p\u003e\n\u003cp\u003eExperience managing container-based architectures, including orchestration, service-discovery, monitoring, and debugging.\u003c/p\u003e\n\u003cp\u003eUnderstanding of standard networking protocols and components such as TCP/IP, HTTP, DNS, and the OSI Model.\u003c/p\u003e\n\u003cp\u003eIn-depth knowledge of operating system internals: processes, threads, IPC, concurrency, locks, mutexes, semaphores, etc.\u003c/p\u003e\n\u003cp\u003eProficiency in one or more of: Python, Go, Java, C, C++\u003c/p\u003e\n\u003cp\u003eComprehensive knowledge of Postgres, MongoDB, Redis.\u003c/p\u003e\n\u003cp\u003eSystematic problem-solving approach, coupled with a strong sense of ownership and drive\u003c/p\u003e\n\u003cp\u003eTrack-record of working cooperatively with software engineering teams\u003c/p\u003e\n\u003cp\u003eFocus on security in the delivery of all levels of a system\u003c/p\u003e\n\u003cp\u003ePassion for modern software development and operation, including agile, CI/CD, and infrastructure-as-code\u003c/p\u003e\n\u003cp\u003eWe know there’s no such thing as an “ideal” candidate - we’re all a work in progress and are growing new skills and capabilities all the time. CircleCI welcomes those who are enthusiastic about learning and evolving, so however you identify and whatever your background, if this looks like a role where you could do work that excites you, we hope you’ll apply.\u003c/p\u003e\n\u003cp\u003eAbout CircleCI\u003c/p\u003e\n\u003cp\u003eCircleCI is the best platform for software teams looking to rapidly build quality projects, at scale. Our intelligent continuous integration and delivery tools are simple yet powerful. Our aim is to provide the wisdom of a connected development ecosystem to every team member making technology decisions.\u003c/p\u003e\n\u003cp\u003eWe run 12M+ builds a month on our platform for companies like Spotify, Kickstarter, Sony, and Coinbase. Over 25,000 organizations and 300,000 developers actively build, test, and deploy on CircleCI.  We’ve raised $59.5M in venture capital from Industry Ventures, Top Tier Capital, Scale Venture Partners, DFJ, Harrison Metal Capital, and Baseline Ventures.\u003c/p\u003e\n\u003cp\u003eWe are a globally distributed team working towards the common goal of being the standard bearer for continuous integration and deployment software. We are looking for people who are interested in helping us shape software engineering best practices for the industry as a whole.\u003c/p\u003e\n\u003cp\u003eCircleCI is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://boards.greenhouse.io/circleci/jobs/4255227002\"\u003ehttps://boards.greenhouse.io/circleci/jobs/4255227002\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ1ZsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--71651471b2589099bce9ddfc2215adb96659cbb8/circle-logo-badge-black%20(1).png"},{"id":"5fe0200c-7d4a-41d1-9ca1-49a78cb9723f","type":"Full Time","url":"https://jobs.github.com/positions/5fe0200c-7d4a-41d1-9ca1-49a78cb9723f","created_at":"Wed Apr 10 08:38:41 UTC 2019","company":"Daimler AG","company_url":"https://www.daimler.com/career/","location":"Sindelfingen","title":"Software meets eDrive Electrifying Insights @Mercedes-Benz Cars ","description":"\u003ch2\u003eThe future of mobility is electric, digital and intelligent - characteristics that EQ stands for at Mercedes-Benz.\u003c/h2\u003e\n\u003cp\u003eEQ's portfolio includes all future battery-powered automobiles as well as the associated products and services from Mercedes-Benz. In the electrification of the powertrain, Mercedes-Benz is taking a holistic approach and developed the EQ brand with a vehicle family and an ecosystem that includes a comprehensive range of electric mobility products in addition to the vehicle itself.\nThe EQ team invites you to Sindelfingen on May 11, 2019 and looks forward to taking a look into the future of Mercedes-Benz Cars together with you!\u003c/p\u003e\n\u003ch2\u003eWhat awaits you?\u003c/h2\u003e\n\u003cp\u003eOur EQ experts are looking forward to getting to know you at our event \"Software meets eDrive\" on May 11, 2019 in Sindelfingen. We want to discuss the electrifying future of Mercedes-Benz Cars with you and give you insights into our ideas and projects. In addition to pitches on current top topics, information stands and discussion forums, you will have the opportunity to talk to our experts from Research \u0026amp; Development in private to exchange ideas, challenges and fields of application in Stuttgart and Berlin.\u003c/p\u003e\n\u003ch2\u003eInterested?\u003c/h2\u003e\n\u003cp\u003eOur experts will be on site in Sindelfingen on May 11, 2019 and look forward to discussing the following topics with you:\u003c/p\u003e\n\u003ch3\u003e▸ Software development eDrive\u003c/h3\u003e\n\u003ch3\u003e▸ Battery and cell development\u003c/h3\u003e\n\u003ch2\u003eGood to know\u003c/h2\u003e\n\u003cp\u003eIf your application is successful, we will invite you before May 4. We will cover the cost of travel to and from the event.\nIf you are unable to attend on the day of the event, we will be happy to contact you by Skype or telephone.\u003c/p\u003e\n\u003ch3\u003eWe look forward to hearing from you!\u003c/h3\u003e\n","how_to_apply":"\u003cp\u003eTake a look into the future of Mercedes-Benz Cars together with us and apply \u003ca href=\"https://www.daimler.com/career/about-us/events-workshops/detail-events-daimlerevents/event-detailpages/2019/software-meets-edrive.html\"\u003ehere!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbDlrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--580efc94d05c68e25602f9326140e83462364aae/daimler.png"},{"id":"eb302bf8-9a5c-4f72-a1c5-3240fa1a1d13","type":"Full Time","url":"https://jobs.github.com/positions/eb302bf8-9a5c-4f72-a1c5-3240fa1a1d13","created_at":"Wed Mar 13 20:02:59 UTC 2019","company":"King","company_url":"http://www.king.com","location":"Barcelona","title":"Senior Graphics Developer","description":"\u003cp\u003eWe are looking for a senior graphics developer to welcome in our central team in either London or Barcelona to help us push the graphical quality of our mobile games. Are you someone with experience of delivering scalable systems and do you like to work closely with amazingly skillful Artists to deliver beautiful results that push the boundaries of what people consider possible on mobile? If so, we’d really like to hear from you.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour Role within our Kingdom\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs part of the Central Art group:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou'll work alongside hardworking and passionate Artists and Technical Artists on key technologies to deliver cutting edge visuals that will be used across a variety of titles at King.\u003c/li\u003e\n\u003cli\u003eYou will also work with key developers across King to share knowledge and top practices helping to ensure when a game is released, the visuals standout.\u003c/li\u003e\n\u003cli\u003eYou will work in a highly visible role with the chance to make significant impact on the mobile games market.\u003c/li\u003e\n\u003cli\u003eYou will be at the cutting edge of helping define and research the best techniques that allow the best use of the mobile GPU hardware.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSkills to Create Skills\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are a forward-thinker with a desire to help define the top practices on the rapidly evolving mobile GPU ecosystem.\u003c/li\u003e\n\u003cli\u003eYou are curious and have the ability to learn quickly, and you love working closely with others to tear down the boundaries.\u003c/li\u003e\n\u003cli\u003eYou are fascinated by GPU architecture and appreciate the growing opportunity this rapidly evolving landscape presents.\u003c/li\u003e\n\u003cli\u003eYou possess excellent C++ knowledge\u003c/li\u003e\n\u003cli\u003eYou have professional experience of game development\u003c/li\u003e\n\u003cli\u003eYou hold experience in delivering scalable graphic solutions\u003c/li\u003e\n\u003cli\u003eYou show a real passion for game development\u003c/li\u003e\n\u003cli\u003eYou demonstrate high sense of quality and passion for all things graphical\u003c/li\u003e\n\u003cli\u003eYou're a good communicator, with artist and programmers alike\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus Points\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have mobile GPU architecture knowledge\u003c/li\u003e\n\u003cli\u003eYou have experience in generating procedural systems\u003c/li\u003e\n\u003cli\u003eYou are experienced in working with Unity\u003c/li\u003e\n\u003cli\u003eYou know a little about Android/OSX\u003c/li\u003e\n\u003cli\u003eYou have tile-based GPU rendering knowledge\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eA Great Saga Needs All Sorts of Heroes\u003c/p\u003e\n\u003cp\u003eMaking games is fun! Especially when you do it with people who share the same idea of what makes a good workplace, great. We design games for everyone, no matter where they are or who they are, and we employ all sorts of people from all kinds of backgrounds to bring them to life. Truth is, we simply can’t expect diversity in our players and originality in our games without first nurturing it in our people. A great saga needs all sorts of heroes. And that’s it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLife at King\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOfficially, we are a leading interactive entertainment company for the mobile world. Unofficially, we’re a serious business that takes pride in having fun. Every single day at King, we mix intuition with logic, art with science and magic with mathematics to craft the games the world loves to play. Together with our parent company, Activision Blizzard, our mission is to bring moments of magic to everyday life. Do you think this is something you can help us achieve? Then we’d love to talk.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eComprehensive relocation package\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePeople come from all over the world to work with us, and we want every single one of them to feel at home. To do so, you will receive as much help as we can give you with our relocation package. You can enjoy full visa sponsorship for you and any family member moving with you; you can see covered the cost your journey out here, of shipping your gadgets; and you can receive further help with estate agents.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply now!\n\u003ca href=\"https://king.com/hr/jobs/senior-graphics-developer-864?breadcrumbs=/hr/jobs\u0026amp;location=barcelona\"\u003ehttps://king.com/hr/jobs/senior-graphics-developer-864?breadcrumbs=/hr/jobs\u0026amp;location=barcelona\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUpoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bd00fe9aaa49e9fddb8e145c2f40d8b86aca63d2/Kingdotcom.png"},{"id":"a6f02bad-77e4-48b3-b516-91c5a3d9d33c","type":"Full Time","url":"https://jobs.github.com/positions/a6f02bad-77e4-48b3-b516-91c5a3d9d33c","created_at":"Wed Mar 13 20:03:01 UTC 2019","company":"King","company_url":"http://www.king.com","location":"Barcelona","title":"Java Backend Developer","description":"\u003cp\u003eKing operates mobile games at a massive scale. With titles like Candy Crush, Bubble Witch and Farm Heroes our code runs on hundreds of millions of devices across the world.\u003c/p\u003e\n\u003cp\u003eWe are looking for Java Backend Developers that will take pride in creating the very best bite sized entertainment for millions of players worldwide.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour role within our Kingdom\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe engineering team in Barcelona is responsible for building complex, high-scale, real-time systems, working closely with other parts of the business to support the marketing activities for our popular games. We need a mid-level developer with some practical experience, and the drive and enthusiasm to succeed in a demanding and professional team environment.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou will design, architect, test and implement features in our core services\u003c/li\u003e\n\u003cli\u003eYou will build valuable tools to support the game development process\u003c/li\u003e\n\u003cli\u003eYou will deliver high quality and well-structured code\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSkills to create thrills\u003c/p\u003e\n\u003cp\u003eYou have phenomenal passion for programming and a validated sense of quality and polish. As a developer you are also analytical and genuinely interested in understanding the whole tech stack. You have excellent interpersonal and communication skills and be a strong team player, able to work in a fast paced, demanding yet fun professional environment.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are experienced in Java, databases and web development in general.\u003c/li\u003e\n\u003cli\u003eYou are familiar with HTML, CSS, Javascript, Bash.\u003c/li\u003e\n\u003cli\u003eNo stranger to web protocols, application servers and web servers.\u003c/li\u003e\n\u003cli\u003eYou are used to TDD, UNIX environments.\u003c/li\u003e\n\u003cli\u003eYou have strong Computer Science fundamentals, design patterns and Object Oriented knowledge\u003c/li\u003e\n\u003cli\u003eYou are a team player who likes to discuss solutions and ideas.\u003c/li\u003e\n\u003cli\u003eStriving to be a genius in your area of expertise.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eA great saga needs all sorts of heroes\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMaking games is fun. Especially when you do it with people who share the same idea of what makes a good workplace, great. We design games for everyone, no matter where they are or who they are, and we employ all sorts of people from all kinds of backgrounds to bring them to life. Truth is, we simply can’t expect diversity in our players and originality in our games without first nurturing it in our people. A great saga needs all sorts of heroes. And that’s it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe’re Seriously Playful\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOfficially, we’re a leading interactive entertainment company for the mobile world. Unofficially, we’re a serious business that’s not afraid to have fun. Every day at King, we mix intuition with logic, art with science and magic with mathematics to create the games the world loves to play. Together with our parent company Activision Blizzard, our mission is to bring moments of magic to everyday life. If you think this is something you can help us achieve, let’s talk.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply now!\n\u003ca href=\"https://king.com/hr/jobs/java-backend-developer-2023?breadcrumbs=/hr/jobs\u0026amp;location=barcelona\"\u003ehttps://king.com/hr/jobs/java-backend-developer-2023?breadcrumbs=/hr/jobs\u0026amp;location=barcelona\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaU5oIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c2fe5f29d3c84ef98291e64d770e7c28f4f3a382/Kingdotcom.png"},{"id":"40af41fb-d70c-49e3-9264-14a064812830","type":"Full Time","url":"https://jobs.github.com/positions/40af41fb-d70c-49e3-9264-14a064812830","created_at":"Wed Mar 13 20:03:04 UTC 2019","company":"King","company_url":"http://www.king.com","location":"Berlin","title":"Senior C++ Developer – Candy Crush Franchise","description":"\u003cp\u003eWe are looking for a talented C++ Developer to join one of the world's biggest live game franchises - Candy Crush!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour role within our Kingdom\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIf you want to create amazing user experiences and entertainment for millions of players to enjoy on the go then this is the right job for you. Together with your colleagues, you will take create and maintain one of our biggest live titles. You will specify, design, build and implement existing and new game features. As part of the development team you will enjoy a creative, challenging and collaborative environment where your ideas will be every bit as valued as your programming expertise.\u003c/p\u003e\n\u003cp\u003eYour responsibilities will include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, architect, test and implement game features\u003c/li\u003e\n\u003cli\u003eTake an active part in game creation\u003c/li\u003e\n\u003cli\u003eMaintain and optimize new and existing game features\u003c/li\u003e\n\u003cli\u003eDeliver high quality and well-structured code\u003c/li\u003e\n\u003cli\u003eShare knowledge and help colleagues\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSkills to create thrills\u003c/p\u003e\n\u003cp\u003eYou have great passion for programming and are committed to quality and polish. You are genuinely excited about making games - whether you have done so professionally already or are looking to join the industry! As a developer you are also analytical and naturally curious about understanding the entire tech stack. And, of course, you’ll need to know what makes a good game. Other skills include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProven experience within software development\u003c/li\u003e\n\u003cli\u003eYou enjoy working in C++\u003c/li\u003e\n\u003cli\u003eExcellent teamwork skills, flexibility, and ability to handle multiple tasks\u003c/li\u003e\n\u003cli\u003ePassion for software development and OO Design\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus points\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWorking with content pipelines\u003c/li\u003e\n\u003cli\u003ePrevious experience in game development\u003c/li\u003e\n\u003cli\u003eExperience in working with memory / performance critical applications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eA great saga needs all sorts of heroes\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMaking games is fun. Especially when you do it with people who share the same idea of what makes a good workplace, great. We design games for everyone, no matter where they are or who they are, and we employ all sorts of people from all kinds of backgrounds to bring them to life. Truth is, we simply can’t expect diversity in our players and originality in our games without first nurturing it in our people. A great saga needs all sorts of heroes. And that’s it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eKing in Berlin\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSituated in the central borough of Berlin Mitte, ours is a backdrop that’s brimming with history. Culture vultures will find famous sites including Brandenburger Tor and Unter den Linden close by, along with the infamous suburb of Kreuzberg with its vintage markets and vibrant nightlife. A must-see in this melting pot of a city.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply now!\n\u003ca href=\"https://king.com/hr/jobs/c-developer-mf-candy-crush-franchise-1980?breadcrumbs=/hr/jobs\u0026amp;location=berlin\"\u003ehttps://king.com/hr/jobs/c-developer-mf-candy-crush-franchise-1980?breadcrumbs=/hr/jobs\u0026amp;location=berlin\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVJoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--13df58d49c23a01858bd93b275cef770535d4f2c/Kingdotcom.png"},{"id":"21fdaa3a-4cb2-4be9-aa03-c7cd8bbd3131","type":"Full Time","url":"https://jobs.github.com/positions/21fdaa3a-4cb2-4be9-aa03-c7cd8bbd3131","created_at":"Wed Mar 13 20:03:07 UTC 2019","company":"King","company_url":"http://www.king.com","location":"Stockholm","title":"Senior C++ Developer – Candy Crush Franchise","description":"\u003cp\u003eWe are looking for a super-talented Senior C++ Game Developer to bring our current and future games on mobile platforms to new exciting heights.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour role within our Kingdom\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIf you want to create amazing user experiences and entertainment for millions of players to enjoy on the go then this is the right job for you. Together with your colleagues you will take a lead on creating and maintaining our mobile casual games. You will specify, design, build and implement existing and new game features. As part of the development team you will enjoy a creative, challenging and collaborative environment where your ideas will be every bit as valued as your programming expertise.\u003c/p\u003e\n\u003cp\u003eSome bite sized bullet points of the job description are:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, architect, test and implement game features\u003c/li\u003e\n\u003cli\u003eTake an active part in game creation\u003c/li\u003e\n\u003cli\u003eMaintain and optimize new and existing game features\u003c/li\u003e\n\u003cli\u003eDeliver high quality and well-structured code\u003c/li\u003e\n\u003cli\u003eShare knowledge and help colleagues\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSkills to create thrills\u003c/p\u003e\n\u003cp\u003eYou are a programmer and a creative genius, and likely began programming fairly early in life. You love new programming challenges, and strive to deliver great products and technology. You are a curious and a fast-learner, and to nurture this we offer you an entrepreneurial environment, a small team and a big challenge.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExcellent C++ knowledge\u003c/li\u003e\n\u003cli\u003eProfessional experience from game development\u003c/li\u003e\n\u003cli\u003eProfessional experience from Android or iOS development\u003c/li\u003e\n\u003cli\u003eExperience with real time rendering (OpenGL preferred)\u003c/li\u003e\n\u003cli\u003ePassion for game Development\u003c/li\u003e\n\u003cli\u003eHigh sense of quality and polish\u003c/li\u003e\n\u003cli\u003eCapable of taking a technical responsibility for a product or project\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus points\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWorking with content pipelines\u003c/li\u003e\n\u003cli\u003eExperience in working with memory / performance critical applications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eA great saga needs all sorts of heroes\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMaking games is fun. Especially when you do it with people who share the same idea of what makes a good workplace, great. We design games for everyone, no matter where they are or who they are, and we employ all sorts of people from all kinds of backgrounds to bring them to life. Truth is, we simply can’t expect diversity in our players and originality in our games without first nurturing it in our people. A great saga needs all sorts of heroes. And that’s it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe’re Seriously Playful\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOfficially, we’re a leading interactive entertainment company for the mobile world. Unofficially, we’re a serious business that’s not afraid to have fun. Every day at King, we mix intuition with logic, art with science and magic with mathematics to create the games the world loves to play. Together with our parent company Activision Blizzard, our mission is to bring moments of magic to everyday life. If you think this is something you can help us achieve, let’s talk.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply now!\n\u003ca href=\"https://king.com/hr/jobs/senior-c-developer-candy-crush-franchise-1066?breadcrumbs=/hr/jobs\u0026amp;location=stockholm\"\u003ehttps://king.com/hr/jobs/senior-c-developer-candy-crush-franchise-1066?breadcrumbs=/hr/jobs\u0026amp;location=stockholm\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVZoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6e7bedf10a05a74d31fbbcbefe0e0576be984b47/Kingdotcom.png"},{"id":"4def67e3-6a1b-43d2-ad10-c7d5b55a721e","type":"Full Time","url":"https://jobs.github.com/positions/4def67e3-6a1b-43d2-ad10-c7d5b55a721e","created_at":"Wed Mar 13 20:03:10 UTC 2019","company":"King","company_url":"http://www.king.com","location":"Stockholm","title":"Developer Relations Engineer – Game Engine","description":"\u003cp\u003eWe are looking for a passionate developer to join our team in Stockholm. You will be a part of our game engine Developer Relation team with the mission to help game teams work efficiently with the engine. You will be working in a dynamic environment with active problem solving through collaboration with various teams.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour role within our Kingdom\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs part of the developer relations team, you will be a critical part of educating our game teams about our internal C++ engine. You will provide hands-on support to get the best out of the game engine in a new game production, whether it’s troubleshooting, profiling or education on existing features. In order to do this, a big part of your time will be spent creating tech demos, documentation, tutorials and extensions that help our users get started and learn all our best practices.\u003c/p\u003e\n\u003cp\u003eThis help can be provided through remote support, production of training material or on-site.\u003c/p\u003e\n\u003cp\u003eYou will among other things:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe available to provide support for game teams, both in person and remotely. Teams are located at all our engineering offices.\u003c/li\u003e\n\u003cli\u003eHelp game teams to keep up to date with the latest engine features\u003c/li\u003e\n\u003cli\u003eProvide engine team \"from the field\" feedback and feature recommendations\u003c/li\u003e\n\u003cli\u003eCreate training/documentation material around game engine and tools.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSkills to create thrills\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCollaborative person that communicates well with internal customers\u003c/li\u003e\n\u003cli\u003eExcellent programming skills in C++\u003c/li\u003e\n\u003cli\u003ePassionate about supporting game teams\u003c/li\u003e\n\u003cli\u003eExperience working in game development with commercial engines\u003c/li\u003e\n\u003cli\u003eExperience creating and maintaining technical documentation\u003c/li\u003e\n\u003cli\u003eAvailable to travel when necessary\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus points\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience in a similar advocate/developer relation/support role\u003c/li\u003e\n\u003cli\u003eExperience working with game engines\u003c/li\u003e\n\u003cli\u003eKnowledge of Java or Objective C\u003c/li\u003e\n\u003cli\u003eExperience working with Python and Bash scripting\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eA great saga needs all sorts of heroes\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMaking games is fun! Especially when you do it with people who share the same idea of what makes a good workplace, great. We design games for everyone, no matter where they are or who they are, and we employ all sorts of people from all kinds of backgrounds to bring them to life. Truth is, we simply can’t expect diversity in our players and originality in our games without first nurturing it in our people. A great saga needs all sorts of heroes. And that’s it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe’re Seriously Playful\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOfficially, we’re a leading interactive entertainment company for the mobile world. Unofficially, we’re a serious business that’s not afraid to have fun. Every day at King, we mix intuition with logic, art with science and magic with mathematics to create the games the world loves to play. Together with our parent company Activision Blizzard, our mission is to bring moments of magic to everyday life. If you think this is something you can help us achieve, let’s talk.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply now!\n\u003ca href=\"https://king.com/hr/jobs/developer-relations-engineer-game-engine-2067?breadcrumbs=/hr/jobs\u0026amp;location=stockholm\"\u003ehttps://king.com/hr/jobs/developer-relations-engineer-game-engine-2067?breadcrumbs=/hr/jobs\u0026amp;location=stockholm\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVpoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9ec7b165e4dc9927379439500be08291d8820707/Kingdotcom.png"},{"id":"d230c121-5262-4e8f-a359-6fcdd04a11d1","type":"Full Time","url":"https://jobs.github.com/positions/d230c121-5262-4e8f-a359-6fcdd04a11d1","created_at":"Wed Mar 13 20:03:14 UTC 2019","company":"King","company_url":"http://www.king.com","location":"Stockholm","title":"C++ Developer, King Tech","description":"\u003cp\u003eDoes C++, gaming and building software for other developers sound sweeter than a bag of candy?\u003c/p\u003e\n\u003cp\u003eWould you like to continue your saga in a core technology team which develops the SDK that powers all of the King games, running on 260 million devices?\u003c/p\u003e\n\u003cp\u003eThe purpose: Developing our Unified Platform to help the King organization build games in a super-easy way on a global level!\u003c/p\u003e\n\u003cp\u003eReady to level up?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour role within our Kingdom\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYour new team consists of 30 amazing Kingsters, including developers, tech writers, build engineers, POs \u0026amp; QA's, and by joining this fab team will enable you to make such a great contribution on the game developers ´user experience.\u003c/p\u003e\n\u003cp\u003eBeing part of a fluid, techy and inclusive environment means that together we celebrate releases, arrange knowledge sharing sessions (Fika \u0026amp; Learn!) and play games (of course). Oh, and since SDK is the ruling champions of the internal \"Robot building challenge\" you´ll need to be a solid Lego-builder. No pressure.\u003c/p\u003e\n\u003cp\u003eSkills to create thrills\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFluent in modern C++ (C++ 11 and later)\u003c/li\u003e\n\u003cli\u003ePlatform development, API design or Software DevKits and tools development\u003c/li\u003e\n\u003cli\u003eCross-platform development (especially iOS and Android)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus points\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGIT\u003c/li\u003e\n\u003cli\u003eCMake\u003c/li\u003e\n\u003cli\u003eExperience of setting up test automation\u003c/li\u003e\n\u003cli\u003eUnity game engine experience\u003c/li\u003e\n\u003cli\u003eWe know that you are in to games on some level (casual, console, board-games, Uno etc.) and if you also have experience working in the online gaming industry, we´d sure like to hear your story!\nA great saga needs all sorts of heroes\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMaking games is fun! Especially when you do it with people who share the same idea of what makes a good workplace, great. We design games for everyone, no matter where they are or who they are, and we employ all sorts of people from all kinds of backgrounds to bring them to life. Truth is, we simply can’t expect diversity in our players and originality in our games without first nurturing it in our people. A great saga needs all sorts of heroes. And that’s it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe’re Seriously Playful\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe believe that great gaming experiences happen when they are developed by working in small, autonomous creative teams that control the whole process - from idea to amazing products. Our close connection with the player community gets us instant feedback and enables us to deliver truly magical moments. We value your free time and your need to refuel, relax and find inspiration - by playing games with your colleagues, being at home with your family or going to the gym or out for a run. That's how we stay creative!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eReady to level up? Join our Kingdom!\n\u003ca href=\"https://king.com/hr/jobs/c-developer-king-tech-1778?breadcrumbs=/hr/jobs\u0026amp;location=stockholm\"\u003ehttps://king.com/hr/jobs/c-developer-king-tech-1778?breadcrumbs=/hr/jobs\u0026amp;location=stockholm\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaWRoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--60b93fbdfaefa103c133026d0c07507614c1033f/Kingdotcom.png"},{"id":"07b8d85d-547b-49d5-a348-f90f37a3b9df","type":"Full Time","url":"https://jobs.github.com/positions/07b8d85d-547b-49d5-a348-f90f37a3b9df","created_at":"Wed Mar 13 20:03:17 UTC 2019","company":"King","company_url":"http://www.king.com","location":"Stockholm","title":"Java Backend Developer – Streaming Platform","description":"\u003cp\u003eDo you want to embark on an exciting journey, swimming in data lakes? Are you a Java-enthusiast passionate about streaming and the usage of data? As our new team player, you´ll support the company in taking real-time actions that optimize our 200+ games for 260 million players using cutting edge technologies.\u003c/p\u003e\n\u003cp\u003eHere, you get the chance to tackle very big and fast data - over 120 billion events received from the games every single day, processed in real-time!\u003c/p\u003e\n\u003cp\u003eSounds like a treat?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour role within our Kingdom\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou will work closely with fellow data engineers, business intelligence developers, data scientists, business performance managers/directors and game developers across all our game studios.\u003c/p\u003e\n\u003cp\u003eThe purpose? Ensuring that we stay ahead in the streaming-game, using the findings to create user-centric products, making our players happy!\u003c/p\u003e\n\u003cp\u003eSome of the fun stuff you´ll get to do:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop, maintain and operate our large scale real-time analytics platform\u003c/li\u003e\n\u003cli\u003eImprove and automate monitoring and operational processes for our systems\u003c/li\u003e\n\u003cli\u003eResearch and prototype new backend solutions for data processing, analytics and storage\u003c/li\u003e\n\u003cli\u003eTurn ad-hoc data science solutions into efficient, scalable models and applications\u003c/li\u003e\n\u003cli\u003eWork together with fellow engineers from different teams on joint projects in King analytical space\u003c/li\u003e\n\u003cli\u003ePromote team’s products to a broad audience of both technical and non-technical backgrounds and support/ educate users\nSkills to create thrills\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYou are curious individual who really enjoys solving problems and are a big fan of \"Great engineering\". Eagerness to learn and trying out new techy things is traits that you can relate to being \"you\".\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDeep understanding of Java and object oriented design patterns\u003c/li\u003e\n\u003cli\u003eExperience working in UNIX environments\u003c/li\u003e\n\u003cli\u003eExperience with stream processing technologies (we use: Kafka, Storm, Flink)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTasty bonus skills\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHadoop technologies: HDFS, Yarn, HiveStream processing technologies - Kafka, Storm, Flink)\u003c/li\u003e\n\u003cli\u003eWe know that you are in to games on some level (casual, console, board-games etc.) and if you also have experience working in the online gaming industry, we´re sure like to hear your story!\nA great saga needs all sorts of heroes\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMaking games is fun! Especially when you do it with people who share the same idea of what makes a good workplace, great. We design games for everyone, no matter where they are or who they are, and we employ all sorts of people from all kinds of backgrounds to bring them to life. Truth is, we simply can’t expect diversity in our players and originality in our games without first nurturing it in our people. A great saga needs all sorts of heroes. And that’s it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe’re Seriously Playful\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe believe that great gaming experiences happen when they are developed by working in small, autonomous creative teams that control the whole process - from idea to amazing products. Our close connection with the player community gets us instant feedback and enables us to deliver truly magical moments. We value your free time and your need to refuel, relax and find inspiration - by playing games with your colleagues, being at home with your family or going to the gym or out for a run. That's how we stay creative!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eReady to level up? Join our Kingdom!\n\u003ca href=\"https://king.com/hr/jobs/java-backend-developer-streaming-platform-1895?breadcrumbs=/hr/jobs\u0026amp;location=stockholm\"\u003ehttps://king.com/hr/jobs/java-backend-developer-streaming-platform-1895?breadcrumbs=/hr/jobs\u0026amp;location=stockholm\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaWhoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d8a7c0477ed33fb4cfccc5735978cd8935308772/Kingdotcom.png"},{"id":"f5eb646e-aca9-463f-ab69-338b0d45ac86","type":"Full Time","url":"https://jobs.github.com/positions/f5eb646e-aca9-463f-ab69-338b0d45ac86","created_at":"Wed Mar 13 20:04:11 UTC 2019","company":"King","company_url":"http://www.king.com","location":"London","title":"Data Scientist Technical Lead","description":"\u003cp\u003eWe are looking for a talented and creative Data Scientist Technical Lead who is interested in pushing the boundaries of online games analytics, with a proven ability to apply your skills, be it technical, behavioural or economic, practically in order to generate business value.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour role within our Kingdom\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe London Business Performance Unit is part of King London Studio, home to our live games - Farm Heroes Saga and Farm Heroes Super Saga as well as our new games in production, supporting King’s network of hundreds of millions of players. We are focused on building games that our players love. Reporting to the Business Performance Director of the London Business Performance Unit, you will lead a team of 4-6 Data Scientists of various tenure and Data Science Team Leads. You will be part of a community of 80+ business intelligence \u0026amp; analytics experts across King.\u003c/p\u003e\n\u003cp\u003eWhat you’ll do:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAnalyse our games per business needs\u003c/li\u003e\n\u003cli\u003eContinuously develop your team’s skillset through the Data Science Team Lead, trainings, coaching, peer reviews and other means as you see fit\u003c/li\u003e\n\u003cli\u003eProactively develop and define new analyses, experiments, data-driven tools, methodologies and best practices to advance data science methods within the team in order to better understand our players’ behaviour and the performance of our games\u003c/li\u003e\n\u003cli\u003eLead recruitment and onboarding of Data Scientists\u003c/li\u003e\n\u003cli\u003eIdentify and oversee or handle data and technical issues and projects\u003c/li\u003e\n\u003cli\u003eKeeping up to date with industry and DS best practices, methodologies and evangelising with the team as relevant\u003c/li\u003e\n\u003cli\u003eIdentify analysis that should be prioritised and work with stakeholders to prioritise it\u003c/li\u003e\n\u003cli\u003eBe part of King DS leadership forum, evangelise the team and connect the team to the wider DS community in King\u003c/li\u003e\n\u003cli\u003eDefine the tech strategy including automation, tools preference, coding best practices, reusability and transferability\u003c/li\u003e\n\u003cli\u003eSupport other London BPU team members from technical and methodology perspective\nSkills to create thrills\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYou have a passion for quantitative analysis and will have the ability to draw business insights which will add real value to King. You will need to demonstrate the ability to learn quickly and will have worked in a fast paced and collaborative environment. This role will involve working with teams and individuals within the studio and across King - such as Game Developers, Designers and Business Performance Managers, so excellent communication skills are essential.\u003c/p\u003e\n\u003cp\u003eOur ideal candidate will have solid experience leading an analytical team in a commercial environment.\u003c/p\u003e\n\u003cp\u003eBusiness Insight: The ability to understand the problems and opportunities from a player and a business perspective, and then defining the right data, analysis or interpretation to lead to the right recommendations and decisions\u003c/p\u003e\n\u003cp\u003eLeadership: The ability to mentor, guide and inspire Data Scientists and drive best practices\u003c/p\u003e\n\u003cp\u003eSQL: The ability to write complex SQL queries to analyse our databases with 300+ million players, and work effectively with big data technologies, e.g. BigQuery, Hadoop etc..\u003c/p\u003e\n\u003cp\u003eAnalytical coding: Using tools such as R, Python (and also Excel) for analytical purposes\u003c/p\u003e\n\u003cp\u003eStats: Understanding the appropriate statistical or machine learning techniques to use in different circumstances.\u003c/p\u003e\n\u003cp\u003eCommunication: Designing good ways of communicating, visualising or reporting your results/analysis so they are clear and unambiguous\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBonus points\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSpecific experience that might be helpful, but is not required, includes: experience in the games industry or similarly sophisticated customer-facing digital businesses; experience in behavioural psychology/economics; robust understanding of more advanced statistical techniques suitable for analysis of highly skewed populations; experience in predictive analytics, segmentation, and related areas; experience in experimental design; software engineering skills in Java and other languages (beyond R and Python which we use most frequently); skills with standard reporting tools such as QlikView/Tableau/etc.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eA great saga needs all sorts of heroes\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMaking games is fun. Especially when you do it with people who share the same idea of what makes a good workplace, great. We design games for everyone, no matter where they are or who they are, and we employ all sorts of people from all kinds of backgrounds to bring them to life. Truth is, we simply can’t expect diversity in our players and originality in our games without first nurturing it in our people. A great saga needs all sorts of heroes. And that’s it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eKing in London\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBased in bustling Soho, the cultural heart of the West End, our London studio occupies all four floors of the landmark Ampersand building. Regent’s Park is close enough for a lunchtime run, as are the delights of Covent Garden and the shopping mecca Oxford Street. Non-Brits will soon discover it’s no urban myth; there really is a pub on every corner.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply now!\n\u003ca href=\"https://king.com/hr/jobs/data-scientist-technical-lead-1366\"\u003ehttps://king.com/hr/jobs/data-scientist-technical-lead-1366\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTVoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cc5e15f1c9bce68bc4ff296ba8bdbbb63d616b2c/Kingdotcom.png"},{"id":"fbf94214-50fe-4c04-bbc3-c47c71913191","type":"Full Time","url":"https://jobs.github.com/positions/fbf94214-50fe-4c04-bbc3-c47c71913191","created_at":"Wed Mar 13 20:04:18 UTC 2019","company":"King","company_url":"http://www.king.com","location":"London","title":"Senior Data Scientist","description":"\u003cp\u003eWe are looking for a talented and creative Data Scientist interested in pushing the boundaries of games analytics within the Farm Heroes Franchise located in our London Game studio. You’ll have a proven ability to apply your skills, be it technical, behavioural or economic, to generate value for the studio's new generation of awesome mobile games.\u003c/p\u003e\n\u003cp\u003eYou will be working with varied stakeholders in a fun, dynamic and fast-paced environment. You’ll help us to further understand, model, predict, segment and retain our players and be part of a community of 100+ business intelligence \u0026amp; analytics experts.\u003c/p\u003e\n\u003cp\u003eSpecifically, you’ll:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProactively develop new analyses, experiments and data-driven tools to better understand our players’ behaviour and the performance of our games\u003c/li\u003e\n\u003cli\u003eProvide insights to support decision making for the portfolio of games in the Studio\u003c/li\u003e\n\u003cli\u003eTranslate business needs to technical requirements and AB-tests, and work with development teams to ensure correct implementation, taking care to correctly track the right information to allow easy, precise analysis of the impact\u003c/li\u003e\n\u003cli\u003eWork closely with other Data Scientists across the business to leverage insights from one game across multiple games\u003c/li\u003e\n\u003cli\u003eCarefully check, debug, and problem solve issues to ensure you deliver accurate and clear analysis, reports and tools, even when confronted by subtle data complications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThere is plenty of scope at King for you to learn from your colleagues in the areas where you have less experience, and to share your own skills where you are stronger.\u003c/p\u003e\n\u003cp\u003eSpecific factors that are helpful to excel in this role include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBusiness Insight: The ability to understand the problems and issues our games and business wants to solve, and then defining the right data, analysis or interpretation to lead to the right recommendations and decisions\u003c/li\u003e\n\u003cli\u003eCommunication: Designing good ways of communicating, visualising or reporting your results/analysis so they are clear and unambiguous\u003c/li\u003e\n\u003cli\u003eSQL: The ability to write complex SQL queries to analyse our databases with 300+ million players and work with relational database systems.\u003c/li\u003e\n\u003cli\u003eAnalytical coding: Using tools such as R, Python or Excel for analytical purposes\u003c/li\u003e\n\u003cli\u003eStats: Understanding the basics of appropriate statistical or machine learning techniques.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOther experience that might be helpful, but is not required, includes:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork in the games industry or similarly customer-facing digital businesses\u003c/li\u003e\n\u003cli\u003eFamiliarity with massive data sets and tools to deal with them (BigQuery/AWS/Hadoop etc)\u003c/li\u003e\n\u003cli\u003eExperience in behavioural psychology/economics and experimental design\u003c/li\u003e\n\u003cli\u003eExperience in predictive analytics, segmentation, and related areas\u003c/li\u003e\n\u003cli\u003eSoftware engineering skills in Java and other languages (beyond R and Python which we use   most frequently)\u003c/li\u003e\n\u003cli\u003eSkills with standard reporting tools such as Looker/QlikView/Tableau/etc.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe're Knights of Creativity\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe believe that great gaming experiences happen when they are developed by working in small, autonomous creative teams that control the whole process - from idea to amazing game. Our close connection with the player community gets us instant feedback and enables us to deliver truly magical moments. We value your free time and your need to refuel, relax and find inspiration - by playing games with your colleagues, being at home with your family or going to the gym or out for a run. That's how we stay creative. That’s why we call ourselves developers of magic and knights of creativity!\nMaking games is fun. Especially when you do it with people that share the same idea of what makes a good workplace great. No matter where you’re from, it’s all about what we can achieve together when creating truly magical moments for all our players. That’s why we hire all sorts of talent - because a great saga needs all sorts of heroes.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eHow to apply?\n\u003ca href=\"https://king.com/hr/jobs/senior-data-scientist-2076\"\u003ehttps://king.com/hr/jobs/senior-data-scientist-2076\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBakJoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--61410c2a7e6b8a997423a068f576d26c4b8e3985/Kingdotcom.png"},{"id":"8f7f2eaa-5c7e-45e9-b8d4-4e327aae58f4","type":"Full Time","url":"https://jobs.github.com/positions/8f7f2eaa-5c7e-45e9-b8d4-4e327aae58f4","created_at":"Tue Apr 16 17:12:04 UTC 2019","company":"King","company_url":"http://www.king.com","location":"Barcelona","title":"Javascript Frontend Developer","description":"\u003cp\u003eIf you want to create amazing user experiences using the latest frontend technologies, then this is the right job for you. You will be part of a highly competent team of developers in the creation of large scale systems, not only delivering high quality and well-structured code but doing so with a user’s point of view.\u003c/p\u003e\n\u003cp\u003eWe know that the continued success of King depends on preserving the amazing culture we have, so ‘fit’ is extremely important. We work in small, collaborative Agile teams where everyone is involved in coming up with great features and ownership of the outcome is key.\nWe are problem solvers, constantly reviewing how and why we do things and learning from each other. We are experimental, trying out new tech and ideas and willing to take risks to drive the entire industry forward. We are sociable and fun, and we like to hang out together. We are passionate, some might even say quirky, and while we love what we do, our lives are about more than work.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSkills to Create Thrills\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a frontend developer looking for the next step in your career, you are:As a frontend developer looking for the next step in your career, you are:\n· Very experienced in HTML5, CSS3, Native Javascript, single page applications and web development in general.\n· Be up to date with new technologies and frameworks.\n· Used to ES6+.\n· Focused on usability, maintainability and quality, building for the long term.\n· Structured and analytical.\n· A comfortable people person, able to make non-technical users feel at ease\n· Able to see a user experience from the user's point of view, and craft UIs to make their lives easier.\n· Knowledgeable about web protocols, application servers and web servers.\n· Striving to be the best in your area of expertise, no compromises.\n· A curious and fast learner who keeps up to date with changing technologies\n· Motivated by challenges and new opportunities.\n· Strong knowledge in Unit Testing\n· A team player that likes to discuss solutions and ideas.\n· Fluent in English.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasty Bonus Skills\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a frontend developer you:\n· Have experience working with Javascript frameworks ( React, and / or Angular, Vue.js, etc.)\n· Have knowledge of ES7+ and TypeScript\n· Are used to CSS preprocessors (SASS, LESS, CSS modules)\n· Are experienced working with frontend build tools like Webpack, NPM scripts.\n· Like to play and enjoy any of our games.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eA Great Saga Needs All Sorts of Heroes\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMaking games is fun. Especially when you do it with people that share the same idea of what makes a good workplace great. No matter where you’re from, it’s all about what we can achieve together when creating truly magical moments for all our players. That’s why we hire all sorts of talent - because a great saga needs all sorts of heroes.\u003c/p\u003e\n\u003cp\u003eWe’re knights of creativity\u003c/p\u003e\n\u003cp\u003eWe believe that great games are developed by working in small, autonomous creative teams that control the whole process - from idea to amazing game. Our close connection with and instant feedback from the player community, enables us to deliver truly magical moments. We value your free time and your need to refuel, relax and find inspiration - by playing games with your colleagues, being at home with your family or going to the gym or out for a run. That's how we stay creative. That’s why we call ourselves developers of magic and knights of creativity.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://king.com/hr/jobs/javascript-frontend-developer-2026?breadcrumbs=/hr/jobs\u0026amp;location=barcelona\"\u003eApply here\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ05sIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2dad4d03688d8bc6db5f5f33d84ae422ad940d80/Kingdotcom.png"},{"id":"fa5eb25e-f0fe-4819-9c37-7242457fe292","type":"Full Time","url":"https://jobs.github.com/positions/fa5eb25e-f0fe-4819-9c37-7242457fe292","created_at":"Tue Apr 02 06:59:13 UTC 2019","company":"Daimler AG","company_url":"https://www.daimler.com/career/","location":"Stuttgart","title":"Next Big Thing - Recruiting Days Autonomous Driving and Artificial Intelligence","description":"\u003ch1\u003eTasks\u003c/h1\u003e\n\u003cp\u003eIs it your goal to create the Next Big Thing?\u003c/p\u003e\n\u003cp\u003eDo you immediately think of robotics, simulation platforms or software architecture? Or do you perhaps enjoy developing algorithms for autonomous systems, and programming with C/C++ and MATLAB/Simulink? Would you like to connect the vehicles of the future using cloud-based systems, and allow them to drive completely autonomously using machine learning?\u003c/p\u003e\n\u003cp\u003eThen you've come to the right place, because that is exactly what we are working on at Daimler in order to initiate a new era of mobility. Become part of this new mobility, and create your very own next big thing.\u003c/p\u003e\n\u003cp\u003eDo you have visions and ideas for how to revolutionize personal, goods or public transportation?\u003c/p\u003e\n\u003cp\u003eThen join us at the \"Next Big Thing Recruiting Days Autonomous Driving and Artificial Intelligence at Daimler\" on May 17 and 18 and find out what it means to work on the Next Big Thing at Mercedes-Benz Cars, Daimler Trucks and Daimler Buses.\u003c/p\u003e\n\u003ch3\u003eAn action-filled event awaits you:\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eIn battles and pitches, Mercedes-Benz Cars, Daimler Trucks and Daimler Buses will attempt to win you for themselves.\u003c/li\u003e\n\u003cli\u003eYou will have the opportunity to experience and discuss modern AI technology first-hand with our developers at driving events.\u003c/li\u003e\n\u003cli\u003eIn a relaxed atmosphere, you will have the opportunity to discuss the Next Big Thing in the fields of autonomous driving and AI with your new colleagues.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eSubmit your application by April 29, 2019!\u003c/h3\u003e\n\u003cp\u003eWe have a wide range of exciting topics. Nevertheless, we need to know from you which topic your heart is beating for. So we can even better share our enthusiasm with you.\u003c/p\u003e\n\u003cp\u003eSo please name 1-2 favourite subject areas in your application:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSoftware development in the area of sensor data processing and sensor fusion\u003c/li\u003e\n\u003cli\u003eSoftware development in the area of behavior generation/management, vehicle motion control and trajectory planning\u003c/li\u003e\n\u003cli\u003eArchitecture development for high-performance embedded systems\u003c/li\u003e\n\u003cli\u003eSoftware development in the area of environment perception and machine \u0026amp; deep learning\u003c/li\u003e\n\u003cli\u003eSoftware \u0026amp; architecture development in the field of cloud computing, AI, data science and DevOps\u003c/li\u003e\n\u003cli\u003eSoftware development in the area of simulation and validation processes\u003c/li\u003e\n\u003cli\u003eSoftware Development in the area of localization/positioning\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch1\u003eQualifications\u003c/h1\u003e\n\u003cul\u003e\n\u003cli\u003eYou have a degree in IT, electrical engineering, robotics, mechatronics, mathematics, physics or a comparable subject.\u003c/li\u003e\n\u003cli\u003eYou have well-developed skills with programming languages (e.g. C, C++, Python, Java) and development/simulation tools (e.g. Matlab, Simulink, DOORS, Linux).\u003c/li\u003e\n\u003cli\u003eYou ideally already have professional experience in the fields of automated driving, driver assistance systems or electronic vehicle systems.\u003c/li\u003e\n\u003cli\u003eWe also expect excellent communication skills and that you enjoy working in a team, as well as the ability to always keep the bigger picture in mind.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eCreate the next big thing and apply \u003ca href=\"https://jobs.daimler.com/job/227781/next-big-thing-recruiting-days-autonomous-driving-and-artificial-intelligence-at-daimler.html?lang=en\"\u003ehere!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBckpqIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1a7bec26f85737b9cbc997e119dd01e6d70edd70/Abschlussbild%201.jpg"},{"id":"303e8f42-b36b-44e9-b161-ae7cb48cec59","type":"Full Time","url":"https://jobs.github.com/positions/303e8f42-b36b-44e9-b161-ae7cb48cec59","created_at":"Fri Mar 15 14:56:17 UTC 2019","company":"Daimler Protics GmbH","company_url":"https://www.daimler-protics.com/","location":"Stuttgart","title":"Experte (m/w) für Testautomatisierung","description":"\u003cp\u003eUnser Team 'Application Engineering Automation \u0026amp; Analytics' fokussiert sich auf die Automatisierung von Prozessen, wobei wir die gesamte Bandbreite von Testing bis hin zur Datenverarbeitung abdecken. Wir sind ein internationales Team aus Softwareentwickler/Innen und integrieren stetig innovative Ansätze in unsere Projekte und Methoden. Dabei arbeiten wir flexibel und betreuen interne sowie externe Projekte in den Bereichen Testautomatisierung, Data Quality Monitoring, Prozessautomatisierung und Analytics. Unser Ziel ist hierbei die Reduzierung des manuellen Aufwands, kürzere Test- und Bearbeitungszeiten sowie eine Steigerung der Qualität und Effizienz.\u003c/p\u003e\n\u003cp\u003eZur Verstärkung unseres Teams suchen wir einen Experten in der technischen Beratung (m/w) für die Projektleitung verschiedener kundenspezifischer Testautomatisierungsprojekte sowie die Weiterentwicklung unserer Testautomatisierungsmethode.\u003c/p\u003e\n\u003ch1\u003eDas erwartet dich bei uns:\u003c/h1\u003e\n\u003cblockquote\u003e\n\u003cp\u003eErstellung von Test-Konzepten und -Strategien auf Basis der bestehenden Testautomatisierungsmethodik.\u003c/p\u003e\n\u003cp\u003eWeiterentwicklung der bestehenden Testautomatisierungs-Methode sowie unseres Testautomatisierungs-Frameworks basierend auf Java, Selenium, Appium.\u003c/p\u003e\n\u003cp\u003eEinbindung von neuen Technologien (KI, Cloud) sowie Trend-Scouting.\u003c/p\u003e\n\u003cp\u003eKoordination, Steuerung sowie Entwicklung bestehender kundenspezifischer Automatisierungsprojekte.\u003c/p\u003e\n\u003cp\u003eAkquise neuer Kundenprojekte sowie Übernahme der Projektverantwortung von der Angebotserstellung bis zum Projektabschluss.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003ch1\u003eDas erwarten wir von dir:\u003c/h1\u003e\n\u003cblockquote\u003e\n\u003cp\u003eAbgeschlossenes Studium der Informatik, Technischen Informatik, Wirtschaftsinformatik oder vergleichbare Ausbildung.\u003c/p\u003e\n\u003cp\u003eMehrjährige Berufserfahrung in der Software-Entwicklung.\u003c/p\u003e\n\u003cp\u003eErste Berufserfahrung in der fachlichen Führung von Software-Entwicklungsteams sowie im Projektmanagement.\u003c/p\u003e\n\u003cp\u003eIdealerweise Kenntnisse in der Android-/iOS-Entwicklung, der Testautomatisierung und der Java-Programmierung.\u003c/p\u003e\n\u003cp\u003eSelbständige und qualitätsbewusste Arbeitsweise, gutes analytisches Denkvermögen sowie die Fähigkeit zu konzeptionellem, ergebnis- und zielorientiertem Arbeiten.\u003c/p\u003e\n\u003cp\u003eSpaß an der Lösungsfindung von komplexen Problemen sowie Leidenschaft für neue Technologien.\u003c/p\u003e\n\u003cp\u003eStarke Kommunikations- und Präsentationsfähigkeiten sowie hohe Kundenorientierung.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eDas klingt nach dir? Dann kontaktiere uns noch heute und lass uns über die Stelle sprechen.\nWir freuen uns!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eInteressiert an unserem Job?\nDann bewerbe dich ganz einfach mit nur einem \u003ca href=\"https://www.linkedin.com/jobs/cap/view/1172799180/?pathWildcard=1172799180\u0026amp;trk=job_capjs\"\u003eKlick\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdHRoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9681109067e18c430a29a4f3e435c518bc9705dd/header_protics.png"},{"id":"8ce9aac3-4627-46b4-95d9-ccef5f5284a0","type":"Full Time","url":"https://jobs.github.com/positions/8ce9aac3-4627-46b4-95d9-ccef5f5284a0","created_at":"Tue Apr 16 15:25:14 UTC 2019","company":"Cluno GmbH","company_url":"http://www.cluno.com","location":"München","title":"Quality Assurance Engineer Mobile Apps (m/f/d)","description":"\u003ch2\u003eOur vision is DRIVING - AS SIMPLE AS LISTENING TO MUSIC.\u003c/h2\u003e\n\u003cp\u003eCluno is a new, flexible mobility concept: a digital car subscription. Car subscription works for anyone who wants to get around in his or her own car. We think all car-related processes completely digital and innovative. By this we help our customers finding the right mobility solution for their current life and needs and thus become their permanent partner. We work every day to make driving and changing cars as easy and convenient as possible. In order to meet this challenge, we are constantly looking for new talents who accompany us on our journey and strengthen our team.\u003c/p\u003e\n\u003cp\u003eTo strengthen our growing QA team, we are looking for you at our Munich location as a\u003c/p\u003e\n\u003ch2\u003eQuality Assurance Engineer Mobile Apps (m/f/d)\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eat the earliest possible date | permanent employment | full-time employment\u003c/strong\u003e\u003c/p\u003e\n\u003ch2\u003eAn exciting task awaits you with us\u003c/h2\u003e\n\u003cp\u003eWould you like to take responsibility for the quality of our native mobile products (iOS \u0026amp; Android)? In close collaboration with our QA lead you will be driving our mobile testing activities from the moment stories are written! You design, implement and execute testing plans and test automation, push a culture of QA best practices and work closely with our product managers and developers. Thereby you assure and improve our product quality and create a seamless user experience. Your tasks in detail:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCreation of an automated \u003cstrong\u003etest environment\u003c/strong\u003e to cover a variety of scenarios\u003c/li\u003e\n\u003cli\u003eDesign, development and maintenance of \u003cstrong\u003eframeworks\u003c/strong\u003e for our test infrastructure\u003c/li\u003e\n\u003cli\u003eWork with cross functional agile teams and definition of \u003cstrong\u003etesting strategies, criteria and processes\u003c/strong\u003e\n\u003c/li\u003e\n\u003cli\u003eKeep a detailed eye on the feature development process, empower the teams to adopt \u003cstrong\u003eQA mentality\u003c/strong\u003e and speak up to prevent risks\u003c/li\u003e\n\u003cli\u003eUse \u003cstrong\u003ecreative and user-centered\u003c/strong\u003e thinking to quickly identify and \u003cstrong\u003etest edge cases\u003c/strong\u003e for our applications\u003c/li\u003e\n\u003cli\u003eDefinition of \u003cstrong\u003eintegration tests\u003c/strong\u003e and evaluation of the quality level of every new app release\u003c/li\u003e\n\u003cli\u003eDiscover and experiment with \u003cstrong\u003enew test techniques\u003c/strong\u003e and formats for \u003cstrong\u003econtinuous improvement\u003c/strong\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eThat's what Cluno is all about\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eYour impact:\u003c/strong\u003e With your expertise and commitment you actively shape our growth.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eTeamwork:\u003c/strong\u003e Flexible, pragmatic, professional and solution-oriented; we have a great atmosphere - both at work and at our company events; we are currently over 60 experts and our team continues to grow.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eStable environment:\u003c/strong\u003e Start up and solidly positioned; for our three founders, Cluno is already the second successful start-up; German and American investors have invested a total of over $36 million in us in one year.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eOur office:\u003c/strong\u003e Centrally located in Munich at Leuchtenbergring; here we offer you fruit and drinks for free and we have our own canteen and coffee bars in-house. The highlight is our roof terrace with a view of the Alps.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eBenefits:\u003c/strong\u003e e.g. subsidy for the MVV ticket or employee discount for our Cluno Auto subscription.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eYou bring this with you as Quality Assurance Engineer Mobile Apps (m/w/d)\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eAt least \u003cstrong\u003e2 years of manual and automated testing experience\u003c/strong\u003e on Android and iOS\u003c/li\u003e\n\u003cli\u003eProven experience in \u003cstrong\u003emobile test automation, cloud based testing environments and with common testing frameworks\u003c/strong\u003e (e.g. Appium or Calabash)\u003c/li\u003e\n\u003cli\u003eHands-on with \u003cstrong\u003emobile programming languages\u003c/strong\u003e such as Java, Kotlin, Swift and Objective-C\u003c/li\u003e\n\u003cli\u003eExperience in \u003cstrong\u003ewriting, executing and validating tests across a wide test spectrum\u003c/strong\u003e (functional, non-functional, regression, integration, performance, security etc.)\u003c/li\u003e\n\u003cli\u003eExperience with__ test automation infrastructure__ development\u003c/li\u003e\n\u003cli\u003eMotivation to work with \u003cstrong\u003eagile/scrum development methodologies\u003c/strong\u003e\n\u003c/li\u003e\n\u003cli\u003eMarked commitment to \u003cstrong\u003equality and self-responsibility\u003c/strong\u003e as well as comfortable interaction and collaboration in \u003cstrong\u003ecross functional engineering and product teams\u003c/strong\u003e\n\u003c/li\u003e\n\u003cli\u003eFluent in written and spoken English and German just like good communication skills\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eSounds exciting?\u003c/h2\u003e\n\u003cp\u003eThen please send your application with your earliest possible start date and your salary expectations via the application form to Veronika Hotz. We look forward to welcoming you to our team!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://cluno.redirect.your-jobresponse.com/quality_assurance_engineer_mobile_apps_m_f_d_muenchen/246741/V819/anwenden\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eCluno GmbH\u003c/p\u003e\n\u003cp\u003eVeronika Hotz\u003c/p\u003e\n\u003cp\u003eNeumarkter Straße 28\u003c/p\u003e\n\u003cp\u003e81673 Munich\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"mailto:jobs@cluno.com\"\u003ejobs@cluno.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://www.cluno.com\"\u003ehttp://www.cluno.com\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003eWant to find out more?\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"https://www.kununu.com/de/cluno\"\u003ehttps://www.kununu.com/de/cluno\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.linkedin.com/company/cluno/\"\u003ehttps://www.linkedin.com/company/cluno/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://de-de.facebook.com/WeAreCluno/\"\u003ehttps://de-de.facebook.com/WeAreCluno/\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://cluno.redirect.your-jobresponse.com/quality_assurance_engineer_mobile_apps_m_f_d_muenchen/246741/V819/anwenden\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ0ZsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--88c56c66ddfc11be6ec5f452f957043d60724b0e/cluno.jpg"},{"id":"f40f615d-0d29-49f8-b353-da26e8cdbe4d","type":"Full Time","url":"https://jobs.github.com/positions/f40f615d-0d29-49f8-b353-da26e8cdbe4d","created_at":"Tue Apr 16 14:33:26 UTC 2019","company":"PKC","company_url":"http://www.pkc.io","location":"Huntington Beach","title":"Senior Frontend Developer","description":"\u003cp\u003e\u003cstrong\u003eSenior Frontend Developer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTo apply, please visit \u003ca href=\"https://pkcsecurity.typeform.com/to/CSsbu6\"\u003ehttps://pkcsecurity.typeform.com/to/CSsbu6\u003c/a\u003e, and fill out our Typeform job application!\u003c/p\u003e\n\u003cp\u003eRequirements:\nMinimum 3 years experience in Frontend Development\nMinimum 1 year experience with React.js\nStrong programming skills\nStrong communication skills\nDesire for that pixel-perfect implementation\u003c/p\u003e\n\u003cp\u003eNice-to-have’s:\nDesign experience\nMobile development experience\nNode.js\u003c/p\u003e\n\u003cp\u003eSalary Range: $120,000 - $160,000\u003c/p\u003e\n\u003cp\u003eJob Description\u003c/p\u003e\n\u003cp\u003eWe’re looking for a skilled developer in-pursuit of those pixel-perfect designs. In this position, you will be building out our frontend developing process, mentoring our junior developers in the best practices of frontend development, and coordinating with our Creative Director to produce bespoke solutions.\u003c/p\u003e\n\u003cp\u003eDay-to-day activities will look like 50% hands-on coding on assigned projects, and 50% mentorship. You should have patience and clear communication to encourage learning processes. Clear communication with clients will also be necessary for presenting solutions, managing expectations, and iterating on requirements.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eTo apply, please visit \u003ca href=\"https://pkcsecurity.typeform.com/to/CSsbu6\"\u003ehttps://pkcsecurity.typeform.com/to/CSsbu6\u003c/a\u003e, and fill out our Typeform job application!\u003c/p\u003e\n\u003cp\u003eOr send us an email with your resume and the position you are applying for in the title of the email!\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdmxrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cfb31f0ad40ecc33f3471a2010debd775efd2b7b/pkcLogoColorRGB.png"},{"id":"a344649b-01fc-40cf-bd3d-b443ff07fd90","type":"Full Time","url":"https://jobs.github.com/positions/a344649b-01fc-40cf-bd3d-b443ff07fd90","created_at":"Tue Apr 16 13:49:01 UTC 2019","company":"VONQ","company_url":"http://www.vonq.com","location":"Rotterdam","title":"Senior PHP Developer","description":"\u003cp\u003e\u003cstrong\u003eBuild and improve a product that helps companies attract more qualified applicants, using a data-driven recommendation engine, that’s what Engineering at VONQ does. We are a growing organization in the transition to a software-driven business, and YOU can make an impact on that! You are a true PHP expert and you get excited when it comes to practices such as domain driven design, event sourcing \u0026amp; CQRS. Sounds like you? Apply now at VONQ for the position of Senior Software Engineer in Rotterdam!\u003c/strong\u003e\u003c/p\u003e\n\u003ch2\u003eSenior PHP Developer\u003c/h2\u003e\n\u003cp\u003eRotterdam, 32-40 hr, ASAP\u003c/p\u003e\n\u003ch2\u003eYour every day in a nutshell\u003c/h2\u003e\n\u003cp\u003eYou start your day with your colleagues around the team board discussing what the goal for today should be. It seems that having the backend endpoint ready for the new API is tops, so you get down to it.\u003c/p\u003e\n\u003cp\u003eAfter a small design conversation, it's clear that some refactoring needs to happen, as our understanding of the problem improved. No worries! You're ready to pair up and have that PR before lunch.\u003c/p\u003e\n\u003cp\u003eIn the afternoon you have a one-on-one with the CTO, Bart, and you discuss to which industry-related event you'd like to go next. Perhaps you dare to give a presentation this time?\u003c/p\u003e\n\u003cp\u003eAfter that, you get to check some Pull Requests made by your colleagues and before the day ends, that endpoint is building, deploying and sending the right metrics! Today's been a good day, now ready to go home.\u003c/p\u003e\n\u003ch2\u003eHow you get the job done\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003ePHP is your native language and you use Symfony, MySQL and Elasticsearch\u003c/li\u003e\n\u003cli\u003eYou’ll work in a multidisciplinary team: pairing, code reviews and giving/receiving feedback is something you’ll do regularly\u003c/li\u003e\n\u003cli\u003eYour job includes more than only coding, that’s why you’ll work closely together with the Product Manager \u0026amp; Business stakeholders to actually give direction to the things you build\u003c/li\u003e\n\u003cli\u003eSince you get a lot of space and freedom for new initiatives, you turn good ideas into actions. For example, improving or implementing things you find important or interesting on the spot!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYou will be part of an international and experienced Engineering department consisting of Frontend- and Backend Developers, Data- and DevOps Engineers, an Agile Coach and a CTO.\u003c/p\u003e\n\u003ch2\u003eWhat our perfect picture looks like\u003c/h2\u003e\n\u003cp\u003eThis describes the ideal candidate, but above all, we value people that are eager to grow, autonomous, work together, and love to get things done! Furthermore, we think you need:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ year working experience as a PHP expert and an Agile mindset\u003c/li\u003e\n\u003cli\u003eExperience with MySQL\u003c/li\u003e\n\u003cli\u003eExperience with practices such as Domain Driven Design, Test-driven Development, Continuous- Integration, Deployment \u0026amp; Delivery\u003c/li\u003e\n\u003cli\u003eExcellent English communication skills\u003c/li\u003e\n\u003cli\u003eA passion for software architecture \u0026amp; craftsmanship\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eBonus points:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with event sourcing and CQRS\u003c/li\u003e\n\u003cli\u003eExperience with Symfony and Elasticsearch\u003c/li\u003e\n\u003cli\u003eExperience with REST API design and API based business\u003c/li\u003e\n\u003cli\u003eExperience as Scrum Master or team lead\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eThere is more! We offer:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eA good salary and 8% holiday allowance\u003c/li\u003e\n\u003cli\u003e100% commuting expenses compensation\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003cli\u003eUnlimited (paid!) holidays\u003c/li\u003e\n\u003cli\u003ePension contribution\u003c/li\u003e\n\u003cli\u003eTime and budget for training, and more!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOh, and we have legendary company outings, beers on Friday and a lot of FUN!\u003c/p\u003e\n\u003ch2\u003eAre you ready to make an impact and build together with us on a dream product for recruitment marketing? We can’t wait for your application!\u003c/h2\u003e\n\u003cp\u003eApply for Senior Software Engineer at VONQ in Rotterdam by clicking on \u003ca href=\"https://vonq.redirect.your-jobresponse.com/senior_php_developer_rotterdam/244865/V819/solliciteren\"\u003ethis link\u003c/a\u003e. Questions? Reach out to Sarah (Recruiter) -\u0026gt; \u003ca href=\"mailto:sarahellithy@vonq.com\"\u003esarahellithy@vonq.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eAgencies hold your horses: unsolicited CV’s are dropped by our SPAM filters.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.redirect.your-jobresponse.com/senior_php_developer_rotterdam/244865/V819/solliciteren\"\u003eApply via this link!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdlprIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a0e46699dc627f315dfbff1a4ff16b49c024aa5f/VONQ%20vierkant.jpg"},{"id":"ec2137f6-57e0-450b-bc28-4d3e9b802479","type":"Full Time","url":"https://jobs.github.com/positions/ec2137f6-57e0-450b-bc28-4d3e9b802479","created_at":"Tue Apr 16 08:07:12 UTC 2019","company":"InnoGames GmbH","company_url":"https://www.innogames.com/","location":"Hamburg","title":"Mobile Software Engineer","description":"\u003cp\u003eAs a \u003cstrong\u003eMobile Software Engineer\u003c/strong\u003e you will be part of our agile, cross-functional and international development team. The CORE department’s purpose is to provide centralized tools and services for all game teams. As part of our team, you will drive the development of new features as well as maintain and improve the current code of our libraries and modules.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour mission:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eConception and development of libraries, modules and tools for our games\u003c/li\u003e\n\u003cli\u003eContinuous refinement and optimization of existing libraries and modules\u003c/li\u003e\n\u003cli\u003eClose collaboration with different departments (e.g. Games, Payment, Analytics)\u003c/li\u003e\n\u003cli\u003eConception of APIs, tools and workflows to optimize the interdisciplinary work\u003c/li\u003e\n\u003cli\u003eFoster a culture of sharing knowledge, best practices and standards\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour profile:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have completed either a training as an IT specialist, a university degree in computer science or an equivalent qualification\u003c/li\u003e\n\u003cli\u003eYou have gained working experiences for at least 2 years in native mobile development on iOS or Android\u003c/li\u003e\n\u003cli\u003eYou have a good understanding of object-oriented programming, software architecture and design as well as API development\u003c/li\u003e\n\u003cli\u003eYou strive to improve yourself continuously and work on your focus-topics autonomously\u003c/li\u003e\n\u003cli\u003eYou like to share a good laugh with your colleagues\u003c/li\u003e\n\u003cli\u003eYou are able and willing to communicate in English with your teammates\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDesirable:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGood understanding of release processes and CI/CD\u003c/li\u003e\n\u003cli\u003eExperience with Unity and knowledge of 3D math is a plus\u003c/li\u003e\n\u003cli\u003eProfessional experience in agile software development (e.g. SCRUM or Kanban)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhy join us?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eShape the success story of InnoGames with a great team of driven experts in an international culture\u003c/li\u003e\n\u003cli\u003eCompetitive compensation and an atmosphere to empower creative thinking and strong results\u003c/li\u003e\n\u003cli\u003eExceptional benefits ranging from flawless relocation support to company gym, smartphone or tablet of your own choice for personal use, roof terrace with BBQ and much more\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWould you like to become part of a dynamic team and work as a \u003cstrong\u003eMobile Software Engineer\u003c/strong\u003e with us? Then we look forward to receiving your application as well as your salary expectations and earliest possible starting date through our online application form at innogames.com. Your contact person for this job offer is \u003cstrong\u003eMaximilian Kaeding\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eInnoGames, based in Hamburg, is one of the leading developers and publishers of online games with more than 200 million registered players around the world. Currently, more than 400 people from 30 nations are working in the Hamburg-based headquarters. We have been characterized by dynamic growth ever since the company was founded in 2007. In order to further expand our success and to realize new projects, we are constantly looking for young talents, experienced professionals, and creative thinkers.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://www.innogames.com/career/detail/job/mobile-software-engineer/?s=Github\"\u003ehttps://www.innogames.com/career/detail/job/mobile-software-engineer/?s=Github\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdkZrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f4c16e7cc7466a2bbc0bc4c6e793d60c2d86eb78/logo_innogames.png"},{"id":"4835e8eb-e7db-49cc-b12b-c40376af6c89","type":"Full Time","url":"https://jobs.github.com/positions/4835e8eb-e7db-49cc-b12b-c40376af6c89","created_at":"Mon Apr 15 19:57:30 UTC 2019","company":"Southern California Public Radio - KPCC","company_url":"http://www.kpcc.org","location":"Pasadena","title":"Product Manager","description":"\u003cp\u003e\u003cstrong\u003eWe’re seeking a Product Manager to spearhead next generation public media product strategy for audiences that rely on L.A.’s most listened-to NPR station KPCC and LAist.com in order to stay informed, inspired, and connected across platforms and devices. The ideal candidate has razor sharp product assessment skills with an ability for ruthless prioritization, can easily establish clarity amid chaos, and is comfortable with running lean.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWho we are\u003c/strong\u003e\nKPCC and LAist are part of the Southern California Public Radio (SCPR) family of publications. Our mission is to strengthen civic and cultural bonds that unite Southern California’s diverse communities by providing the highest quality news and information through our website, mobile apps, social media channels, live events, and emerging media experiences.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout the team\u003c/strong\u003e\nThe product team at SCPR is a small and dedicated crew of developers, designers, and product managers who create and maintain our award-winning mobile apps and websites. We like to ship quickly but also strive for design excellence and code quality.  In addition to working on our own publishing platform, we also collaborate with NPR (National Public Radio) on products, software tools, and data systems that are used by public radio stations across the nation.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWho you are\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLoves engaging with audience, members, and stakeholders to surface requirements\u003c/li\u003e\n\u003cli\u003eComfortable facilitating development and implementation of new editorial and business processes across a growing organization\u003c/li\u003e\n\u003cli\u003eCan balance guiding internal teams through a consistent project vision with listening to, and incorporating, feedback from experts in their field\u003c/li\u003e\n\u003cli\u003eIs obsessed with human-centered design and user research\u003c/li\u003e\n\u003cli\u003eCan easily communicate product strategy to non-experts, both in one-on-one and large group meetings\u003c/li\u003e\n\u003cli\u003eStays current with emerging trends in UX, digital platforms, and online news\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll do\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCome to work at the Mohn Broadcast Center in the heart of sunny Pasadena\u003c/li\u003e\n\u003cli\u003eLead an agile SCRUM product team to deliver world-class product experiences driven by user research and iterative releases\u003c/li\u003e\n\u003cli\u003eOwn SCPR product strategy and roadmap\u003c/li\u003e\n\u003cli\u003eSolve strategic business and audience problems\u003c/li\u003e\n\u003cli\u003eGrow the impact of SCPR’s digital platforms and emerging experiences\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eHow to Apply\u003c/strong\u003e\nTo apply online, please follow this link: \u003ca href=\"https://americanpublicmedia.applicantpro.com/jobs/1049562.html\"\u003ehttps://americanpublicmedia.applicantpro.com/jobs/1049562.html\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eTo apply online, please follow this link: \u003ca href=\"https://americanpublicmedia.applicantpro.com/jobs/1049562.html\"\u003ehttps://americanpublicmedia.applicantpro.com/jobs/1049562.html\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdTVrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--dc37f5ff334855fca50bebfceebc62b5e5d5b19e/KPCC%20-%20Headphones%20-%20Blue.jpg"},{"id":"ea15cd91-6a1d-4cdb-a38b-4364fa10dd4d","type":"Full Time","url":"https://jobs.github.com/positions/ea15cd91-6a1d-4cdb-a38b-4364fa10dd4d","created_at":"Mon Apr 15 17:16:49 UTC 2019","company":"Educator.com","company_url":"https://www.educator.com","location":"Los Angeles","title":"***Ionic / Angular Developer***","description":"\u003cp\u003eEducator.com is a video based learning website popular amongst high school and college students. We are currently in the process of launching a new open learning system and are looking to improve our current mobile app.\u003c/p\u003e\n\u003cp\u003eWe are looking for experienced developers to creating pixel-perfect web pages and/or apps using Ionic / Angular.\u003c/p\u003e\n\u003cp\u003eYou will be working remotely but engage in continuous periods of development and testing of the code with our team. All work and progress will be updated on our GitHub repo for the team to review.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT YOU'LL DO\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe have 3 concurrently ongoing projects you can choose from.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eProject #1\u003c/strong\u003e: The first project is for completing the open learning platform, where teachers can create their own courses and post video lectures and other lesson material. The basic framework of the site is in progress, and your job will be to build on the existing code and complete all the features. The site is at \u003ca href=\"https://opencourse.educator.com\"\u003ehttps://opencourse.educator.com\u003c/a\u003e. Login access will be provided for you upon request.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eProject #2\u003c/strong\u003e: The second project is to complete the login, signup and subscription features in our mobile app (\u003ca href=\"https://play.google.com/store/apps/details?id=com.educator.app\"\u003ehttps://play.google.com/store/apps/details?id=com.educator.app\u003c/a\u003e, \u003ca href=\"https://play.google.com/store/apps/details?id=com.educator.app\"\u003ehttps://play.google.com/store/apps/details?id=com.educator.app\u003c/a\u003e). After that the open learning platform mentioned above will be added to the app. You will also have a lot of opportunities for improving and adding features to the app.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eProject #3\u003c/strong\u003e: The third project is restructuring our company Wordpress blogs. Educator.com currently have the following Wordpress blogs and we need to merge all of them together into a single Wordpress.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003ca href=\"https://www.educator.com/news/\"\u003ehttps://www.educator.com/news/\u003c/a\u003e\n\u003ca href=\"https://www.educator.com/studyguide/\"\u003ehttps://www.educator.com/studyguide/\u003c/a\u003e\n\u003ca href=\"https://www.educator.com/college-reviews/\"\u003ehttps://www.educator.com/college-reviews/\u003c/a\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://www.educator.com/charter-schools/\"\u003ehttps://www.educator.com/charter-schools/\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.educator.com/study-abroad/\"\u003ehttps://www.educator.com/study-abroad/\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.educator.com/technology/\"\u003ehttps://www.educator.com/technology/\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.educator.com/student-finance/\"\u003ehttps://www.educator.com/student-finance/\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIt's your job to analyze the content structure and decide best to merge all the blogs. We will provide you the final Wordpress theme in image form, you will create the theme and merge all of our current blogs. The fix payout for this project is $2,300USD + additional bonuses\u003c/p\u003e\n\u003cp\u003eAll 3 projects are on GitHub; you will be provided access, and all your changes will be reviewed there. You will install the existing code and framework on your local system and test all changes there before pushing to the repo. \u003cem\u003eBoth projects are built on Ionic 3 with Angular, with a PHP backend, using the aMember membership system hosted on the main \u003ca href=\"http://www.educator.com\"\u003ewww.educator.com\u003c/a\u003e site.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003ePlease send links with examples of any relevant projects you've worked on as well as your resume.\u003c/p\u003e\n\u003cp\u003eIndependent developers are preferred. Companies/agencies, please excuse.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eQUALIFICATIONS:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with the Ionic/Angular framework as well as HTML, CSS, JS and PHP.\u003c/li\u003e\n\u003cli\u003eKnowledge or experience of video upload and processing.\u003c/li\u003e\n\u003cli\u003eAbility to create quick-responding complex user interfaces.\u003c/li\u003e\n\u003cli\u003eCreative solutions to improve the user experience.\u003c/li\u003e\n\u003cli\u003eSome knowledge or experience of progressive web apps.\u003c/li\u003e\n\u003cli\u003eAttention to detail\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eJOB BENEFITS:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYour contribution will be massively felt by students on Educator.com.\u003c/li\u003e\n\u003cli\u003eYou will work directly with the founder and senior developers of the company.\u003c/li\u003e\n\u003cli\u003eFinancial compensation can be paid by hourly, fixed or by salary depending on the collaborative chemistry.\u003c/li\u003e\n\u003cli\u003eNo corporate BS and politics.\u003c/li\u003e\n\u003cli\u003eFreedom to do your thing and work remotely from anywhere and set your own hours.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYou can apply for this opportunity here only: \u003ca href=\"https://www.educator.com/careers/ionic\"\u003ehttps://www.educator.com/careers/ionic\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003cstrong\u003eVisit \u003ca href=\"https://www.educator.com/careers/ionic\"\u003eEducator's Jobs Page\u003c/a\u003e and apply for the Ionic / Angular Developer position\u003c/strong\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdWRrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--28f075a5f282f71bbb288be0c88ad0bd70f1304d/educator.png"},{"id":"debcbc04-9e07-4d83-b8c0-b1a3d40ce309","type":"Full Time","url":"https://jobs.github.com/positions/debcbc04-9e07-4d83-b8c0-b1a3d40ce309","created_at":"Mon Apr 15 16:12:32 UTC 2019","company":"Black Rocket","company_url":"https://blackrocket.com","location":"Freehold, NJ","title":"PHP Developer (Mid-Level)","description":"\u003cp\u003eWe think we’re changing education. Kids just think it’s cool!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOur Mission. Our Company\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eJoin our cast of talented, creative people who care deeply about revolutionizing STEM education for the next generation of developers, tech leaders, and entrepreneurs. The company specializes in enrichment programs (camps/ after school) and game-based learning for educators (K12 in-school programs). Black Rocket is an established company with the culture of a startup. With double and triple digit growth every year we work hard at a fast pace, but also find time for fun. Perks include a laid back dress code, outdoor work spaces, work from home policy, drone racing, arcade lounge, company BBQs, and social events.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eReports to:\u003c/strong\u003e Director of Technology\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePrimary Responsibilities:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelopment and maintenance of codebases for Black Rocket proprietary applications\u003c/li\u003e\n\u003cli\u003eTesting features prior to deployment. Programmatic testing with PHPUnit or similar is highly valued\u003c/li\u003e\n\u003cli\u003eGather and analyze requirements from user feedback\u003c/li\u003e\n\u003cli\u003eMaintain best practices of technical documentation for Black Rocket applications\u003c/li\u003e\n\u003cli\u003eCreate support materials - video tutorials, user manuals and handbooks\u003c/li\u003e\n\u003cli\u003eDevelop and maintain webhooks, API connections, and general maintenance of external applications - Desk for support, Zoho CRM, Moodle LMS, Google AdWords, WooCommerce, et al\u003c/li\u003e\n\u003cli\u003eCreation and maintenance of analytic reports for all Black Rocket programs and software\u003c/li\u003e\n\u003cli\u003eMaintain code for Black Rocket proprietary game-based learning system\u003c/li\u003e\n\u003cli\u003eWork with the senior management and staff to create product roadmaps\u003c/li\u003e\n\u003cli\u003eAnalyze business processes and find areas for automation and efficiency\u003c/li\u003e\n\u003cli\u003eCoordinate and manage internal and external coders, development companies, and designers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSecondary Responsibilities:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSupport and maintenance of software packages for renewing courses\u003c/li\u003e\n\u003cli\u003eResearch and development of affordable software packages for new courses\u003c/li\u003e\n\u003cli\u003eCreate portable software packages\u003c/li\u003e\n\u003cli\u003eDevelop and manage web and server architecture - e.g. auto-scaling, load balancing\u003c/li\u003e\n\u003cli\u003eDevelop and manage data and content management systems (WordPress and Moodle)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eExperience and Skills\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eQualifications:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor’s degree in Computer Science, IT, or similar\u003c/li\u003e\n\u003cli\u003e3+ years of development experience\u003c/li\u003e\n\u003cli\u003eFamiliarity with current technologies (server, database, languages) and standards\u003c/li\u003e\n\u003cli\u003eInterpersonal skills and the ability to work in a team environment\u003c/li\u003e\n\u003cli\u003eProficiency in PHP, JavaScript, HTML, CSS, and MySQL\u003c/li\u003e\n\u003cli\u003eExperience with Laravel and VueJS is highly valued\u003c/li\u003e\n\u003cli\u003eExperience with unit/integration testing code\u003c/li\u003e\n\u003cli\u003eInternal network administration and familiarity with Apache web servers\u003c/li\u003e\n\u003cli\u003eStrong understanding of OOP, design patterns, and MVC architecture\u003c/li\u003e\n\u003cli\u003eAbility to create meaningful and clear user experiences\u003c/li\u003e\n\u003cli\u003eExperience using Git-based resources for version control of projects\u003c/li\u003e\n\u003cli\u003eExperience with agile development\u003c/li\u003e\n\u003cli\u003eSubmit to and pass a background check\u003c/li\u003e\n\u003cli\u003eUnderstands and models company philosophy and culture\u003c/li\u003e\n\u003cli\u003eAbility to manage multiple concurrent projects, while maintaining attention to detail\u003c/li\u003e\n\u003cli\u003eCommunicates orally and in writing in a clear, well organized, and grammatically correct manner\u003c/li\u003e\n\u003cli\u003eListens effectively\u003c/li\u003e\n\u003cli\u003eParticipate, lead and contribute constructively in group situations like meetings, etc.\u003c/li\u003e\n\u003cli\u003eOpen to direction, new ideas, and a collaborative work style\u003c/li\u003e\n\u003cli\u003eDelegate specific tasks to staff coders effectively\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eJob Benefits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSalary is competitive with industry standards and generous health benefits and 401k  are provided.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eVisit \u003ca href=\"https://blackrocket.com/jobs/\"\u003eBlack Rocket's Jobs Page\u003c/a\u003e and apply for the PHP Web Developer (Mid-Level) position\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdU5rIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7734a4882881c7cc7312eb4e0fbd90d506743937/BlackRocketLogos_BlackWBackground_HiRes.png"},{"id":"b17e103b-7557-46f9-a134-1d36c9e5ad9e","type":"Full Time","url":"https://jobs.github.com/positions/b17e103b-7557-46f9-a134-1d36c9e5ad9e","created_at":"Mon Apr 15 16:00:19 UTC 2019","company":"Revenue Analytics","company_url":"http://www.revenueanalytics.com","location":"Atlanta","title":"Software Engineer II","description":"\u003cp\u003eRevenue Analytics (RA) is a growing tech-enabled consulting company that blends Artificial Intelligence with Human Intelligence to deliver Predictive Analytics at scale. If you want to be a part of a fun and highly collaborative team that knows how to get stuff done, RA is the place for you. We allow the freedom to be creative, take initiative, and grow; all in a lively, laid-back work environment.\u003c/p\u003e\n\u003cp\u003eAs a Software Engineer II on our Solution Operations Team, you’ll collaborate on cross-functional project teams to solve some of today’s most pressing business problems for Fortune 500 companies. You’ll own the full stack technical implementation of large scale innovative solutions, and you’ll help build our intellectual property portfolio by being a key contributor to our cloud-based Big Data Analytics Platform.\u003c/p\u003e\n\u003cp\u003eWho You Are\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eMaster’s degree with 1 year of experience or Bachelor's degree with 3+ years of experience\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience developing product based applications or frameworks used by product development\nteams\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eStrong interest in working with AWS; ideally with one or more AWS certifications\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eStrong Computer Science fundamentals in data structures, algorithm design, problem solving, and\ncomplexity analysis\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eIn depth knowledge of at least one modern programming language, Python strongly preferred\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eUnderstanding of the importance of Unit Tests and a desire to implement them\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDesire to develop software that makes a significant impact on developer and data analyst\nefficiency\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eStrong distaste for performing repetitive tasks and seeing others do the same\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDemonstrated interest in data science, ETL/ELT, machine learning or cloud computing\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eKnowledge of modern open source tools and frameworks\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eGeneral interest in craft of software development or other computing related disciplines\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOutstanding Benefits \u0026amp; Perks:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eCompetitive market based salary + incentive bonus\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePaid medical insurance, dental and vision coverage for both you and your family\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e401k plan with immediate vesting and generous employer match\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePaid time off includes 3+ weeks’ vacation, 6 national holidays, and paid sick time\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCompany issued cell phone and laptop to employee\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFlexible office hours\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDefined career path with a coach to foster your growth\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePaid maternity leave for new mothers and paternity leave for new fathers\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eGym membership reimbursement\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003ePlease apply via this link:\n\u003ca href=\"https://jobs.lever.co/revenueanalytics/f4a5ebb0-5e43-4c99-be17-8797677b1994/apply\"\u003ehttps://jobs.lever.co/revenueanalytics/f4a5ebb0-5e43-4c99-be17-8797677b1994/apply\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdHhrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3446b9883e848ecc54cd65b91dbcb7647a582d90/Revenue%20Analytics-Logo-FullColor-1000px_high%20resolution.png"},{"id":"38b365bc-5c5d-4beb-9e34-8710ef2f27df","type":"Full Time","url":"https://jobs.github.com/positions/38b365bc-5c5d-4beb-9e34-8710ef2f27df","created_at":"Mon Apr 15 15:06:54 UTC 2019","company":"BuildingLink ","company_url":"http://www.buildinglink.com/marketing/public/main","location":"New York, NY","title":"Mid- to Senior-level Vue.js Developer","description":"\u003cp\u003e\u003cstrong\u003eAbout the Position\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDo you have solid Vue.js chops and are looking to put them to the test on a complex, large-scale project? Do you want to contribute to and develop architectural solutions from the ground-level? If you love making things work seamlessly and efficiently with one another, then we’re looking for you! We’re looking for a mid- to senior-level Vue.js Developer to be a key player in one of our company’s most critical initiatives, our platform conversion to Vue.js. You’ll be a vital resource on our highly-collaborative Development team, building robust scalable solutions that push the limits and can handle an endless supply of data that’s consumed by many different websites, client apps, mobile apps, Alexa, customers, vendors, etc. in real-time.\u003c/p\u003e\n\u003cp\u003eJob responsibilities include:\u003c/p\u003e\n\u003cp\u003e-Works within a highly collaborative team with senior members of our team, including our CTO, to develop a large-scale Vue.js application.\u003c/p\u003e\n\u003cp\u003e-Solves architectural challenges for a large-scale application involving a high-level of customer configurability, multiple user-types, multi-language support and more by conducting research on and experiments with alternate solutions to present recommendations.\u003c/p\u003e\n\u003cp\u003e-Designs and develops high-quality code that exhibits excellent performance, meets product requirements, and focuses on scalability and maintainability.\u003c/p\u003e\n\u003cp\u003e-Shows excellent judgment in architecting and planning applications and features at all stages of the project lifecycle.\u003c/p\u003e\n\u003cp\u003e-Interacts effectively with senior members of our team to determine project needs and develop solutions.\u003c/p\u003e\n\u003cp\u003e-Takes overall accountability for keeping the project clean and organized. This includes identifying next steps, clarifying unclear tasks, and breaking larger tasks into smaller and more manageable tasks.\u003c/p\u003e\n\u003cp\u003e-Exercises a sense of ownership to get things done. Do whatever it takes to make things happen and proactively gives advance warning if things aren’t going well so we can arrange for help.\u003c/p\u003e\n\u003cp\u003e-Constantly improves software quality (evaluate and incorporate new libraries, tools, and technologies; code reviews; refactoring; testing; etc.).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout You\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e-5+ years of development experience.\u003c/p\u003e\n\u003cp\u003e-2+ years with Vue.js with proven experience working on multiple complex projects.\u003c/p\u003e\n\u003cp\u003e-2 to 3 years of experience with application design/architecture.\u003c/p\u003e\n\u003cp\u003e-Previous experience working across JavaScript frameworks a plus.\u003c/p\u003e\n\u003cp\u003e-Demonstrates EXEMPLARY communication skills (both written and verbal).\u003c/p\u003e\n\u003cp\u003e-Fluent in English.\u003c/p\u003e\n\u003cp\u003e-An EXTRAORDINARY creative and analytical problem solver.\u003c/p\u003e\n\u003cp\u003e-Possesses and demonstrates PHENOMENAL overall technical expertise.\u003c/p\u003e\n\u003cp\u003e-Demonstrates a sense of urgency.\u003c/p\u003e\n\u003cp\u003e-Self-motivated, has a love for learning and new technology, and able to lead and mentor others.\u003c/p\u003e\n\u003cp\u003e-Experience with unit and end-to-end testing.\u003c/p\u003e\n\u003cp\u003e-IMPECCABLE attention to detail.\u003c/p\u003e\n\u003cp\u003e-Familiar with Agile development methodologies.\u003c/p\u003e\n\u003cp\u003e-Experience working on a B2B SaaS platform within a startup environment preferred.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eExperience on the following is a plus:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e-Nuxt.js\n-Documenting code and APIs.\u003c/p\u003e\n\u003cp\u003e-Code quality/unification (ESLint / Prettier).\u003c/p\u003e\n\u003cp\u003e-Code optimization and performance.\u003c/p\u003e\n\u003cp\u003e-Developing cross-platform applications.\u003c/p\u003e\n\u003cp\u003eWe’d love it if you develop/contribute to open source!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat BuildingLink Can Offer You\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e-Opportunities to learn and advance your career\u003c/p\u003e\n\u003cp\u003e-Office culture comparable to the fast-pace, energy, and vibrancy of a startup, while maintaining the feel of a family owned company\u003c/p\u003e\n\u003cp\u003e-Competitive salary\u003c/p\u003e\n\u003cp\u003e-Medical/Dental/Commuter Benefits\u003c/p\u003e\n\u003cp\u003e-401k with matching\u003c/p\u003e\n\u003cp\u003e-Flexible PTO\u003c/p\u003e\n\u003cp\u003e-Birthday Holiday\u003c/p\u003e\n\u003cp\u003e-Team outings (happy hours, company events \u0026amp; retreats, weekly lunches, holiday parties, etc.)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout Us\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBuildingLink is an industry leading property management technology used by over 4,800 high-rise residential communities globally. As an industry pioneer and leading innovator, our solutions, service, and people have made us one of the most recognized and respected technology providers among property managers and staff, condo/coop boards, and landlords. Our roadmap is packed with new and exciting initiatives to help buildings run even better. Resident lifestyle, voice assistant with our Amazon Alexa Skill; Ledger for simplified property management accounting, more platform integrations, and IoT sensor solutions to target and solve buildings’ operational headaches are just a few of the key initiatives we have in the pipeline. So, if you’re looking to work for a dynamic and successful company that cares deeply for both its customers and employees, please apply!\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eBuildingLink is an equal opportunity employer to all persons regardless of age, color, national origin, citizenship status, disability, race, religion, gender, sex, sexual orientation, gender identity and/or expression, genetic information, marital status, veteran status, or any other protected class by federal, state or local law.\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease visit:\n\u003ca href=\"https://workable.com/j/A84789BBB7\"\u003ehttps://workable.com/j/A84789BBB7\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdGRrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--301d1caa13aa7cf31391cea59f917dc1a762395a/Logo.png"},{"id":"e6ef1696-46cc-4ccd-9072-a737ef49fa70","type":"Full Time","url":"https://jobs.github.com/positions/e6ef1696-46cc-4ccd-9072-a737ef49fa70","created_at":"Mon Apr 15 14:59:29 UTC 2019","company":"Decathlon Sportartikel GmbH \u0026 Co.KG","company_url":"http://decathlon-karriere.de","location":"Plochingen","title":"Frontend Developer (f/m/d)","description":"\u003ch2\u003e#SPORTSFREUNDE\u003c/h2\u003e\n\u003ch2\u003eBEWERBEN SICH BEI DECATHLON\u003c/h2\u003e\n\u003cp\u003eYou will support the UX team with your sense of good design and UX, bringing your creativity to bear on various projects and taking on a range of interdisciplinary tasks. You will improve our different digital channels on an ongoing basis through your work in development and design. You will work at our headquarters in Plochingen (near Stuttgart).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBe a part of our success story in Plochingen (near Stuttgart) as our new\u003c/strong\u003e\u003c/p\u003e\n\u003ch2\u003eFrontend Developer (f/m/d)\u003c/h2\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003ch2\u003eAs Frontend Developer you will be responsible for ...\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eimplementing modern front-end principles through open web standards and modern web technology to ensure the best user experience across different end devices.\u003c/li\u003e\n\u003cli\u003ecollaborating closely with our web marketing executives by offering advice and assistance with creating concepts, with a good eye for detail.\u003c/li\u003e\n\u003cli\u003eworking with version control to fix bugs and conflicts as new features are rolled out on the website.\nconstantly improving the performance of our applications, while keeping an eye on the impact of your work on them.\u003c/li\u003e\n\u003cli\u003eoptimising our digital channels and maintaining ongoing exchange with our international teams.\u003c/li\u003e\n\u003cli\u003eexpanding our automated release process (CI) and quality assurance.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eYou are ...\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eenthusiastic about sport.\u003c/li\u003e\n\u003cli\u003ea front-end developer with a degree in Computer Science or a background in which you have successfully completed comparable training.\u003c/li\u003e\n\u003cli\u003efamiliar with responsive design and digital media, with an eye for creative aesthetics.\u003c/li\u003e\n\u003cli\u003efamiliar with agile working methods, e.g. Scrum, for the efficient implementation of innovative web front ends using HTML5/CSS3/JavaScript (ES5/6).\u003c/li\u003e\n\u003cli\u003efamiliar with single-page application frameworks such as Angular or React, or have experience working with server- side JavaScript.\u003c/li\u003e\n\u003cli\u003eexperienced with APIs such as REST.\u003c/li\u003e\n\u003cli\u003emotivated by challenges and teamwork.\u003c/li\u003e\n\u003cli\u003eproactive, results-oriented, independent.\u003c/li\u003e\n\u003cli\u003egood at communicating, with good to very good English skills. German is not a must have.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe are looking forward to receiving your application, with a selection of your best work.\u003c/p\u003e\n\u003cp\u003eApply now via the application form or at:\n\u003ca href=\"http://www.decathlon-karriere.de\"\u003ewww.decathlon-karriere.de\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://tinyurl.com/yyvmr2p5\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"http://tinyurl.com/yyvmr2p5\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdEprIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--43d70bb3092342d84079a4b3b6aa468f37d23063/Decathlon.png"},{"id":"c1a50b39-ded1-4a39-a090-dc6e794d843d","type":"Full Time","url":"https://jobs.github.com/positions/c1a50b39-ded1-4a39-a090-dc6e794d843d","created_at":"Mon Apr 15 14:18:06 UTC 2019","company":"The Rock Creek Group","company_url":"https://www.therockcreekgroup.com/","location":"Washington","title":"Web and UI Developer","description":"\u003cp\u003e\u003cstrong\u003eWeb and UI Developer\u003c/strong\u003e\n1133 Connecticut Ave NW, Washington, DC 20036, USA\nFull-time\u003c/p\u003e\n\u003ch2\u003eCompany Description\u003c/h2\u003e\n\u003cp\u003eRockCreek is a leading global investment management firm that applies data-driven technology and innovation to investing. Its portfolio managers invest in emerging markets and alternatives, and its asset allocation teams invest in multi-asset class and outsourced CIO portfolios and customized solutions. RockCreek’s client base is made up of sophisticated institutional investors, including endowments, foundations, pension plans, and sovereign funds. The firm is highly focused on the integration of environmental, social, and governance (ESG) factors and sustainable impact across portfolios to generate long-term returns. RockCreek has a culture of diversity, debate and relentless drive to excel.\u003c/p\u003e\n\u003cp\u003eWhile our core competency is investment, we value our technology as a key part of our service offerings. We are currently redesigning our website to use best-of-breed technologies and a staging and production platform. We also have a growing suite of applications that will need a unified, consistent, and user-focused approach to UX and UI.\u003c/p\u003e\n\u003ch2\u003eJob Description\u003c/h2\u003e\n\u003cp\u003eRockCreek is looking for a Web and UI Designer to provide a meaningful connection between the company’s public-facing website, internal Intranet, and suite of applications. This role will be responsible for recommending and implementing a web CMS solution, designing and implementing both a staging and production version of a new company website, developing a company Intranet presence, and working with the engineering team to provide consistent designs and front-ends across all of our applications. This will role also frequently communicate with users and stakeholders of our various applications.\u003c/p\u003e\n\u003cp\u003eThe successful Web and UI Developer should:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEnjoy the process of visual and material design, as well as implementing those designs in responsive HTML, CSS, and JavaScript\u003c/li\u003e\n\u003cli\u003eModel user’s behavior with wireframes and mockups using creative and modern best practices and design patterns\u003c/li\u003e\n\u003cli\u003eBe fluent in modern web abstractions for CSS and JavaScript, and desire to grow in an understanding and usage of JavaScript in particular\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAlthough travel is not expected to be frequent, the Web and UI Developer should be able to occasionally meet onsite with clients and, if not located in the Washington, D.C. area, meet with the team for in-person planning sessions.\u003c/p\u003e\n\u003ch2\u003eQualifications\u003c/h2\u003e\n\u003ch2\u003eRequirements:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor’s Degree in design, human-computer interaction (HCI), or similar, or equivalent professional experience\u003c/li\u003e\n\u003cli\u003eAt least 3 years experience as a web, UI, or UX developer\u003c/li\u003e\n\u003cli\u003eUnderstanding of user-centered design methods, including portfolio of sites you have designed or co-designed that demonstrate attention to user workflows in addition to static design\u003c/li\u003e\n\u003cli\u003eExperience with a major CMS, such as Wordpress, ideally in a multi-staged environment (testing, staging, production, etc.)\u003c/li\u003e\n\u003cli\u003eFluency in best practices for information architecture and design\u003c/li\u003e\n\u003cli\u003eExperience with Jira or Pivotal Tracker\u003c/li\u003e\n\u003cli\u003eStrong written and verbal English communication skills\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDesired Skills:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003ePast application development using React and/or Vue.js, preferably in the context of single-page applications\u003c/li\u003e\n\u003cli\u003ePractical experience performing user studies or documenting user workflows for implementation in web applications\u003c/li\u003e\n\u003cli\u003eAWS or Google Cloud experience\u003c/li\u003e\n\u003cli\u003eExperience in investment applications or working with the investment and/or financial industry\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eInterested?\u003c/h2\u003e\n\u003cp\u003ePlease apply by using the \u003cstrong\u003e'Apply'\u003c/strong\u003e button.\u003c/p\u003e\n\u003ch2\u003eAdditional Information\u003c/h2\u003e\n\u003cp\u003eRockCreek is a collaborative environment that values openness, transparency, partnership, and knowledge sharing. In a typical day you will interact with members of all of our teams; engineering is neither siloed nor cut off from the overall RockCreek business. You should be both interested and capable of learning the investment business as it relates to engineering, and creatively looking to enhance the overall RockCreek service offerings.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003eAgency calls are not appreciated.\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://therockcreekgroup.redirect.your-jobresponse.com/web_and_ui_developer_washington/246723/V819/solliciteren\"\u003eClick here to apply!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc2xrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--53153e169349c40b0daecd486235a420e6edd054/62789_20190117143938.png"},{"id":"5fc062d6-4371-4098-9657-fc4df9c4d3c1","type":"Full Time","url":"https://jobs.github.com/positions/5fc062d6-4371-4098-9657-fc4df9c4d3c1","created_at":"Mon Apr 15 14:13:04 UTC 2019","company":"ING","company_url":"http://www.ing.nl","location":"AmsterdamING","title":"Software engineer","description":"\u003cp\u003eWant to touch the lives of millions of customers around the world, turning their digital customer journey into a fantastic ride? Then join our global engineering team.\u003c/p\u003e\n\u003cp\u003eOur apps are used by millions of customers all over the globe, multiple times a day. We’re looking for experienced software engineers who can help turn their digital journey into a fantastic ride.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe’re on a mission\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMore and more people live their lives on digital platforms. And although competition is fierce, this is where we want to be. We want to be part of people’s lives, helping them make better decisions. Become the go-to-place for their financial matters. What will this platform of ours look like? We’re building it right now. And that’s where you come in.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll be working on\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe work on high-performing, scalable, innovative, multi-channel applications that make our customers smile with every interaction.\u003c/p\u003e\n\u003cp\u003eWe have positions available in teams that are working to improve our mobile banking app, our internet banking web app, global continuous deployment pipelines, generic web components libraries, cross-channel employee portals and much more. We’d love to know in which ING team you’d like to add value.\u003c/p\u003e\n\u003cp\u003eAs a full stack software engineer, you’ll work in an international environment in one of our multidisciplinary squads. Together with business colleagues, UX designers, visual designers and product owners you’ll be building our next generation banking applications.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll get in return\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eThe chance to work in a global, innovation-driven company that loves tech.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAn international and diverse network of the best engineering talents.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eMany opportunities to test yourself, learn and grow.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAn agile, vibrant and flexible work environment.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eGreat work-life balance.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA competitive salary and excellent benefits, like a 13th month, pension scheme, personal allowance, laptop, mobile phone.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you bring\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’re looking for creative, open-minded junior, mid-level and senior engineers who:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eLove solving technical and functional challenges.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eQuickly grasp new technical concepts, also outside of their comfort zone.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eKnow what it’s like to work in multidisciplinary teams and embrace the agile way of working.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHave great analytical skills and conceptual / architectural understanding.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFollow software development trends and technology in general, and enjoy sharing what they know with the rest of the organisation.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHave strong social and communication skills (fluently speak and write English)\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour tech stack\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eA proven track record and proficiency in software development.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFor back end think about JVM-based with a focus on Java, Spring, Maven, Jenkins, Sonar, Cassandra, Oracle.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFor front end: Polymer, Angular, Web components, Redux, NPM.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eKnowledge about databases, VMs, docker and cloud patterns are an advantage.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with (test) automation, continuous delivery, deployment tools and pipelines. We work with Tomcat, Jenkins, Nolio, SonarQube, Fortify, Artifactory, Selenium among others.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eInterested? Let’s chat\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTo find out more, hit the  \u003ca href=\"https://ing.redirect.your-jobresponse.com/software_engineer_amsterdam/246705/V819/solliciteren\"\u003elink!\u003c/a\u003e and share your CV. We’ll be in touch.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://ing.redirect.your-jobresponse.com/software_engineer_amsterdam/246705/V819/solliciteren\"\u003eClick here to apply!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc2RrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c50e5ca88eb1e52fbcfb4b58c9e0f74f0a5fce6e/ING.jpg"},{"id":"e5606c91-3936-445a-b56a-a4cad1db4015","type":"Full Time","url":"https://jobs.github.com/positions/e5606c91-3936-445a-b56a-a4cad1db4015","created_at":"Mon Apr 15 13:29:38 UTC 2019","company":"Howard Hughes Medical Institute (HHMI)","company_url":"https://www.hhmi.org/","location":"Chevy Chase, MD","title":"Web Application Developer/Drupal Developer","description":"\u003cp\u003eAt the Howard Hughes Medical Institute (HHMI), creativity and excellence are fundamental to our success. As one of the world's largest philanthropies, HHMI is a major force in advancing biomedical research and science education in the U.S. and beyond. We have an exciting opportunity for a web developer working in the Information Technology department at our Headquarters in Chevy Chase, Maryland. This is a full-time position.\u003c/p\u003e\n\u003cp\u003eAt our headquarters, we provide space for collaboration and interaction beyond your office – sunlit rooms, artwork, beautiful grounds, gyms with classes, snacks, and, of course, smart people and innovative work all around…not to mention free coffee!\u003c/p\u003e\n\u003cp\u003eWe invest in people, not projects. As such, the organization is committed to helping our employees grow. The development team has access to a variety professional development options including training programs, courses, and conferences, to name a few.\u003c/p\u003e\n\u003cp\u003eEssential Duties \u0026amp; Responsibilities\u003c/p\u003e\n\u003cp\u003eReporting to the Senior Manager of Web Application Development, the web application developer must know Drupal inside and out with experience taking complex page designs and building out the required content types, frontend HTML/CSS/JS, and even writing custom modules as needed. The developer should be very familiar with commonly used Drupal modules, and understand the basic architecture for Drupal sites. Our clients appreciate high attention to detail when translating designs to code, so we prefer developers who have an eye for common user experience and design issues that crop up on both desktop and mobile implementations.\u003c/p\u003e\n\u003cp\u003eYou will work alongside a skilled team of other web developers, and will collaborate with them on projects, following Agile/Scrum methodologies. Code reviews, quality assurance, and user-acceptance testing are all part of our process to ensure high caliber results.\u003c/p\u003e\n\u003cp\u003eQualifications\u003c/p\u003e\n\u003cp\u003eEducation:\u003c/p\u003e\n\u003cp\u003eBS degree in computer science, computer engineering, or information technology.\u003c/p\u003e\n\u003cp\u003eExperience:\u003c/p\u003e\n\u003cp\u003e2+ of hands-on experience with Drupal 7/8.\n5+ years of web development experience.\nStrong fluency in PHP.\nExperience with source control systems, such as Git.\nDemonstrated proficiency of HTML/CSS/JS, with technologies such as LESS/SAAS, Bootstrap, Node/NPM/Gulp, and Angular/React.\nExperience with at least two other programming languages.\u003c/p\u003e\n\u003cp\u003ePlease include links to source control or websites in your application to showcase your coding experience and skills.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to: \u003ca href=\"mailto:mooneyk@hhmi.org\"\u003emooneyk@hhmi.org\u003c/a\u003e\nOR\nApply directly: \u003ca href=\"https://hhmi-openhire.silkroad.com/epostings/index.cfm?fuseaction=app.jobinfo\u0026amp;jobid=996\u0026amp;company_id=16908\u0026amp;version=2\u0026amp;source=ONLINE\u0026amp;jobOwner=992797\u0026amp;aid=1\"\u003ehttps://hhmi-openhire.silkroad.com/epostings/index.cfm?fuseaction=app.jobinfo\u0026amp;jobid=996\u0026amp;company_id=16908\u0026amp;version=2\u0026amp;source=ONLINE\u0026amp;jobOwner=992797\u0026amp;aid=1\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc05rIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bbf5ecf0b53d722202a453481b696cbf6ddbe351/HHMI_logo_color_horizontal_smallv2.png"},{"id":"b4d921e0-7f13-4cd2-bc85-7bd02c9db900","type":"Full Time","url":"https://jobs.github.com/positions/b4d921e0-7f13-4cd2-bc85-7bd02c9db900","created_at":"Mon Apr 15 09:57:10 UTC 2019","company":"Telenor Software Labs","company_url":"https://jobs.academicwork.no/annons/vi-sker-utvikler-til-telenor-software-lab-trondheim/15025342","location":"Trondheim, Norway","title":"Frontend Developer","description":"\u003cp\u003eVi søker utvikler til Telenor Software Lab Trondheim!\u003c/p\u003e\n\u003cp\u003eElsker du å programmere og ser etter nye utviklingsmuligheter? Vil du være med å videreutvikle en tjeneste over en million mennesker bruker? Vi søker utvikler som ønsker og jobbe med den kjente skytjenesten \"Min Sky\"!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eInformasjon om stillingen\u003c/strong\u003e\nTelenor Software Lab i Trondheim utvikler Telenors tjeneste “Min Sky” for skylagring av bilder og video. Tjenesten har over en million brukere og er en sentral del av Telenors satsing på digitale tjenester. Telenor Software Lab er posisjonert for å levere flere slike tjenester, og utviklingsteamet er stadig i vekst.\u003c/p\u003e\n\u003cp\u003eVi har et spennende fagmiljø der vi jobber med et bredt spekter av oppgaver, fra maskinlæring og bildegjenkjenning til utvikling av gode brukergrensesnitt. Det er fokus på brukeropplevelse, og vi gjennomfører undersøkelser ute blant faktiske brukere for å finne ut hva som fungerer.\u003c/p\u003e\n\u003cp\u003eTil sammen teller vi i dag 31 stk på kontoret, hvor vi har en flott variasjon i nasjonaliteter og aldre. Teamet du vil jobbe på består i dag av fire stk. Vi bruker scrum som arbeidsmetodikk, og jobber derfor både selvstendig og i team. I starten får du tett oppfølging og opplæring. Vi forventer ikke at du skal kunne alt fra før og hos oss får du hjelp til å kvalitetssikre ditt arbeid, når vi har daglige code-reviews.\u003c/p\u003e\n\u003cp\u003eHos oss vil du ha påvirkningskraft og rom for å komme med forslag. På sikt kan du få mer ansvar, samt få muligheten til å lære flere teknologier om du ønsker det.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVi tilbyr\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUtviklingsmuligheter og egenutviklingsprogram tilpasset den enkelte ansatte\u003c/li\u003e\n\u003cli\u003eSpennende fagmiljø\u003c/li\u003e\n\u003cli\u003eInteressante og utfordrende oppgaver\u003c/li\u003e\n\u003cli\u003eValgfritt verktøy/utstyr til arbeidet\u003c/li\u003e\n\u003cli\u003eSvært godt arbeidsmiljø og moderne lokaler\u003c/li\u003e\n\u003cli\u003eGoder som ekstra ferie, fri kantine, dekt andel av foreldrepermisjon, telefon/internett mm.\u003c/li\u003e\n\u003cli\u003eKonkurransedyktige vilkår\u003c/li\u003e\n\u003cli\u003eFleksibel arbeidstid, med kjernetid fra 0930-1500\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eArbeidsoppgaver\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eVidereutvikle Min Sky sine tjenester\u003c/li\u003e\n\u003cli\u003eImplementere nye features\u003c/li\u003e\n\u003cli\u003eNoe vedlikehold\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eVi søker deg som\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eErfaring med utvikling av skytjenester\u003c/li\u003e\n\u003cli\u003eFerdigheter innen React og TypeScript\u003c/li\u003e\n\u003cli\u003eFordel med relevant utdanning på høyskolenivå\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eHos oss er dine personlige egenskaper like viktig som dine tekniske programmeringskunnskaper! Faktisk er det aller viktigste for oss at du virkelig liker å programmere, bryr deg om brukeropplevelser og har et ønske om å utvikle deg som utvikler. Når vi jobber i team er samarbeid en egenskap vi setter høyt, og vi ønsker gjerne deg som er fremoverlent og tørr å gjøre feil, samtidig som du er selvstendig og ansvarsfull.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRekrutteringsprosessen utføres av Academic Work på vegne av Telenor. Ta kontakt med Mari Helland for spørsmål! Søknadsfrist 22.04.19!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eInformasjon om bedriften\u003c/strong\u003e\nTelenor Software Lab designer, utvikler og drifter digitale tjenester både for Telenor og direkte mot sluttkunder. Vårt største produkt er \"Min Sky\", en skylagringstjeneste for bilder og video. Tjenesten har over en million brukere og er en sentral del av Telenors satsing på digitale tjenester. Telenor Software Lab er posisjonert for å levere flere slike tjenester, og utviklingsteamet er stadig i vekst. Vi har i dag 31 ansatte og holder til på Brattørkaia i Trondheim.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eSøk ved å trykke \u003ca href=\"https://jobs.academicwork.no/annons/vi-sker-utvikler-til-telenor-software-lab-trondheim/15025342\"\u003eher\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcjFrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c6f2bbfb3d56cd202defaefe8804d6dde91124c0/Telenor%20software%20lab.png"},{"id":"a444bd05-f433-42e9-b28d-7aa8d243f950","type":"Full Time","url":"https://jobs.github.com/positions/a444bd05-f433-42e9-b28d-7aa8d243f950","created_at":"Mon Apr 15 09:55:09 UTC 2019","company":"Metrological","company_url":"https://www.metrological.com/","location":"Rotterdam","title":"FullStack Developer","description":"\u003cp\u003e\u003cstrong\u003eFullStack developer / DevOps\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMetrological is quickly growing (inter-)nationally and therefore we are looking for expansion of our current team with a FullStack developer / DevOps.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eWhat will you do?\u003c/strong\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eThe daily activities range from data modeling to implementation, from web sockets to server architecture and the resolution of possible production problems.\u003c/li\u003e\n\u003cli\u003eAs a FullStack developer / Dev Ops you work with different techniques, such as NodeJS, Linux, Nginx, Redis, ElasticSearch, MySQL and AngularJS.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003e\u003cstrong\u003eWhat we are looking for?\u003c/strong\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor or master’s degree in computer science or similar technical area is a must;\u003c/li\u003e\n\u003cli\u003eRelevant experience as a full stack developer / dev op is a must;\u003c/li\u003e\n\u003cli\u003eExtensive experience with Javascript, Linux en MySQL is a must;\u003c/li\u003e\n\u003cli\u003eExperience with NodeJS, Redis, nginx en ElasticSearch is a plus;\u003c/li\u003e\n\u003cli\u003eYou have an excellent command of the English language, in word and in writing;\u003c/li\u003e\n\u003cli\u003eFurthermore, you are accurate, structured and a team player, who is able to work independently and take on responsibilities.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003e\u003cstrong\u003eOur dedicated team working in a tech-challenging environment:\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eYou will become a part of the development team (consisting of 40 dedicated team members, including App Developers, Testers, Graphic Designers and Backend / Framework Developers) and are responsible for the development and maintenance of all backend services for our TV Appstore and associated TV Applications.\u003c/p\u003e\n\u003cp\u003eThe Appstore is continuously under development as we are glad to supply innovative products to our customers. In addition to innovation, the challenge lies mainly in the code-technical aspect and the maintenance of the cloud architecture. There is an extensive cloud architecture with\u0026gt; 99.99% uptime that serves more than 100TB of data per month worldwide and has to handle 2500 requests per second at peak times.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eWhy are we the best company to currently work?\u003c/strong\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eMetrological is a very innovative and dynamic company in the TV industry.\u003c/li\u003e\n\u003cli\u003eThe office is located in the heart of Rotterdam and can best be described as a modern and inspiring work environment with an informal but professional atmosphere.\u003c/li\u003e\n\u003cli\u003eWith a close-knit team of over 60 young and ambitious employees, the company works daily on the (continued) development of the Appstore for TV operators.\u003c/li\u003e\n\u003cli\u003eMetrological is growing fast so the internal (growth) possibilities are virtually unlimited. We offer you a position in which you can relinquish your creativity and work on the product of the future. You work in an inspiring environment with the latest equipment, so you can get the best out of yourself.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003e\u003cstrong\u003eApply?\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eDo you want to contribute to the success of Metrological? Send your resume via \u003ca href=\"https://metrological.has-jobs.com/fullstack_developer_rotterdam/246655/V819/apply\"\u003ethis link\u003c/a\u003e and we get in touch with you within 2 working days.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://metrological.has-jobs.com/fullstack_developer_rotterdam/246655/V819/apply\"\u003eClick here to apply!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcmxrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--50ce95c513168c73cede37cc21c5745d316aa91d/metrological-logo.jpg"},{"id":"686b4853-8e0c-49d3-926d-7e85a0d70e2a","type":"Full Time","url":"https://jobs.github.com/positions/686b4853-8e0c-49d3-926d-7e85a0d70e2a","created_at":"Mon Apr 15 08:55:32 UTC 2019","company":"Cobiro Aps","company_url":"https://cobiro.com/","location":"Copenhagen","title":"Senior Backend PHP Developer (Laravel)","description":"\u003cp\u003e\u003cstrong\u003eBe a part of an exciting journey\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt Cobiro we're using machine learning and AI to build the next generation of online advertising experiences. We're on a mission to make online marketing accessible, trivial and high-performing for everyone, and we're starting with Google Ads.\u003c/p\u003e\n\u003cp\u003eWorking at Cobiro, you’ll join a flat and agile organisation where bright ideas are appreciated and implemented regardless of seniority or area of specialization. We’re ambitious and work hard, but also know how to let loose and celebrate our accomplishments. At Cobiro you will meet different nationalities and personalities. We have common denominators: We are self-starters and team-players, love to solve problems, and we create high quality solutions.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe offer:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003cli\u003eAn agile work environment\u003c/li\u003e\n\u003cli\u003eFocus on quality solutions\u003c/li\u003e\n\u003cli\u003eOptions to attend relevant courses and conferences\u003c/li\u003e\n\u003cli\u003eA team of passionate, skilled and experienced colleagues\u003c/li\u003e\n\u003cli\u003eAll the gear and food you need: breakfast on Fridays, lunch every day, sodas, sparkling water, fruit, vegetables, sweets...\u003c/li\u003e\n\u003cli\u003eFrequent social company activities, Friday bar included\u003c/li\u003e\n\u003cli\u003eGood working equipment\u003c/li\u003e\n\u003cli\u003eA great working location at Esplanaden, Central Copenhagen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePHP Backend Developer (Laravel)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou will join a company where quality is valued: We know it sometimes takes time creating something great, and even if we do have deadlines we prefer a good product to quick launching. This means, you will work independently and take responsibilities of your own projects, and you can use your knowledge and curiosity to build something great.\u003c/p\u003e\n\u003cp\u003eYou will be joining a skilled tech team consisting of backend developers working within the Laravel framework. We practice daily stand-ups, 14 day sprints, and work within smaller teams. We can offer an agile working environment: we collaborate across departments as well, for example AI, QA, Frontend, or Product Management.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFor this position, you will need:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExcellent PHP coding skills and solid experience in Laravel\u003c/li\u003e\n\u003cli\u003eSubstantial PostgreSQL/MySQL experience\u003c/li\u003e\n\u003cli\u003eExperience with data integration, web services \u0026amp; APIs\u003c/li\u003e\n\u003cli\u003eProficient in GIT, and knowledgeable of CI principles\u003c/li\u003e\n\u003cli\u003eSharp analytical mind with the ability to break down requirements and problems into smaller pieces\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eWe are looking forward to receiving your application through our application system - simply click on \"Apply for this job\" and attach your CV and/or Linkedin account.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://cobiro.bamboohr.com/jobs/view.php?id=29\"\u003ehttps://cobiro.bamboohr.com/jobs/view.php?id=29\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eYou will always get a reply when applying through our system.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcTVrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1b4a6ca84ea1a1aa4a460b78f6ef2691c54a1daa/Cobiro%20Logo.png"},{"id":"783fb36b-2379-42d6-878c-bbf5b92108d5","type":"Full Time","url":"https://jobs.github.com/positions/783fb36b-2379-42d6-878c-bbf5b92108d5","created_at":"Mon Apr 15 08:40:46 UTC 2019","company":"Mothership","company_url":"https://mothership.cx","location":"Remote","title":"Senior Full-stack Developer (Firebase, node, react) ","description":"\u003cp\u003eMothership engineering team is working towards Exchange product release. You have an excellent opportunity to jump on-board and join us on this exciting journey. Here is the portrait of a person we’re looking for.\u003c/p\u003e\n\u003cp\u003eYou agree that JavaScript has won the war, at least for now. It’s your favorite tool, and you mastered it while making apps and web servers for years. Your favorite front-end framework is React.js. You can use it in different variations depending on a task and a project size. You are an expert in node.js. You know it’s architecture, and you don’t hesitate to use a profiler to improve the performance of a service. You’re following best development practices. Your code is nice and clean, and you can be on the same page with your teammates about this.\u003c/p\u003e\n\u003cp\u003eYou passed through times of manual deployments and now enjoy the era of Docker containers. However, you prefer to be serverless. Although you can spin up any services and self-manage them, you're more happy with using managed cloud solutions. You love Firebase. You can tell us at least a couple of stories how did it help you to solve a business problem in hours instead of days and weeks. You’re not trying to dump QA responsibility on someone else. You agree that testing is a developer’s responsibility. You are proud of your typical above 95% test coverage. You can organize CI/CD flow and push a constant stream of features and patches to a staging environment, then to the production.\u003c/p\u003e\n\u003cp\u003eWe are all constantly learning, but that’s not your first reason for joining us. You come here, first and foremost, to add another solid mark in your track record of successful projects. You listen to business needs and can evaluate priorities. You don’t want to be micromanaged. You are feature and delivery oriented. You are keen to make a great product. If all the above is about you, please double check the requirements and responsibilities below, add your cover letter and apply.\u003c/p\u003e\n\u003cp\u003eRequirements:\u003c/p\u003e\n\u003cp\u003eFive years of production experience in apps and web servers development;\nExpert knowledge in node.js and react.js;\nConfident UI development with HTML and CSS;\nA track record of projects built with Firebase and other serverless tools;\nExperience building scalable APIs which is able to handle high-volume traffic;\nExperience working in a startup environment;\nA strong team player with excellent communication skills;\nAbility to hack things together quickly;\u003c/p\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cp\u003eImprove, add new features and build new software solutions for Mothership;\nDesign and implement APIs to integrate Mothership’s products with internal and external services;\nOptimize development process by bringing best practices and improving CI/CD pipeline;\nOwn and deliver maintainable, well-tested code.\u003c/p\u003e\n\u003cp\u003eApply on Lever - \u003ca href=\"https://jobs.lever.co/mothership/e70325f2-f6c8-4111-a590-2ef1e1a2724d\"\u003ehttps://jobs.lever.co/mothership/e70325f2-f6c8-4111-a590-2ef1e1a2724d\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobs.lever.co/mothership/e70325f2-f6c8-4111-a590-2ef1e1a2724d\"\u003ehttps://jobs.lever.co/mothership/e70325f2-f6c8-4111-a590-2ef1e1a2724d\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcXBrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--052f7caf01803840c7688e5dfb6fc1b46fe185e2/msp_icon.png"},{"id":"be897a91-fd98-48f8-aabd-b94e846801de","type":"Full Time","url":"https://jobs.github.com/positions/be897a91-fd98-48f8-aabd-b94e846801de","created_at":"Fri Apr 12 15:06:06 UTC 2019","company":"Taledo GmbH ","company_url":"https://taledo.bamboohr.com/jobs/view.php?id=24","location":"Berlin","title":"Senior/Lead Backend Developer (m/f/d)","description":"\u003cp\u003eABOUT THE ROLE\u003c/p\u003e\n\u003cp\u003eAs a (Senior) Backend Developer, you contribute to building the backend system of Taledo's platform, which includes development but also infrastructure tasks. You are a significant part of Taledo Team and you take initiative to support your colleagues’ and your own development process within the organization.\u003c/p\u003e\n\u003cp\u003eYOUR RESPONSIBILITIES\u003c/p\u003e\n\u003cp\u003eYou design, develop and maintain Taledo’s backend services/APIs.\nYou build sustainable code and take full responsibility over parts of the backend infrastructure.\nYou have direct impact on the product and you see your code used live within days after joining.\nYou implement the product requirements and cover it by test cases.\nYou may also have the possibility of working on frontend related tasks on a case-by-case basis.\nYou directly report to and work with the CTO.\u003c/p\u003e\n\u003cp\u003eABOUT YOU\u003c/p\u003e\n\u003cp\u003eMinimum 5 years of experience with Rails 4 and exposure to other relevant backend technologies\nRelevant university degree and solid track record of academic and professional and/or personal achievements.\nThorough mindset, you never think in best cases.\nEfficient and pragmatic working style, mastering your IDE and tooling.\nWillingness to work in agile environment.\nExperience with HTML5, CSS and JS frameworks is a plus.\u003c/p\u003e\n\u003cp\u003eYOUR ENVIRONMENT\u003c/p\u003e\n\u003cp\u003eAt Taledo you will work with a highly motivated team in a truly international atmosphere.\nWe provide a professional environment that allows you to stay focused but also leaves room for creativity.\nOpen and honest communication on all levels is important to us.\nWe are always open to constructive feedback and expect the same from you.\nKnowledge sharing and constant learning  are pillars of our culture hence we give you the opportunity to work on interesting side projects and develop your core or non-core competencies.\nWe offer responsibility from the start in a flat hierarchy environment with a doer \u0026amp; maker mindset.\nWe provide breakfast, sweet and salty snacks, fruits and drinks.\nWe organize regular team events and keep the atmosphere in the office very casual and friendly.\nWe have flexible working hours and offer additional vacation entitlement for every year you are part of Taledo.\nOur office and the team is pet friendly.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply by this link \u003ca href=\"https://taledo.bamboohr.com/jobs/view.php?id=24\"\u003ehttps://taledo.bamboohr.com/jobs/view.php?id=24\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcUprIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3cead32a50768cfbfd8d845ba0d025d4701a1611/taledo_logo_vert300.jpg"},{"id":"f8f9730b-e8a2-43fc-9116-de97ef05413f","type":"Full Time","url":"https://jobs.github.com/positions/f8f9730b-e8a2-43fc-9116-de97ef05413f","created_at":"Fri Apr 12 14:54:01 UTC 2019","company":"ThinxNet GmbH","company_url":"https://thinxnet.com/","location":"Munich","title":"Linux and Network Cloud Systems Engineer","description":"\u003cp\u003eThinxNet is a young company from Munich, living the Internet of Things vision. With our product ryd, we’re able to connect cars with the internet in a simple and fast way. Given our system, consisting of a hardware plug and a smartphone app, customers can get mobile access to relevant on-board information of their automobiles, pay at the gas station with just one click on their smartphone – without lining up in the shop – and much more. In addition, consumers have the chance to collect ryd by participating in marketing campaigns. Later on, these bonus points can be converted to premiums. Our long-term goal is to create a completely new mobility experience within the connected car and furthermore making vehicles smarter than ever before.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour tasks\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBeing responsible for the installation and maintenance of our Linux based servers and and  container swarms\u003c/li\u003e\n\u003cli\u003eSupporting and monitoring the Linux environment as well as testing and troubleshooting of software and hardware problems in the environment\u003c/li\u003e\n\u003cli\u003eAs part of the infrastructure team, analyze cloud architecture implementations and make recommendations regarding security, network design and storage utilization\u003c/li\u003e\n\u003cli\u003eWork with the team to automate management tasks, streamline processes and perform standard administration functions as needed\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour Qualifications\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSolid experience with maintenance, monitoring, high availability and backups\u003c/li\u003e\n\u003cli\u003eWorking knowledge in IT automation/orchestration software like SaltStack is a plus\u003c/li\u003e\n\u003cli\u003eWorking knowledge of containerization solutions such as Docker and orchestration solutions such as Kubernetes is a plus\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat we offer\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLearn from our experienced team, investors and advisors\u003c/li\u003e\n\u003cli\u003eAttractive role in the development of our growing service\u003c/li\u003e\n\u003cli\u003eCompetitive salary\u003c/li\u003e\n\u003cli\u003eGreat workplace\u003c/li\u003e\n\u003cli\u003eNo politics, quick decisions in a well-funded start-up\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eReady to revolutionize the automotive industry?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThen submit your CV and a short note why and when you want to join us to \u003ca href=\"mailto:jobs@thinxnet.com\"\u003ejobs@thinxnet.com\u003c/a\u003e. If you have any questions, feel free to give us a call or just stop by at our office. We really look forward to getting to know you!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eContact\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eChristoph Geiser\nHead of Software Development\u003c/p\u003e\n\u003cp\u003eryd.one |thinxnet.com | ThinxNet GmbH Blutenburgstr. 18 | 80636 München | Tel.: +49 89 4520663-0\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSpecial Instructions for Headhunters (only):\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThis is a permanent position - no freelancers are currently considered.\u003c/li\u003e\n\u003cli\u003ePlease carefully read the job description.\u003c/li\u003e\n\u003cli\u003ePlease send the matching CVs to the relevant job advertisement.\u003c/li\u003e\n\u003cli\u003eWe are happy to review anonymized CVs - we will get back to you if the CV is interesting. If not then please do not expect an answer.\u003c/li\u003e\n\u003cli\u003ePlease only send CVs which match the job description. If a job is not posted here, then there is no need to send a CV or call.\u003c/li\u003e\n\u003cli\u003eIf you are not a headhunter and happen to read this, but rather look for a job, then please ignore the above lines: we are happy to receive your call and we will for sure provide feedback on your application :-)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/403630f697072e4950510ef2ff74aa1a9bf00d49/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f633f6369643d36363263393430372d663863622d343032342d613136392d393063316334356463666234266a69643d65343062343066302d666337362d343437392d386563322d613539386133353635626139267069643d64336664373566352d653431352d343062322d613866632d3632373730366464656263652665633d76696577253341706978656c2663623d687474707325334125324625324673332d65752d776573742d312e616d617a6f6e6177732e636f6d253246676f686972696e672d7075626c69632d617373657473253246706978656c2e676966\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://tracking.gohiring.com/c?cid=662c9407-f8cb-4024-a169-90c1c45dcfb4\u0026amp;jid=e40b40f0-fc76-4479-8ec2-a598a3565ba9\u0026amp;pid=d3fd75f5-e415-40b2-a8fc-627706ddebce\u0026amp;ec=click%3Aapply_url\u0026amp;cb=https%3A%2F%2Fthinxnet-jobs.personio.de%2Fjob%2F99796%23apply\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcDlrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--acc52de11925c3a049887d3196f67832e487d581/ThinxNet-Logo.png"},{"id":"e75a3b62-a34b-4c55-bacf-949ad823bc20","type":"Full Time","url":"https://jobs.github.com/positions/e75a3b62-a34b-4c55-bacf-949ad823bc20","created_at":"Fri Apr 12 14:49:43 UTC 2019","company":"Oneplanet.com","company_url":"http://www.oneplanet.com","location":"Anywhere but able to work on European time zone","title":"Front End Developer for new sustainability platform","description":"\u003cp\u003eYou are a Front End Developer wanting to join a small team and make a contribution to social and environmental impact at the same time as build a commercially successful company.\u003c/p\u003e\n\u003cp\u003eWe are looking for a freelance developer to join our team developing the \u003ca href=\"http://www.oneplanet.com\"\u003ewww.oneplanet.com\u003c/a\u003e platform. The company is a for-profit enterprise which has been set up by leading not-for-profit, Bioregional \u003ca href=\"http://www.bioregional.com\"\u003ewww.bioregional.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eIn order to take our platform to the next level, our User Interface Designer is creating many new UI design files. Before implementing these designs in the back-end of the platform, we need a front-end developer to take the ADOBE XD files and code them in HTML / CSS / Material UI static web pages.\u003c/p\u003e\n\u003cp\u003eTherefore, we are looking for a developer who has 2 or 3 years experience at least in coding clean HTML, CSS3, responsive design and who has also experience in using Photoshop or similar image editor tools in order to collaborate with our UI designer. You will also need to have some experience of working with existing libraries like Material UI or Bootstrap.\u003c/p\u003e\n\u003cp\u003eWe work on European timezones but could have some flexibility. Initial contract will be for 6 months but will be extended for the right applicant.\u003c/p\u003e\n\u003cp\u003eWe are an equal opportunities company and would particularly welcome applications from women developers.\u003c/p\u003e\n\u003cp\u003ePlease send your CV and short covering note to \u003ca href=\"mailto:richard.edwards@oneplanet.com\"\u003erichard.edwards@oneplanet.com\u003c/a\u003e along with your remuneration expectation.  Please state country in which you are based.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease email you CV with a couple of sentences on why you want to join our team, to \u003ca href=\"mailto:richard.edwards@oneplanet.com\"\u003erichard.edwards@oneplanet.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcDFrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--397bc31592f2c9c52aff204a4b7b04606cb92b0f/Oneplanet.com%20logo%20with%20name%20.png"},{"id":"3f8fdc13-33eb-4306-81b7-3c23ad65085c","type":"Full Time","url":"https://jobs.github.com/positions/3f8fdc13-33eb-4306-81b7-3c23ad65085c","created_at":"Fri Apr 12 12:49:58 UTC 2019","company":"CGI","company_url":"http://www.cgi.nl","location":"Rotterdam","title":"Java developer / DevOps Engineer","description":"\u003cp\u003e\u003cem\u003eHeb jij (ruime) ervaring met applicatie ontwikkeling, testen en onderhoud en ben jij toe aan een nieuwe uitdaging? Kom jij als ervaren engineer te werken voor ons Agile Devops team dat zich bezig houdt met business kritische applicaties?\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eCGI heeft voor haar locatie in Rotterdam een vacature voor een\n\u003cstrong\u003eJava developer / DevOps Engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat ga je doen als Jave Developer / DevOps Engineer?\u003c/strong\u003e\nAls ervaren DevOps applicatie engineer houd jij je bezig met het vertalen van stakeholder requirements (functionele en niet-functionele) naar functioneel/technisch ontwerp en naar test ontwerp. Jij ontwikkelt applicatie- en test software (ontwerp, bouw en test). Daarnaast automatiseer jij systeem- en integratie testen (voorbereiden, uitvoeren en beheer/onderhoud) en voer jij applicatie onderhoud en support uit. Het oplossen van incidenten en waakdienst kan onderdeel zijn van de opdracht.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat breng je mee\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJe bent analytisch sterk en denkt in oplossingen. Ook ben je proactief en resultaat gedreven. Je hebt ruime ervaring met agile werken en werkomgeving. Je hebt goede communicatieve vaardigheden en een goede beheersing van de Nederlandse en Engelse taal. Daarnaast heb je:\u003c/li\u003e\n\u003cli\u003eErvaring met Java, SQL, Automatisch test scripting, System administratie (Unix/Linux);\n3 tot 5 jaar ervaring in Java software development en met test ervaring.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eHet is een pré als je ook ervaring hebt met:\u003c/strong\u003e\nJava Web Services, Soap or Rest, Perl, Relational database (MySQL), JMeter, Atlassian Jira  (voor Agile board) en Confluence (wiki), Jenkins and Docker (voor build en deployment   automatisering).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWaar kom je terecht\u003c/strong\u003e\nAls ervaren DevOps applicatie engineer kom jij te werken in het marktsegment Communications dat zich richt op alle grote telecom en mediabedrijven in Nederland. We leven in een wereld vol informatie waarin alles en iedereen is verbonden. Technologische vooruitgang en veranderend consumentengedrag hebben de bedrijfsomgeving voor de telecomindustrie veranderd. Het tempo waarin dit verandert ligt hoog. Het bieden van toegang tot communicatienetwerken is niet meer genoeg.\u003c/p\u003e\n\u003cp\u003eBinnen onze sector helpen we telecombedrijven in hun transformatie naar leveranciers van (digitale) belevingen. Al ruim 20 jaar zijn we actief in de (tele)communicatie industrie waarin we samen werken met toonaangevende bedrijven. Hierdoor kennen we de business én uitdagingen van telecom- en mediabedrijven en koppelen we dit aan onze IT-expertise. Samen met de andere professionals zet je in op service transities naar nieuwe diensten en werkwijzen (agile, lean), en netwerk transities (cloud based).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe willen het beste uit jou halen\u003c/strong\u003e\nWanneer je bij CGI gaat werken kom je terecht op een uitdagende werkvloer met professionele collega’s en ben je de bouwsteen binnen een hechte community. We stimuleren je in jouw ontwikkeling en bieden je hiervoor alle ruimte. Doorgroeien is vanzelfsprekend.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat mag je van ons verwachten:\u003c/strong\u003e\n\u003cstrong\u003eBouw met ons aan je carrière\u003c/strong\u003e\nHet is een bijzondere tijd binnen de wereld van IT, de digitale transformatie zit in een versnelling. CGI heeft een schat aan kennis en praktische ervaring op het gebied van digitale transformatie. Zo helpen wij onze klanten belangrijke stappen te zetten op de weg naar hun digitale transformatie en bieden we onze professionals uitdagende carrièremogelijkheden.\u003c/p\u003e\n\u003cp\u003eOns succes is gebaseerd op het talent en de betrokkenheid van onze professionals. Samen, als één team, staan we voor de uitdagingen en delen we de beloningen die gepaard gaan met de groei van CGI. Dit versterkt het gevoel van eigenaarschap, want al onze professionals delen mee in de waarde die wij gezamenlijk creëren.\u003c/p\u003e\n\u003cp\u003eKom werken bij CGI én bouw samen met ons aan een van de grootste, onafhankelijke, IT en zakelijke dienstverleners ter wereld.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMeer informatie\u003c/strong\u003e\nMeer informatie over de inhoud van de vacature? Neem contact op met Frank Meijers (Director Consulting Delivery) via 06-139.88.801 of \u003ca href=\"mailto:frank.meijers@cgi.com\"\u003efrank.meijers@cgi.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eVragen over de sollicitatieprocedure? Neem contact op met de afdeling Recruitment via (088) 564 00 00 of via \u003ca href=\"mailto:recruitment.nl@cgi.com\"\u003erecruitment.nl@cgi.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eMeer informatie of vragen over de sollicitatieprocedure? Neem hiervoor contact op met de afdeling Recruitment via (088) 564 00 00.\u003c/p\u003e\n\u003cp\u003eBezoek voor meer informatie over CGI: \u003ca href=\"http://www.cginederland.nl\"\u003ewww.cginederland.nl\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSolliciteren op de functie van DevOps applicatie engineer\u003c/strong\u003e\nAre you ready to be part of something dynamic? Solliciteer direct via onze \u003ca href=\"https://cgi.njoyn.com/cgi/xweb/xweb.asp?clid=21001\u0026amp;page=jobdetails\u0026amp;jobid=J0119-1046\u0026amp;BRID=EX661536\u0026amp;SBDID=1\u0026amp;LANG=9?utm_source=adveronline-vacaturesites\u0026amp;utm_medium=github\u0026amp;utm_campaign=java_developer_devops_engineer\"\u003esollicitatiepagina\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eWij bieden onze professionals een gelijkwaardige behandeling en gelijke carrièrekansen.\u003c/p\u003e\n\u003cp\u003eAcquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld!\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eTrefwoorden: Java Developer, Software Developer, SQL, Devops Engineer, Software Engineer\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003cstrong\u003eSolliciteren op de functie van DevOps applicatie engineer\u003c/strong\u003e\nAre you ready to be part of something dynamic? Solliciteer direct via onze \u003ca href=\"https://cgi.njoyn.com/cgi/xweb/xweb.asp?clid=21001\u0026amp;page=jobdetails\u0026amp;jobid=J0119-1046\u0026amp;BRID=EX661536\u0026amp;SBDID=1\u0026amp;LANG=9?utm_source=adveronline-vacaturesites\u0026amp;utm_medium=github\u0026amp;utm_campaign=java_developer_devops_engineer\"\u003esollicitatiepagina\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcEprIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--60e9d10631850c3bee5dafc4211cb1c4bc925319/CGI%20logo.png"},{"id":"c3ebd128-b9b6-4ddc-b29e-68507d148270","type":"Full Time","url":"https://jobs.github.com/positions/c3ebd128-b9b6-4ddc-b29e-68507d148270","created_at":"Fri Apr 12 10:41:28 UTC 2019","company":"HELLA GmbH \u0026 Co. KGaA","company_url":"http://hella.de/karriere","location":"Lippstadt","title":"SOFTWARE ARCHITEKT (M/W/D) DAS \u0026 AUTOMATED DRIVING","description":"\u003cp\u003eStandort Lippstadt, Deutschland\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePacesetting. Passionate. Together.\u003c/strong\u003e Seit 1899 prägt HELLA als einer der Top-40-Automobilzulieferer weltweit die Branche mit innovativen Lichtsystemen und Fahrzeugelektronik. Daneben ist das Unternehmen einer der wichtigsten Partner des Ersatzteilehandels sowie der freien Werkstätten. Unser Antrieb: die Mobilität von Morgen zu gestalten und die zentralen Markttrends wie Autonomes Fahren, Effizienz und Elektrifizierung, Konnektivität und Digitalisierung sowie Individualisierung voranzutreiben. Dafür setzen sich täglich weltweit über 40.000 Mitarbeiterinnen und Mitarbeiter mit Leidenschaft, Know-how und Innovationskraft ein.\u003c/p\u003e\n\u003ch2\u003eIHRE AUFGABEN\u003c/h2\u003e\n\u003cp\u003eAls Software Architekt entwickeln Sie zukunftsorientierte Software-Architekturen im automobilen Umfeld der Fahrerassistenzsysteme (DAS) und für Komponenten des autonomen Fahrens.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIn einem internationalen Team von SW Architekten und Entwicklern gestalten und verantworten Sie Teile der Softwarearchitektur innerhalb eines embedded MultiSensor- und MultiCore-Systems.\u003c/li\u003e\n\u003cli\u003eSie analysieren, bewerten und stimmen die Anforderungen von Kunden und internen Stakeholdern ab und leiten daraus Anforderungen an die Software-Architektur ab.\u003c/li\u003e\n\u003cli\u003eIn Zusammenarbeit mit unseren Experten berücksichtigen Sie dabei Anforderungen von Cyber Security und Funktionaler Sicherheit.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eIHRE QUALIFIKATIONEN\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eAbgeschlossenes Studium der Fachrichtung Elektrotechnik oder Informatik\u003c/li\u003e\n\u003cli\u003eErfahrung in der SW Architektur oder dem Embedded SW Engineering\u003c/li\u003e\n\u003cli\u003eBerufserfahrung oder Kenntnisse in Autosar wären wünschenswert und runden ihr Profil ab\u003c/li\u003e\n\u003cli\u003eGute Kenntnisse in MS-Office\u003c/li\u003e\n\u003cli\u003eTeamfähigkeit, Durchsetzungsvermögen sowie analytische und kommunikative Kompetenz\u003c/li\u003e\n\u003cli\u003eGute Deutsch- und Englischkenntnisse in Wort und Schrift\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eUNSER ANGEBOT\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eUmfangreiche Karriere- und Weiterbildungsmöglichkeiten sowie flexible Arbeitszeitmodelle\u003c/li\u003e\n\u003cli\u003eHELLA in motion – umfassendes Sport- und Gesundheitsprogramm mit unternehmenseigenem Fitnesscenter\u003c/li\u003e\n\u003cli\u003eUnterstützung rund um das Thema Familie: Familienservice, zwei HELLA Kinderhäuser, KidsCamp in den Ferien sowie Beratung bei der Pflege Angehöriger\u003c/li\u003e\n\u003cli\u003eBetriebsrestaurants, Mitarbeitervergünstigungen und Wäscheservice\u003c/li\u003e\n\u003cli\u003eBetriebliche Altersvorsorge mit HELLA Zuschuss\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003e#LI-GER\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eNutzen Sie die Gelegenheit und entfalten Sie Ihr Potenzial in einem weltweit agierenden Familienunternehmen, das Ihnen beste Voraussetzungen für Ihren persönlichen Karriereweg bietet.\u003c/p\u003e\n\u003cp\u003eBitte senden Sie uns Ihre Bewerbung über den bewerbungsformular oder unser Karriereportal unter Angabe der Kennziffer 20190319.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://hella-group.redirect.your-jobresponse.com/software_architekt_m_w_d_das_automated_driving_lippstadt/246593/V819/anwenden\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eFür Menschen mit Weitblick: \u003cstrong\u003ehella.de/karriere\u003c/strong\u003e\u003c/p\u003e\n\u003ch2\u003eIHR ANSPRECHPARTNER\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eHELLA GmbH \u0026amp; Co. KGaA\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFrau Carola Grobbel\u003c/p\u003e\n\u003cp\u003eRixbecker Straße 75\u003c/p\u003e\n\u003cp\u003e59552 Lippstadt\u003c/p\u003e\n\u003cp\u003e+49-2941-38-7646\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://hella-group.redirect.your-jobresponse.com/software_architekt_m_w_d_das_automated_driving_lippstadt/246593/V819/anwenden\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdkprIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ca29d5648d7cf6b738bf76d8943af18179d1c03d/hella.jpg"},{"id":"8eaa410f-b9ef-4d18-805c-a84bd3a56755","type":"Full Time","url":"https://jobs.github.com/positions/8eaa410f-b9ef-4d18-805c-a84bd3a56755","created_at":"Thu Apr 11 23:33:13 UTC 2019","company":"AMBR Detroit","company_url":"https://ambrdetroit.com/","location":"Detroit, MI","title":"Full Stack Web Developer","description":"\u003cp\u003eWe are a digital product design and software development company located in the heart of downtown Detroit. We partner with organizations to create custom software solutions, web \u0026amp; mobile applications, and delightful customer experiences. Some of the companies we’ve partnered with include StockX, Emagine Entertainment, University of Michigan, Rock Ventures, Rocket Fiber, and the Detroit Regional Chamber, just to name a few.\u003c/p\u003e\n\u003cp\u003eWe’re looking for an experienced software developer to join our team.  This is a full-time, on-site position, with the flexibility to work from home or anywhere as long as you can join us in the office a few days a week.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIs this you?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCan you architect object-oriented software solutions?\u003c/li\u003e\n\u003cli\u003eDo you have a strong understanding of how a browser renders a website?\u003c/li\u003e\n\u003cli\u003eAre you confident in your software solutions?\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat we're looking for:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMinimum of 5 years of software development experience.\u003c/li\u003e\n\u003cli\u003eA degree in Computer Science, Engineering or equivalent.\u003c/li\u003e\n\u003cli\u003eThe use of version control is pinnacle in your workflow.\u003c/li\u003e\n\u003cli\u003eComfortable architecting stable and flexible software solutions.\u003c/li\u003e\n\u003cli\u003eExperience with PHP, Node.js, Javascript, HTML and CSS.\u003c/li\u003e\n\u003cli\u003eUnderstand how RESTful APIs work and how to architect them.\u003c/li\u003e\n\u003cli\u003eExperience with custom WordPress development (plugins, themes, integrations).\u003c/li\u003e\n\u003cli\u003eComfortable integrating third-party platforms using APIs and SDKs.\u003c/li\u003e\n\u003cli\u003eExperience with cross-browser and cross-platform website testing.\u003c/li\u003e\n\u003cli\u003eUnderstand the value of good documentation.\u003c/li\u003e\n\u003cli\u003eComfortable developing projects with other developers.\u003c/li\u003e\n\u003cli\u003eInterested in continual learning and sharing knowledge with others.\u003c/li\u003e\n\u003cli\u003eEffective communication skills to collaborate with various stakeholders.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBonus Skills\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience working with Parse Platform.\u003c/li\u003e\n\u003cli\u003eExperience with tools such as Composer and Webpack.\u003c/li\u003e\n\u003cli\u003eExperience working with AWS\u003c/li\u003e\n\u003cli\u003eExperience building mobile applications.\u003c/li\u003e\n\u003cli\u003eCognizant of the security of data flow from browser to database.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eJob Perks\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUnlimited vacation policy\u003c/li\u003e\n\u003cli\u003eFlexible schedule, including work from home, or from anywhere days\u003c/li\u003e\n\u003cli\u003ePerformance based quarterly bonuses\u003c/li\u003e\n\u003cli\u003e401K Retirement plan with employer contribution\u003c/li\u003e\n\u003cli\u003eHealth and education allowance\u003c/li\u003e\n\u003cli\u003eFree parking\u003c/li\u003e\n\u003cli\u003eTeam activities\u003c/li\u003e\n\u003cli\u003eMoGo annual bike pass\u003c/li\u003e\n\u003cli\u003eFresh Chazzano's coffee \u0026amp; snacks\u003c/li\u003e\n\u003cli\u003eWork in a cool office space in downtown Detroit, with Herman Miller chairs and stand up desks\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eApply on our website here: \u003ca href=\"https://ambrdetroit.com/jobs/full-stack-software-developer/\"\u003ehttps://ambrdetroit.com/jobs/full-stack-software-developer/\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb3BrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--af6419b7aa212d3281b0f4cb1f362ec5d385653f/ambr_detroit_2-notagline.png"},{"id":"3fe420b3-25a3-4042-922a-cfe0c07a2fea","type":"Full Time","url":"https://jobs.github.com/positions/3fe420b3-25a3-4042-922a-cfe0c07a2fea","created_at":"Thu Apr 11 21:54:04 UTC 2019","company":"Matterport","company_url":"http://www.matterport.com","location":"Sunnyvale","title":"Senior / Senior Staff Android Engineer ","description":"\u003cp\u003eMatterport is a 3D immersive media SaaS company that makes it easy for anyone to quickly and inexpensively create a digital 3D model of any physical space. Our 3D immersive media platform is used across many industries to improve how people make decisions about properties. We are the world leader in the category we invented, having built digital models of over 1.5 million properties so far!\u003c/p\u003e\n\u003cp\u003eStarting with residential real estate, where 8% of all homes sold in the US last year had a Matterport 3D tour, the company has changed how people experience physical spaces. Our product offering is selling exponentially in new markets like apartments, vacation rentals, hotels, event venues, insurance, retail environments, as well as in architecture, engineering, and construction.\u003c/p\u003e\n\u003cp\u003eWe have an end-to-end system for crafting, experiencing, and changing cloud-based immersive 3D models of real spaces. Our system improves the way people experience and visualize physical spaces making it incredibly fun and practical for users to move through real world spaces as if they were there.\u003c/p\u003e\n\u003cp\u003eWe just closed $48 M in Series D revenue last month and were selected as the one of the fastest growing Bay Area private companies based on our year-to-year revenue growth!\u003c/p\u003e\n\u003cp\u003eWe are seeking a Senior Android Software Engineer to help lead development for our 3D technology. We are working with partners to deliver state of the art capture experiences on next generation mobile and camera devices. Are you passionate about building phenomenal mobile software and motivated to take the lead in the creation of mobile apps for capturing, editing, and viewing 3D spaces and objects?  If yes, please reach out to us!\u003c/p\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cp\u003eCollaborate closely with the engineering team and product marketing to define, design, develop, and deliver new exciting features on Matterport’s capture applications\nContinuously explore, evaluate, and incorporate new technology into our products and processes to improve development efficiency\nDeliver a quality software solution using the Agile mobile development cycle\nAnalyze business requirements, provide development estimates, feedback and proper implementation\nDevelop, maintain, support, monitor and optimize existing mobile applications\nResearch and recommend new mobile tools and applications\u003c/p\u003e\n\u003cp\u003eRequirements:\u003c/p\u003e\n\u003cp\u003e6+ years experience in high performance software development\n2+ experience in  Android mobile development experience with deep technical knowledge of mobile frameworks and how to build great reactive UI design\nYou have a solid grasp of core software concepts, including networking, storage/file system, security, memory management, multi-threading, and application lifecycle management\nYou are a thoughtful co-worker, enjoyable to work with, yet able to work independently with minimal supervision in a collaborative work environment.\u003c/p\u003e\n\u003cp\u003eDesired Skills:\u003c/p\u003e\n\u003cp\u003e3D graphics, odometry, photogrammetry knowledge\nOptimizing for performance on mobile (CPU/GPU/memory/latency)\nExperience working with embedded Android\nExperience working with RESTful web APIs\nBS or MS in Computer Science or similar field\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobs.lever.co/matterport/e1232725-a448-4fdc-a885-644c9c56982a?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/matterport/e1232725-a448-4fdc-a885-644c9c56982a?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1prIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--12138d38b70970f7ba9edc7338e8a078539ed1c1/MatterportLogo.png"},{"id":"6d2e991c-8a9f-4c2e-891a-418077614bd0","type":"Full Time","url":"https://jobs.github.com/positions/6d2e991c-8a9f-4c2e-891a-418077614bd0","created_at":"Thu Apr 11 21:47:23 UTC 2019","company":"Simons Foundation","company_url":"http:","location":"New York, NY, USA, 10001","title":"Web Developer","description":"\u003cp\u003ePOSITION SUMMARY\u003c/p\u003e\n\u003cp\u003eThis role will support the maintenance of several websites hosting editorially independent online publications covering research in autism, data and life sciences, mathematics and physics, as well as sites providing information about the foundation's support of basic and applied research.\u003c/p\u003e\n\u003cp\u003eESSENTIAL FUNCTIONS/RESPONSIBILITIES\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSupport back-end and front-end web development for a diverse collection of foundation-affiliated websites, many built on WordPress\u003c/li\u003e\n\u003cli\u003eWork collaboratively and closely with editors, front-end designers, web producers and other developers\u003c/li\u003e\n\u003cli\u003eEffectively manage priorities for multiple concurrent projects\u003c/li\u003e\n\u003cli\u003eCommunicate with stakeholders to gather requirements and ensure their needs are being met\u003c/li\u003e\n\u003cli\u003eAdapt to changing requirements\u003c/li\u003e\n\u003cli\u003ePerform any other duties or tasks as assigned or required\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMINIMUM QUALIFICATIONS\u003c/p\u003e\n\u003cp\u003eEducation\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA bachelor's degree is required\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eExperience\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProficient with WordPress, with 3+ years of experience developing custom WP sites\u003c/li\u003e\n\u003cli\u003eAdvanced expertise with PHP and MySQL\u003c/li\u003e\n\u003cli\u003eDeep understanding of HTML and CSS\u003c/li\u003e\n\u003cli\u003eExperience with JavaScript and jQuery\u003c/li\u003e\n\u003cli\u003eExperience with React or similar JS libraries or frameworks\u003c/li\u003e\n\u003cli\u003eExperience with responsive web development\u003c/li\u003e\n\u003cli\u003eExcellent communication skills\u003c/li\u003e\n\u003cli\u003eProficient with version control tools, such as Git and SVN.\u003c/li\u003e\n\u003cli\u003ePortfolio of work products that function well on multiple device types\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDesirable\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBackground in User Experience and User Interface design\u003c/li\u003e\n\u003cli\u003eExperience with Python and Django\u003c/li\u003e\n\u003cli\u003eExperience with responsive web design, integration and usability testing\u003c/li\u003e\n\u003cli\u003eExperience with high-volume websites and/ or journalistic websites\u003c/li\u003e\n\u003cli\u003eComfort with Adobe Creative Cloud\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTHE SIMONS FOUNDATION'S DIVERSITY COMMITMENT\u003c/p\u003e\n\u003cp\u003eMany of the greatest ideas and discoveries come from a diverse mix of minds, backgrounds and experiences, and we are committed to cultivating an inclusive work environment. The Simons Foundation provides equal opportunities to all employees and applicants for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, genetic disposition, neurodiversity, disability, veteran status, or any other protected category under federal, state and local law.\u003c/p\u003e\n\u003cp\u003eApply Here: \u003ca href=\"http://www.Click2apply.net/gvsr5g9n7nrk8yyx\"\u003ehttp://www.Click2apply.net/gvsr5g9n7nrk8yyx\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePI109186638\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply Here:\u003ca href=\"http://www.Click2apply.net/gvsr5g9n7nrk8yyx\"\u003ehttp://www.Click2apply.net/gvsr5g9n7nrk8yyx\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"4bffa722-d33e-4ee7-b845-4fce3b74c9d9","type":"Full Time","url":"https://jobs.github.com/positions/4bffa722-d33e-4ee7-b845-4fce3b74c9d9","created_at":"Thu Apr 11 20:21:22 UTC 2019","company":"Outside Analytics","company_url":"http://outsideanalytics.com","location":"Boulder","title":"Senior Front End Developer","description":"\u003cp\u003e\u003cstrong\u003eWho We Are\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://outsideanalytics.com\"\u003eOutly\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt Outside Analytics we are passionate about the outdoors and building software that increases outdoor accessibility, usage, and understanding. We are building a data analytics and geospatial processing platform with an innovative web and mobile interface to empower people's outdoor experiences. We believe that the right technology can create stronger connections between people and nature, improve health and wellness, increase environmental empathy, and drive support for public land conservation.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePosition Responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDevelopment, test and deployment of complex and highly performant web applications. Assist in the development of strategic and technology roadmaps, and support the development of mobile applications.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequired Qualifications and Skills\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePassionate about the outdoors and outdoor recreation\u003c/li\u003e\n\u003cli\u003eExpertise in React, Node, JavaScript, HTML, CSS\u003c/li\u003e\n\u003cli\u003eProficiency working with mapping libraries and APIs such as Mapbox or Google Maps\u003c/li\u003e\n\u003cli\u003eAPI development and data driven RESTful web services\u003c/li\u003e\n\u003cli\u003ePerformant querying of backend data stores such as SQL databases and Elasticsearch\u003c/li\u003e\n\u003cli\u003eExperience developing and deploying in Amazon Web Services (AWS)\u003c/li\u003e\n\u003cli\u003eDevOps practices and development tool chains (Github, Jenkins, Chef, etc)\u003c/li\u003e\n\u003cli\u003eInterpersonal skills, taking accountability for objectives, working with minimal oversight\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAdditional Qualifications and Skills\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMobile development (iOS, Android, React Native)\u003c/li\u003e\n\u003cli\u003eExperience with 3D mapping technology (Cesium, Google Earth, etc.)\u003c/li\u003e\n\u003cli\u003eFamiliarity with data science\u003c/li\u003e\n\u003cli\u003eUI/UX, graphic design\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eEducation and Training Required\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e4 year college (Bachelor’s Degree) or higher. Computer Science degree preferred.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMinimum Years of Experience\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e4+ years of real world experience developing proven applications and systems.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLocation\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBoulder, Colorado\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOther\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMust be US Citizen\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:joinus@outsideanalytics.com\"\u003ejoinus@outsideanalytics.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb0ZrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3e45fb2cab85ccb66a1083fed8d606179b78455e/Outly%20Logo%20Square.png"}]